#pragma once

// TheOuterWorlds SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "Indi_Indiana_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Indiana.IndianaUserWidget
// 0x0088 (0x02A8 - 0x0220)
class UIndianaUserWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x88];                                      // 0x0220(0x0088) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.IndianaUserWidget");
		return ptr;
	}


	void STATIC_StartMinimize();
	void STATIC_StartMaximize();
	void STATIC_StartIntro();
	void STATIC_SetDefaultUserFocus();
	void STATIC_RestoreOrSetDefaultUserFocus();
	void STATIC_OnStartOutroCb();
	void STATIC_OnStartMinimizeCb();
	void STATIC_OnStartMaximizeCb();
	void STATIC_OnStartIntroCb();
	bool OnOutro(const struct FScriptDelegate& AnimationCompleteCallback);
	bool OnMinimize(const struct FScriptDelegate& AnimationCompleteCallback);
	bool OnMaximize(const struct FScriptDelegate& AnimationCompleteCallback);
	bool OnIntro(const struct FScriptDelegate& AnimationCompleteCallback);
	void STATIC_OnInputDeviceChanged(bool bUsingGamepad);
	void STATIC_OnFinalizeOutroCb();
	void STATIC_OnFinalizeMinimizeCb();
	void STATIC_OnFinalizeMinimize();
	void STATIC_OnFinalizeMaximizeCb();
	void STATIC_OnFinalizeMaximize();
	void STATIC_OnFinalizeIntroCb();
	void STATIC_OnCounterZero();
	void STATIC_OnCounterNonZero();
	void STATIC_OnCancelShutdown();
	void STATIC_OnCancelMinimize();
	bool ObjectRefHasReferencers();
	bool IsShuttingDown(bool bIncludeTransitioning);
	bool IsMinimized(bool bIncludeTransitioning);
	bool IsMaximized(bool bIncludeTransitioning);
	EWidgetOpenState GetOpenState();
	class AIndianaUI* GetIndianaUI();
};


// Class Indiana.AbilityOverviewChildWidget
// 0x0070 (0x0318 - 0x02A8)
class UAbilityOverviewChildWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x70];                                      // 0x02A8(0x0070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AbilityOverviewChildWidget");
		return ptr;
	}


	void STATIC_OnAbilityCooldownComplete();
	void STATIC_ModifyPulseScale(float PulseScale);
};


// Class Indiana.AbilityOverviewDetailWidget
// 0x0090 (0x03A8 - 0x0318)
class UAbilityOverviewDetailWidget : public UAbilityOverviewChildWidget
{
public:
	unsigned char                                      UnknownData00[0x90];                                      // 0x0318(0x0090) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AbilityOverviewDetailWidget");
		return ptr;
	}


	void STATIC_OnAbilityUnlockChange(EUnlockAbility Ability);
};


// Class Indiana.AbilityOverviewWidget
// 0x02A0 (0x0548 - 0x02A8)
class UAbilityOverviewWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x2A0];                                     // 0x02A8(0x02A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AbilityOverviewWidget");
		return ptr;
	}


	void STATIC_OnPlayerCombatStateChange(bool IsPlayerInCombat, bool bRestoring);
	void STATIC_OnHUDVisibilityChanged(bool bVisible);
	void STATIC_OnHUDModeChanged(int ModeIn);
	void STATIC_OnCompanionAbilityModeChanged(int ModeIn);
	void STATIC_OnCompanionAbilityBindingModeChanged(int ModeIn);
	void STATIC_OnCommandButtonPressed(EAbilityPosition AbillityPosition);
	void STATIC_OnAbilityUsed(class UAbilityOverviewDetailWidget* Widget, EAbilityPosition AbilityPosition);
	void STATIC_OnAbilityCooldownTriggered(EAbilityPosition AbilityPosition);
	void STATIC_OnAbilityCooldownStarted(EAbilityPosition AbilityPosition);
	void STATIC_OnAbilityCooldownFinished(EAbilityPosition AbillityPosition);
	void STATIC_OnAbilityCooldownEnded(EAbilityPosition AbilityPosition);
};


// Class Indiana.AchievementDataAsset
// 0x0028 (0x0060 - 0x0038)
class UAchievementDataAsset : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0038(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AchievementDataAsset");
		return ptr;
	}

};


// Class Indiana.AchievementsManager
// 0x0130 (0x0160 - 0x0030)
class UAchievementsManager : public UObject
{
public:
	unsigned char                                      UnknownData00[0x130];                                     // 0x0030(0x0130) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AchievementsManager");
		return ptr;
	}


	void STATIC_ResetAchievements();
	void STATIC_OnWeaponSlotted(class UItem* Item);
	void STATIC_OnKillPreDeath(class AActor* Victim);
	void STATIC_OnItemEquipped(class UItem* Item);
	void STATIC_OnActiveUserChanged(EActiveUserChangeType ChangeType);
	void STATIC_IncrementAchievement(const struct FName& AchievementBPName, int Count);
	void STATIC_GameOver();
	void STATIC_CompleteAchievementBP(class UAchievementDataAsset* Achievement);
	void STATIC_CompleteAchievement(const struct FName& AchievementBPName);
};


// Class Indiana.AIAction
// 0x0008 (0x0038 - 0x0030)
class UAIAction : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIAction");
		return ptr;
	}

};


// Class Indiana.ActionSequence
// 0x0020 (0x0058 - 0x0038)
class UActionSequence : public UAIAction
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0038(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ActionSequence");
		return ptr;
	}

};


// Class Indiana.BehaviorStateInfo
// 0x00F0 (0x0120 - 0x0030)
class UBehaviorStateInfo : public UObject
{
public:
	unsigned char                                      UnknownData00[0xF0];                                      // 0x0030(0x00F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BehaviorStateInfo");
		return ptr;
	}

};


// Class Indiana.Empty_BehaviorStateInfo
// 0x0000 (0x0120 - 0x0120)
class UEmpty_BehaviorStateInfo : public UBehaviorStateInfo
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Empty_BehaviorStateInfo");
		return ptr;
	}

};


// Class Indiana.ActivatedBehaviorStateInfo
// 0x0000 (0x0120 - 0x0120)
class UActivatedBehaviorStateInfo : public UEmpty_BehaviorStateInfo
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ActivatedBehaviorStateInfo");
		return ptr;
	}

};


// Class Indiana.DecisionTreeRequestData
// 0x0000 (0x0038 - 0x0038)
class UDecisionTreeRequestData : public UDataAsset
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.DecisionTreeRequestData");
		return ptr;
	}

};


// Class Indiana.BehaviorStateRequestData
// 0x0028 (0x0060 - 0x0038)
class UBehaviorStateRequestData : public UDecisionTreeRequestData
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0038(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BehaviorStateRequestData");
		return ptr;
	}

};


// Class Indiana.DecisionTreeEmptyRequestData
// 0x0008 (0x0068 - 0x0060)
class UDecisionTreeEmptyRequestData : public UBehaviorStateRequestData
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0060(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.DecisionTreeEmptyRequestData");
		return ptr;
	}

};


// Class Indiana.ActivatedRequestData
// 0x0000 (0x0068 - 0x0068)
class UActivatedRequestData : public UDecisionTreeEmptyRequestData
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ActivatedRequestData");
		return ptr;
	}

};


// Class Indiana.PooledActor
// 0x0008 (0x0390 - 0x0388)
class APooledActor : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0388(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.PooledActor");
		return ptr;
	}

};


// Class Indiana.ActorPool
// 0x0050 (0x0080 - 0x0030)
class UActorPool : public UObject
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0030(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ActorPool");
		return ptr;
	}

};


// Class Indiana.ActorRenderWidget
// 0x0090 (0x0338 - 0x02A8)
class UActorRenderWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x90];                                      // 0x02A8(0x0090) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ActorRenderWidget");
		return ptr;
	}


	void STATIC_OnMouseZoomOut();
	void STATIC_OnMouseZoomIn();
	void STATIC_OnGamepadToggleFullZoom();
	struct FEventReply OnBorderMouseDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	bool CanZoom();
};


// Class Indiana.ActorStage
// 0x00C8 (0x0450 - 0x0388)
class AActorStage : public AActor
{
public:
	unsigned char                                      UnknownData00[0xC8];                                      // 0x0388(0x00C8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ActorStage");
		return ptr;
	}

};


// Class Indiana.StatusEffect
// 0x0158 (0x0188 - 0x0030)
class UStatusEffect : public UObject
{
public:
	unsigned char                                      UnknownData00[0x158];                                     // 0x0030(0x0158) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.StatusEffect");
		return ptr;
	}


	void STATIC_ReceiveClearEffect(class AActor* Target);
	void STATIC_ReceiveApplyEffect(class AActor* Target, float Ratio, bool bRestoredFromSave);
	class AActor* GetStatusEffectOriginActor();
};


// Class Indiana.AdjustCCCooldownStatusEffect
// 0x0008 (0x0190 - 0x0188)
class UAdjustCCCooldownStatusEffect : public UStatusEffect
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0188(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AdjustCCCooldownStatusEffect");
		return ptr;
	}

};


// Class Indiana.AdjustDurationStatusEffect
// 0x0008 (0x0190 - 0x0188)
class UAdjustDurationStatusEffect : public UStatusEffect
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0188(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AdjustDurationStatusEffect");
		return ptr;
	}

};


// Class Indiana.AICastSpell_AnimNotify
// 0x0008 (0x0048 - 0x0040)
class UAICastSpell_AnimNotify : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0040(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AICastSpell_AnimNotify");
		return ptr;
	}

};


// Class Indiana.AICastSpell_AnimNotifyState
// 0x0008 (0x0040 - 0x0038)
class UAICastSpell_AnimNotifyState : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AICastSpell_AnimNotifyState");
		return ptr;
	}

};


// Class Indiana.SpawnBehavior_AnimNotify
// 0x0000 (0x0040 - 0x0040)
class USpawnBehavior_AnimNotify : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.SpawnBehavior_AnimNotify");
		return ptr;
	}

};


// Class Indiana.AIDecisionUpdate
// 0x0000 (0x0030 - 0x0030)
class UAIDecisionUpdate : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIDecisionUpdate");
		return ptr;
	}

};


// Class Indiana.AIDecisionUpdate_Mantisaur
// 0x0008 (0x0038 - 0x0030)
class UAIDecisionUpdate_Mantisaur : public UAIDecisionUpdate
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIDecisionUpdate_Mantisaur");
		return ptr;
	}

};


// Class Indiana.AIDecisionUpdate_Mantiqueen
// 0x0008 (0x0038 - 0x0030)
class UAIDecisionUpdate_Mantiqueen : public UAIDecisionUpdate
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIDecisionUpdate_Mantiqueen");
		return ptr;
	}

};


// Class Indiana.AIDecisionUpdate_HealDrone
// 0x0008 (0x0038 - 0x0030)
class UAIDecisionUpdate_HealDrone : public UAIDecisionUpdate
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIDecisionUpdate_HealDrone");
		return ptr;
	}

};


// Class Indiana.AIDecisionUpdate_CanidHowl
// 0x0018 (0x0048 - 0x0030)
class UAIDecisionUpdate_CanidHowl : public UAIDecisionUpdate
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0030(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIDecisionUpdate_CanidHowl");
		return ptr;
	}

};


// Class Indiana.AIDecisionUpdate_ShieldBot
// 0x0010 (0x0040 - 0x0030)
class UAIDecisionUpdate_ShieldBot : public UAIDecisionUpdate
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0030(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIDecisionUpdate_ShieldBot");
		return ptr;
	}

};


// Class Indiana.AIDefensiveActionsComponent
// 0x0040 (0x0158 - 0x0118)
class UAIDefensiveActionsComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0118(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIDefensiveActionsComponent");
		return ptr;
	}


	void STATIC_OnTakeDamage(const struct FCauseDamageInfo& CauseDamageInfo);
};


// Class Indiana.AIDetectionComponent
// 0x0138 (0x0250 - 0x0118)
class UAIDetectionComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x138];                                     // 0x0118(0x0138) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIDetectionComponent");
		return ptr;
	}


	void STATIC_OnPlayerKill(class AActor* Victim, const struct FCauseDamageInfo& CauseDamageInfo);
	void STATIC_OnPerceptionUpdate(class AActor* Actor, const struct FAIStimulus& Stimulus);
	void STATIC_OnDetectedNonHostileCombatStateChange(bool bIsInCombat, bool bRestoring);
};


// Class Indiana.AIEventInfo
// 0x0000 (0x0030 - 0x0030)
class UAIEventInfo : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIEventInfo");
		return ptr;
	}

};


// Class Indiana.AIEventInfo_Location
// 0x0010 (0x0040 - 0x0030)
class UAIEventInfo_Location : public UAIEventInfo
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0030(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIEventInfo_Location");
		return ptr;
	}

};


// Class Indiana.AIEventInfo_Direction
// 0x0010 (0x0040 - 0x0030)
class UAIEventInfo_Direction : public UAIEventInfo
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0030(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIEventInfo_Direction");
		return ptr;
	}

};


// Class Indiana.AIEventInfo_Actor
// 0x0008 (0x0038 - 0x0030)
class UAIEventInfo_Actor : public UAIEventInfo
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIEventInfo_Actor");
		return ptr;
	}

};


// Class Indiana.AIEventInfo_StatusEffect
// 0x0008 (0x0038 - 0x0030)
class UAIEventInfo_StatusEffect : public UAIEventInfo
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIEventInfo_StatusEffect");
		return ptr;
	}

};


// Class Indiana.AIEventInfo_Spell
// 0x0018 (0x0048 - 0x0030)
class UAIEventInfo_Spell : public UAIEventInfo
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0030(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIEventInfo_Spell");
		return ptr;
	}

};


// Class Indiana.AIEventInfo_CalledShot
// 0x0018 (0x0048 - 0x0030)
class UAIEventInfo_CalledShot : public UAIEventInfo
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0030(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIEventInfo_CalledShot");
		return ptr;
	}

};


// Class Indiana.AIEventInfo_Behavior
// 0x0010 (0x0040 - 0x0030)
class UAIEventInfo_Behavior : public UAIEventInfo
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0030(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIEventInfo_Behavior");
		return ptr;
	}

};


// Class Indiana.AIEventInfo_Float
// 0x0008 (0x0038 - 0x0030)
class UAIEventInfo_Float : public UAIEventInfo
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIEventInfo_Float");
		return ptr;
	}

};


// Class Indiana.AIEventInfo_Transform
// 0x0030 (0x0060 - 0x0030)
class UAIEventInfo_Transform : public UAIEventInfo
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0030(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIEventInfo_Transform");
		return ptr;
	}

};


// Class Indiana.InteractionComponent
// 0x0010 (0x0128 - 0x0118)
class UInteractionComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0118(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.InteractionComponent");
		return ptr;
	}

};


// Class Indiana.AIInteractionComponent
// 0x0050 (0x0178 - 0x0128)
class UAIInteractionComponent : public UInteractionComponent
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0128(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIInteractionComponent");
		return ptr;
	}


	void STATIC_OnNavigationPathUpdate();
};


// Class Indiana.AimAssistComponent
// 0x04A8 (0x05C0 - 0x0118)
class UAimAssistComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x4A8];                                     // 0x0118(0x04A8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AimAssistComponent");
		return ptr;
	}


	void STATIC_ToggleTrackQuickTarget();
	void STATIC_ToggleTargetStrafeLock();
	void STATIC_ToggleFriction();
	void STATIC_ToggleBulletMagnetism();
	void STATIC_ToggleAimAssist();
	void STATIC_OnDifficultyChanged(EGameDifficulty NewDifficulty);
	void STATIC_EnableAimAssist(bool Enabled);
	void STATIC_AimAssistVisualSpread(bool bEnable);
	void STATIC_AimAssistVisualFriction(bool bEnable);
	void STATIC_AimAssistVisualBulletMagnetism(bool bEnable);
	void STATIC_AimAssistVisualAdhesion(bool bEnable);
};


// Class Indiana.AimAssistData
// 0x0030 (0x0068 - 0x0038)
class UAimAssistData : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0038(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AimAssistData");
		return ptr;
	}

};


// Class Indiana.IndianaCharMovementComponent
// 0x02A0 (0x0A10 - 0x0770)
class UIndianaCharMovementComponent : public UCharacterMovementComponent
{
public:
	unsigned char                                      UnknownData00[0x2A0];                                     // 0x0770(0x02A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.IndianaCharMovementComponent");
		return ptr;
	}


	void STATIC_OnBumped(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
};


// Class Indiana.AIMovementComponent
// 0x0150 (0x0B60 - 0x0A10)
class UAIMovementComponent : public UIndianaCharMovementComponent
{
public:
	unsigned char                                      UnknownData00[0x150];                                     // 0x0A10(0x0150) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIMovementComponent");
		return ptr;
	}


	void STATIC_OnRestoredStateOfBeing(EStateOfBeing RestoredStateOfBeing);
	void STATIC_OnNewStateOfBeing(EStateOfBeing NewStateOfBeing, EStateOfBeing OldStateOfBeing);
	void STATIC_OnExtremaEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex);
	void STATIC_OnExtremaBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
};


// Class Indiana.AIPossessable
// 0x0000 (0x0030 - 0x0030)
class UAIPossessable : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIPossessable");
		return ptr;
	}

};


// Class Indiana.AI_AIAction
// 0x0000 (0x0030 - 0x0030)
class UAI_AIAction : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AI_AIAction");
		return ptr;
	}

};


// Class Indiana.Patrol_PatrolNodeAction
// 0x0000 (0x0030 - 0x0030)
class UPatrol_PatrolNodeAction : public UAI_AIAction
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Patrol_PatrolNodeAction");
		return ptr;
	}

};


// Class Indiana.AIActor
// 0x0000 (0x0030 - 0x0030)
class UAIActor : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIActor");
		return ptr;
	}

};


// Class Indiana.AIActorWritable
// 0x0000 (0x0030 - 0x0030)
class UAIActorWritable : public UAIActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIActorWritable");
		return ptr;
	}

};


// Class Indiana.General_Player
// 0x0000 (0x0030 - 0x0030)
class UGeneral_Player : public UAIActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_Player");
		return ptr;
	}

};


// Class Indiana.General_PrimaryTarget
// 0x0000 (0x0030 - 0x0030)
class UGeneral_PrimaryTarget : public UAIActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_PrimaryTarget");
		return ptr;
	}

};


// Class Indiana.General_DecisionTreeActor
// 0x0000 (0x0030 - 0x0030)
class UGeneral_DecisionTreeActor : public UAIActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_DecisionTreeActor");
		return ptr;
	}

};


// Class Indiana.General_Self
// 0x0000 (0x0030 - 0x0030)
class UGeneral_Self : public UAIActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_Self");
		return ptr;
	}

};


// Class Indiana.Patrol_PatrolNode
// 0x0000 (0x0030 - 0x0030)
class UPatrol_PatrolNode : public UAIActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Patrol_PatrolNode");
		return ptr;
	}

};


// Class Indiana.Cover_CurrentCoverNode
// 0x0000 (0x0030 - 0x0030)
class UCover_CurrentCoverNode : public UAIActorWritable
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Cover_CurrentCoverNode");
		return ptr;
	}

};


// Class Indiana.CompanionFollow_Target
// 0x0000 (0x0030 - 0x0030)
class UCompanionFollow_Target : public UAIActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionFollow_Target");
		return ptr;
	}

};


// Class Indiana.CompanionFollow_Position
// 0x0000 (0x0030 - 0x0030)
class UCompanionFollow_Position : public UAIActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionFollow_Position");
		return ptr;
	}

};


// Class Indiana.Follow_Target
// 0x0000 (0x0030 - 0x0030)
class UFollow_Target : public UAIActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Follow_Target");
		return ptr;
	}

};


// Class Indiana.General_HealTarget
// 0x0000 (0x0030 - 0x0030)
class UGeneral_HealTarget : public UAIActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_HealTarget");
		return ptr;
	}

};


// Class Indiana.AIBool
// 0x0000 (0x0030 - 0x0030)
class UAIBool : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIBool");
		return ptr;
	}

};


// Class Indiana.AIBoolWriteable
// 0x0000 (0x0030 - 0x0030)
class UAIBoolWriteable : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIBoolWriteable");
		return ptr;
	}

};


// Class Indiana.General_True
// 0x0000 (0x0030 - 0x0030)
class UGeneral_True : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_True");
		return ptr;
	}

};


// Class Indiana.Settings_MovingFireEnabled
// 0x0000 (0x0030 - 0x0030)
class USettings_MovingFireEnabled : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_MovingFireEnabled");
		return ptr;
	}

};


// Class Indiana.Settings_WalkingFireEnabled
// 0x0000 (0x0030 - 0x0030)
class USettings_WalkingFireEnabled : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_WalkingFireEnabled");
		return ptr;
	}

};


// Class Indiana.General_ShouldServiceExitTask
// 0x0000 (0x0030 - 0x0030)
class UGeneral_ShouldServiceExitTask : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_ShouldServiceExitTask");
		return ptr;
	}

};


// Class Indiana.General_ShouldFaceTargetWhileMoving
// 0x0000 (0x0030 - 0x0030)
class UGeneral_ShouldFaceTargetWhileMoving : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_ShouldFaceTargetWhileMoving");
		return ptr;
	}

};


// Class Indiana.General_IsWeaponRanged
// 0x0000 (0x0030 - 0x0030)
class UGeneral_IsWeaponRanged : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_IsWeaponRanged");
		return ptr;
	}

};


// Class Indiana.General_ShouldScope
// 0x0000 (0x0030 - 0x0030)
class UGeneral_ShouldScope : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_ShouldScope");
		return ptr;
	}

};


// Class Indiana.General_IsFullyCrouched
// 0x0000 (0x0030 - 0x0030)
class UGeneral_IsFullyCrouched : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_IsFullyCrouched");
		return ptr;
	}

};


// Class Indiana.General_IsFullyUncrouched
// 0x0000 (0x0030 - 0x0030)
class UGeneral_IsFullyUncrouched : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_IsFullyUncrouched");
		return ptr;
	}

};


// Class Indiana.General_IsMoveToSuccessful
// 0x0000 (0x0030 - 0x0030)
class UGeneral_IsMoveToSuccessful : public UAIBoolWriteable
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_IsMoveToSuccessful");
		return ptr;
	}

};


// Class Indiana.Patrol_PatrolNodeOrientOnArrival
// 0x0000 (0x0030 - 0x0030)
class UPatrol_PatrolNodeOrientOnArrival : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Patrol_PatrolNodeOrientOnArrival");
		return ptr;
	}

};


// Class Indiana.Patrol_PatrolRunMovementStateEnabled
// 0x0000 (0x0030 - 0x0030)
class UPatrol_PatrolRunMovementStateEnabled : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Patrol_PatrolRunMovementStateEnabled");
		return ptr;
	}

};


// Class Indiana.Patrol_PatrolNodeActionInfiniteDuration
// 0x0000 (0x0030 - 0x0030)
class UPatrol_PatrolNodeActionInfiniteDuration : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Patrol_PatrolNodeActionInfiniteDuration");
		return ptr;
	}

};


// Class Indiana.Follow_ClearTargetDetection
// 0x0000 (0x0030 - 0x0030)
class UFollow_ClearTargetDetection : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Follow_ClearTargetDetection");
		return ptr;
	}

};


// Class Indiana.Follow_Retreating
// 0x0000 (0x0030 - 0x0030)
class UFollow_Retreating : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Follow_Retreating");
		return ptr;
	}

};


// Class Indiana.Follow_IsCompanionCommandOrClearTargetDetection
// 0x0000 (0x0030 - 0x0030)
class UFollow_IsCompanionCommandOrClearTargetDetection : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Follow_IsCompanionCommandOrClearTargetDetection");
		return ptr;
	}

};


// Class Indiana.CalledShot_IsTargetReactionComplete
// 0x0000 (0x0030 - 0x0030)
class UCalledShot_IsTargetReactionComplete : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CalledShot_IsTargetReactionComplete");
		return ptr;
	}

};


// Class Indiana.CalledShot_IsAttackAnimationComplete
// 0x0000 (0x0030 - 0x0030)
class UCalledShot_IsAttackAnimationComplete : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CalledShot_IsAttackAnimationComplete");
		return ptr;
	}

};


// Class Indiana.SwitchWeapon_IsInstant
// 0x0000 (0x0030 - 0x0030)
class USwitchWeapon_IsInstant : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.SwitchWeapon_IsInstant");
		return ptr;
	}

};


// Class Indiana.Jump_ShouldRotateToFaceTargetMidAir
// 0x0000 (0x0030 - 0x0030)
class UJump_ShouldRotateToFaceTargetMidAir : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Jump_ShouldRotateToFaceTargetMidAir");
		return ptr;
	}

};


// Class Indiana.Search_ShouldFire
// 0x0000 (0x0030 - 0x0030)
class USearch_ShouldFire : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Search_ShouldFire");
		return ptr;
	}

};


// Class Indiana.Search_ShouldStationaryFire
// 0x0000 (0x0030 - 0x0030)
class USearch_ShouldStationaryFire : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Search_ShouldStationaryFire");
		return ptr;
	}

};


// Class Indiana.Search_HasNoQueuedDecisionTreeRequest
// 0x0000 (0x0030 - 0x0030)
class USearch_HasNoQueuedDecisionTreeRequest : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Search_HasNoQueuedDecisionTreeRequest");
		return ptr;
	}

};


// Class Indiana.Search_RequiresReachable
// 0x0000 (0x0030 - 0x0030)
class USearch_RequiresReachable : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Search_RequiresReachable");
		return ptr;
	}

};


// Class Indiana.Search_ShouldIgnoreCollisionDuringTargetApproach
// 0x0000 (0x0030 - 0x0030)
class USearch_ShouldIgnoreCollisionDuringTargetApproach : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Search_ShouldIgnoreCollisionDuringTargetApproach");
		return ptr;
	}

};


// Class Indiana.Search_ShouldBumpDuringTargetApproach
// 0x0000 (0x0030 - 0x0030)
class USearch_ShouldBumpDuringTargetApproach : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Search_ShouldBumpDuringTargetApproach");
		return ptr;
	}

};


// Class Indiana.Search_ShouldSprintDuringTargetApproach
// 0x0000 (0x0030 - 0x0030)
class USearch_ShouldSprintDuringTargetApproach : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Search_ShouldSprintDuringTargetApproach");
		return ptr;
	}

};


// Class Indiana.OnRails_ShouldChase
// 0x0000 (0x0030 - 0x0030)
class UOnRails_ShouldChase : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.OnRails_ShouldChase");
		return ptr;
	}

};


// Class Indiana.OnRails_IsOnRails
// 0x0000 (0x0030 - 0x0030)
class UOnRails_IsOnRails : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.OnRails_IsOnRails");
		return ptr;
	}

};


// Class Indiana.Melee_UseAdaptiveRootMotion
// 0x0000 (0x0030 - 0x0030)
class UMelee_UseAdaptiveRootMotion : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Melee_UseAdaptiveRootMotion");
		return ptr;
	}

};


// Class Indiana.Melee_IsPatternComplete
// 0x0000 (0x0030 - 0x0030)
class UMelee_IsPatternComplete : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Melee_IsPatternComplete");
		return ptr;
	}

};


// Class Indiana.Melee_ShouldLookAtTargetDuringRecovery
// 0x0000 (0x0030 - 0x0030)
class UMelee_ShouldLookAtTargetDuringRecovery : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Melee_ShouldLookAtTargetDuringRecovery");
		return ptr;
	}

};


// Class Indiana.Melee_ShouldIgnoreCollisionDuringApproach
// 0x0000 (0x0030 - 0x0030)
class UMelee_ShouldIgnoreCollisionDuringApproach : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Melee_ShouldIgnoreCollisionDuringApproach");
		return ptr;
	}

};


// Class Indiana.Melee_ShouldBumpDuringApproach
// 0x0000 (0x0030 - 0x0030)
class UMelee_ShouldBumpDuringApproach : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Melee_ShouldBumpDuringApproach");
		return ptr;
	}

};


// Class Indiana.Melee_ShouldSprintDuringApproach
// 0x0000 (0x0030 - 0x0030)
class UMelee_ShouldSprintDuringApproach : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Melee_ShouldSprintDuringApproach");
		return ptr;
	}

};


// Class Indiana.Furniture_ShouldComplete
// 0x0000 (0x0030 - 0x0030)
class UFurniture_ShouldComplete : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Furniture_ShouldComplete");
		return ptr;
	}

};


// Class Indiana.CompanionCommandMoveTo_StationaryAttackEnabled
// 0x0000 (0x0030 - 0x0030)
class UCompanionCommandMoveTo_StationaryAttackEnabled : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionCommandMoveTo_StationaryAttackEnabled");
		return ptr;
	}

};


// Class Indiana.CompanionCommandMoveTo_MovingAttackEnabled
// 0x0000 (0x0030 - 0x0030)
class UCompanionCommandMoveTo_MovingAttackEnabled : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionCommandMoveTo_MovingAttackEnabled");
		return ptr;
	}

};


// Class Indiana.Cower_ShouldCower
// 0x0000 (0x0030 - 0x0030)
class UCower_ShouldCower : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Cower_ShouldCower");
		return ptr;
	}

};


// Class Indiana.MoveTo_ShouldFaceTargetWhileWaiting
// 0x0000 (0x0030 - 0x0030)
class UMoveTo_ShouldFaceTargetWhileWaiting : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.MoveTo_ShouldFaceTargetWhileWaiting");
		return ptr;
	}

};


// Class Indiana.Spawn_IsFinishedSpawning
// 0x0000 (0x0030 - 0x0030)
class USpawn_IsFinishedSpawning : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Spawn_IsFinishedSpawning");
		return ptr;
	}

};


// Class Indiana.Conversation_ShouldTeleport
// 0x0000 (0x0030 - 0x0030)
class UConversation_ShouldTeleport : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Conversation_ShouldTeleport");
		return ptr;
	}

};


// Class Indiana.General_CanSeeHealTarget
// 0x0000 (0x0030 - 0x0030)
class UGeneral_CanSeeHealTarget : public UAIBool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_CanSeeHealTarget");
		return ptr;
	}

};


// Class Indiana.AIEQSParameter
// 0x0000 (0x0030 - 0x0030)
class UAIEQSParameter : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIEQSParameter");
		return ptr;
	}

};


// Class Indiana.CompanionFollow_DefaultRadius
// 0x0000 (0x0030 - 0x0030)
class UCompanionFollow_DefaultRadius : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionFollow_DefaultRadius");
		return ptr;
	}

};


// Class Indiana.CompanionFollow_InnerRadius
// 0x0000 (0x0030 - 0x0030)
class UCompanionFollow_InnerRadius : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionFollow_InnerRadius");
		return ptr;
	}

};


// Class Indiana.CompanionFollow_InnerPointAmount
// 0x0000 (0x0030 - 0x0030)
class UCompanionFollow_InnerPointAmount : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionFollow_InnerPointAmount");
		return ptr;
	}

};


// Class Indiana.CompanionFollow_DefaultIdealAngle
// 0x0000 (0x0030 - 0x0030)
class UCompanionFollow_DefaultIdealAngle : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionFollow_DefaultIdealAngle");
		return ptr;
	}

};


// Class Indiana.CompanionFollow_DefaultMinAngle
// 0x0000 (0x0030 - 0x0030)
class UCompanionFollow_DefaultMinAngle : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionFollow_DefaultMinAngle");
		return ptr;
	}

};


// Class Indiana.CompanionMoveTo_DefaultRadius
// 0x0000 (0x0030 - 0x0030)
class UCompanionMoveTo_DefaultRadius : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionMoveTo_DefaultRadius");
		return ptr;
	}

};


// Class Indiana.CompanionMoveTo_DefaultIdealAngle
// 0x0000 (0x0030 - 0x0030)
class UCompanionMoveTo_DefaultIdealAngle : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionMoveTo_DefaultIdealAngle");
		return ptr;
	}

};


// Class Indiana.CompanionMoveTo_DefaultMinAngle
// 0x0000 (0x0030 - 0x0030)
class UCompanionMoveTo_DefaultMinAngle : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionMoveTo_DefaultMinAngle");
		return ptr;
	}

};


// Class Indiana.Settings_MinMoveDistance
// 0x0000 (0x0030 - 0x0030)
class USettings_MinMoveDistance : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_MinMoveDistance");
		return ptr;
	}

};


// Class Indiana.Settings_MaxMoveDistance
// 0x0000 (0x0030 - 0x0030)
class USettings_MaxMoveDistance : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_MaxMoveDistance");
		return ptr;
	}

};


// Class Indiana.Settings_MaxMoveDistanceThreshold
// 0x0000 (0x0030 - 0x0030)
class USettings_MaxMoveDistanceThreshold : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_MaxMoveDistanceThreshold");
		return ptr;
	}

};


// Class Indiana.Settings_MinPreferredRange
// 0x0000 (0x0030 - 0x0030)
class USettings_MinPreferredRange : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_MinPreferredRange");
		return ptr;
	}

};


// Class Indiana.Settings_MaxPreferredRange
// 0x0000 (0x0030 - 0x0030)
class USettings_MaxPreferredRange : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_MaxPreferredRange");
		return ptr;
	}

};


// Class Indiana.Settings_AllowedCoverTypes
// 0x0000 (0x0030 - 0x0030)
class USettings_AllowedCoverTypes : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_AllowedCoverTypes");
		return ptr;
	}

};


// Class Indiana.Settings_FullHeight
// 0x0000 (0x0030 - 0x0030)
class USettings_FullHeight : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_FullHeight");
		return ptr;
	}

};


// Class Indiana.Settings_RepositionType
// 0x0000 (0x0030 - 0x0030)
class USettings_RepositionType : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_RepositionType");
		return ptr;
	}

};


// Class Indiana.Settings_MeleeRecoveryMoveMinDistance
// 0x0000 (0x0030 - 0x0030)
class USettings_MeleeRecoveryMoveMinDistance : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_MeleeRecoveryMoveMinDistance");
		return ptr;
	}

};


// Class Indiana.Settings_MeleeRecoveryMoveMaxDistance
// 0x0000 (0x0030 - 0x0030)
class USettings_MeleeRecoveryMoveMaxDistance : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_MeleeRecoveryMoveMaxDistance");
		return ptr;
	}

};


// Class Indiana.MeleeSlot_NumRings
// 0x0000 (0x0030 - 0x0030)
class UMeleeSlot_NumRings : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.MeleeSlot_NumRings");
		return ptr;
	}

};


// Class Indiana.MeleeSlot_PointsPerRing
// 0x0000 (0x0030 - 0x0030)
class UMeleeSlot_PointsPerRing : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.MeleeSlot_PointsPerRing");
		return ptr;
	}

};


// Class Indiana.Wander_Radius
// 0x0000 (0x0030 - 0x0030)
class UWander_Radius : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Wander_Radius");
		return ptr;
	}

};


// Class Indiana.Wander_MinMoveDistance
// 0x0000 (0x0030 - 0x0030)
class UWander_MinMoveDistance : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Wander_MinMoveDistance");
		return ptr;
	}

};


// Class Indiana.Wander_MaxMoveDistance
// 0x0000 (0x0030 - 0x0030)
class UWander_MaxMoveDistance : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Wander_MaxMoveDistance");
		return ptr;
	}

};


// Class Indiana.Wander_MaxPathDistance
// 0x0000 (0x0030 - 0x0030)
class UWander_MaxPathDistance : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Wander_MaxPathDistance");
		return ptr;
	}

};


// Class Indiana.RangedRepositionType_Stationary
// 0x0000 (0x0030 - 0x0030)
class URangedRepositionType_Stationary : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.RangedRepositionType_Stationary");
		return ptr;
	}

};


// Class Indiana.RangedRepositionType_Strafe
// 0x0000 (0x0030 - 0x0030)
class URangedRepositionType_Strafe : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.RangedRepositionType_Strafe");
		return ptr;
	}

};


// Class Indiana.RangedRepositionType_Forward
// 0x0000 (0x0030 - 0x0030)
class URangedRepositionType_Forward : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.RangedRepositionType_Forward");
		return ptr;
	}

};


// Class Indiana.CompanionCalledShot_MinMeleeRange
// 0x0000 (0x0030 - 0x0030)
class UCompanionCalledShot_MinMeleeRange : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionCalledShot_MinMeleeRange");
		return ptr;
	}

};


// Class Indiana.CompanionCalledShot_MaxMeleeRange
// 0x0000 (0x0030 - 0x0030)
class UCompanionCalledShot_MaxMeleeRange : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionCalledShot_MaxMeleeRange");
		return ptr;
	}

};


// Class Indiana.CompanionCalledShot_MinLimitedRange
// 0x0000 (0x0030 - 0x0030)
class UCompanionCalledShot_MinLimitedRange : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionCalledShot_MinLimitedRange");
		return ptr;
	}

};


// Class Indiana.CompanionCalledShot_MaxLimitedRange
// 0x0000 (0x0030 - 0x0030)
class UCompanionCalledShot_MaxLimitedRange : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionCalledShot_MaxLimitedRange");
		return ptr;
	}

};


// Class Indiana.Townie_MaxFleeDistance
// 0x0000 (0x0030 - 0x0030)
class UTownie_MaxFleeDistance : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Townie_MaxFleeDistance");
		return ptr;
	}

};


// Class Indiana.Settings_MaxUnmarkedFleeDistance
// 0x0000 (0x0030 - 0x0030)
class USettings_MaxUnmarkedFleeDistance : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_MaxUnmarkedFleeDistance");
		return ptr;
	}

};


// Class Indiana.Settings_MaxUnmarkedFleePathDistance
// 0x0000 (0x0030 - 0x0030)
class USettings_MaxUnmarkedFleePathDistance : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_MaxUnmarkedFleePathDistance");
		return ptr;
	}

};


// Class Indiana.Investigate_DeadBodyWanderRadius
// 0x0000 (0x0030 - 0x0030)
class UInvestigate_DeadBodyWanderRadius : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Investigate_DeadBodyWanderRadius");
		return ptr;
	}

};


// Class Indiana.Investigate_DeadBodyWanderMinMoveDistance
// 0x0000 (0x0030 - 0x0030)
class UInvestigate_DeadBodyWanderMinMoveDistance : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Investigate_DeadBodyWanderMinMoveDistance");
		return ptr;
	}

};


// Class Indiana.Investigate_DeadBodyWanderMaxMoveDistance
// 0x0000 (0x0030 - 0x0030)
class UInvestigate_DeadBodyWanderMaxMoveDistance : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Investigate_DeadBodyWanderMaxMoveDistance");
		return ptr;
	}

};


// Class Indiana.Investigate_DeadBodyWanderMaxPathDistance
// 0x0000 (0x0030 - 0x0030)
class UInvestigate_DeadBodyWanderMaxPathDistance : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Investigate_DeadBodyWanderMaxPathDistance");
		return ptr;
	}

};


// Class Indiana.Search_WanderRadius
// 0x0000 (0x0030 - 0x0030)
class USearch_WanderRadius : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Search_WanderRadius");
		return ptr;
	}

};


// Class Indiana.Search_WanderMinMoveDistance
// 0x0000 (0x0030 - 0x0030)
class USearch_WanderMinMoveDistance : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Search_WanderMinMoveDistance");
		return ptr;
	}

};


// Class Indiana.Search_WanderMaxMoveDistance
// 0x0000 (0x0030 - 0x0030)
class USearch_WanderMaxMoveDistance : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Search_WanderMaxMoveDistance");
		return ptr;
	}

};


// Class Indiana.Search_WanderMaxPathDistance
// 0x0000 (0x0030 - 0x0030)
class USearch_WanderMaxPathDistance : public UAIEQSParameter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Search_WanderMaxPathDistance");
		return ptr;
	}

};


// Class Indiana.AIFiringPattern
// 0x0000 (0x0030 - 0x0030)
class UAIFiringPattern : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIFiringPattern");
		return ptr;
	}

};


// Class Indiana.Settings_StationaryFiringPattern
// 0x0000 (0x0030 - 0x0030)
class USettings_StationaryFiringPattern : public UAIFiringPattern
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_StationaryFiringPattern");
		return ptr;
	}

};


// Class Indiana.Settings_CoverFiringPattern
// 0x0000 (0x0030 - 0x0030)
class USettings_CoverFiringPattern : public UAIFiringPattern
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_CoverFiringPattern");
		return ptr;
	}

};


// Class Indiana.Settings_MovingFiringPattern
// 0x0000 (0x0030 - 0x0030)
class USettings_MovingFiringPattern : public UAIFiringPattern
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_MovingFiringPattern");
		return ptr;
	}

};


// Class Indiana.Settings_CalledShotRangeFiringPattern
// 0x0000 (0x0030 - 0x0030)
class USettings_CalledShotRangeFiringPattern : public UAIFiringPattern
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_CalledShotRangeFiringPattern");
		return ptr;
	}

};


// Class Indiana.AIFValue
// 0x0000 (0x0030 - 0x0030)
class UAIFValue : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIFValue");
		return ptr;
	}

};


// Class Indiana.Weapon_MinMeleeRange
// 0x0000 (0x0030 - 0x0030)
class UWeapon_MinMeleeRange : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Weapon_MinMeleeRange");
		return ptr;
	}

};


// Class Indiana.Weapon_MaxMeleeRange
// 0x0000 (0x0030 - 0x0030)
class UWeapon_MaxMeleeRange : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Weapon_MaxMeleeRange");
		return ptr;
	}

};


// Class Indiana.Weapon_MaxMeleeRangeWithPadding
// 0x0000 (0x0030 - 0x0030)
class UWeapon_MaxMeleeRangeWithPadding : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Weapon_MaxMeleeRangeWithPadding");
		return ptr;
	}

};


// Class Indiana.Weapon_MeleeRecoveryMoveRandomChance
// 0x0000 (0x0030 - 0x0030)
class UWeapon_MeleeRecoveryMoveRandomChance : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Weapon_MeleeRecoveryMoveRandomChance");
		return ptr;
	}

};


// Class Indiana.Weapon_MeleeRecoveryDodgeRandomChance
// 0x0000 (0x0030 - 0x0030)
class UWeapon_MeleeRecoveryDodgeRandomChance : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Weapon_MeleeRecoveryDodgeRandomChance");
		return ptr;
	}

};


// Class Indiana.Weapon_MeleeRecoveryMaxTargetDistance
// 0x0000 (0x0030 - 0x0030)
class UWeapon_MeleeRecoveryMaxTargetDistance : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Weapon_MeleeRecoveryMaxTargetDistance");
		return ptr;
	}

};


// Class Indiana.Weapon_MeleeAdapativeRootmotionStopDistance
// 0x0000 (0x0030 - 0x0030)
class UWeapon_MeleeAdapativeRootmotionStopDistance : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Weapon_MeleeAdapativeRootmotionStopDistance");
		return ptr;
	}

};


// Class Indiana.Weapon_CalledShotMeleeAdapativeRootmotionStopDistance
// 0x0000 (0x0030 - 0x0030)
class UWeapon_CalledShotMeleeAdapativeRootmotionStopDistance : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Weapon_CalledShotMeleeAdapativeRootmotionStopDistance");
		return ptr;
	}

};


// Class Indiana.Settings_MovingFirePrePauseTime
// 0x0000 (0x0030 - 0x0030)
class USettings_MovingFirePrePauseTime : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_MovingFirePrePauseTime");
		return ptr;
	}

};


// Class Indiana.Settings_MaxPreferredRangeF
// 0x0000 (0x0030 - 0x0030)
class USettings_MaxPreferredRangeF : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_MaxPreferredRangeF");
		return ptr;
	}

};


// Class Indiana.Settings_MaxAbsoluteRange
// 0x0000 (0x0030 - 0x0030)
class USettings_MaxAbsoluteRange : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_MaxAbsoluteRange");
		return ptr;
	}

};


// Class Indiana.Settings_PreferredRange
// 0x0000 (0x0030 - 0x0030)
class USettings_PreferredRange : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_PreferredRange");
		return ptr;
	}

};


// Class Indiana.Settings_CoverWalkingDistanceThreshold
// 0x0000 (0x0030 - 0x0030)
class USettings_CoverWalkingDistanceThreshold : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_CoverWalkingDistanceThreshold");
		return ptr;
	}

};


// Class Indiana.Settings_RangedRepositionWalkingDistanceThreshold
// 0x0000 (0x0030 - 0x0030)
class USettings_RangedRepositionWalkingDistanceThreshold : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_RangedRepositionWalkingDistanceThreshold");
		return ptr;
	}

};


// Class Indiana.Settings_TargetLostTimeInitiallySeenRanged
// 0x0000 (0x0030 - 0x0030)
class USettings_TargetLostTimeInitiallySeenRanged : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_TargetLostTimeInitiallySeenRanged");
		return ptr;
	}

};


// Class Indiana.Settings_TargetLostTimeInitiallyUnseenRanged
// 0x0000 (0x0030 - 0x0030)
class USettings_TargetLostTimeInitiallyUnseenRanged : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_TargetLostTimeInitiallyUnseenRanged");
		return ptr;
	}

};


// Class Indiana.Settings_TargetLostTimeInitiallySeenCover
// 0x0000 (0x0030 - 0x0030)
class USettings_TargetLostTimeInitiallySeenCover : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_TargetLostTimeInitiallySeenCover");
		return ptr;
	}

};


// Class Indiana.Settings_TargetLostTimeInitiallyUnseenCover
// 0x0000 (0x0030 - 0x0030)
class USettings_TargetLostTimeInitiallyUnseenCover : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_TargetLostTimeInitiallyUnseenCover");
		return ptr;
	}

};


// Class Indiana.Settings_SuppressingFireTime
// 0x0000 (0x0030 - 0x0030)
class USettings_SuppressingFireTime : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_SuppressingFireTime");
		return ptr;
	}

};


// Class Indiana.Settings_MinMeleeActionDelay
// 0x0000 (0x0030 - 0x0030)
class USettings_MinMeleeActionDelay : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_MinMeleeActionDelay");
		return ptr;
	}

};


// Class Indiana.Settings_MeleeRecoveryDelay
// 0x0000 (0x0030 - 0x0030)
class USettings_MeleeRecoveryDelay : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_MeleeRecoveryDelay");
		return ptr;
	}

};


// Class Indiana.Settings_MeleeWaitDistance
// 0x0000 (0x0030 - 0x0030)
class USettings_MeleeWaitDistance : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_MeleeWaitDistance");
		return ptr;
	}

};


// Class Indiana.Settings_WanderIdleTime
// 0x0000 (0x0030 - 0x0030)
class USettings_WanderIdleTime : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_WanderIdleTime");
		return ptr;
	}

};


// Class Indiana.Settings_WeaponPauseTimeFuzz
// 0x0000 (0x0030 - 0x0030)
class USettings_WeaponPauseTimeFuzz : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_WeaponPauseTimeFuzz");
		return ptr;
	}

};


// Class Indiana.Settings_CompanionCommandHunkerDownDuration
// 0x0000 (0x0030 - 0x0030)
class USettings_CompanionCommandHunkerDownDuration : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_CompanionCommandHunkerDownDuration");
		return ptr;
	}

};


// Class Indiana.Settings_CompanionCommandFlankDuration
// 0x0000 (0x0030 - 0x0030)
class USettings_CompanionCommandFlankDuration : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_CompanionCommandFlankDuration");
		return ptr;
	}

};


// Class Indiana.Settings_CompanionCommandSuppressDuration
// 0x0000 (0x0030 - 0x0030)
class USettings_CompanionCommandSuppressDuration : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_CompanionCommandSuppressDuration");
		return ptr;
	}

};


// Class Indiana.Settings_DelayDodge
// 0x0000 (0x0030 - 0x0030)
class USettings_DelayDodge : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_DelayDodge");
		return ptr;
	}

};


// Class Indiana.Settings_DelayMeleeBlock
// 0x0000 (0x0030 - 0x0030)
class USettings_DelayMeleeBlock : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_DelayMeleeBlock");
		return ptr;
	}

};


// Class Indiana.Settings_CompanionCommandSuppressLostTargetTime
// 0x0000 (0x0030 - 0x0030)
class USettings_CompanionCommandSuppressLostTargetTime : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_CompanionCommandSuppressLostTargetTime");
		return ptr;
	}

};


// Class Indiana.Settings_CompanionCommandFlankLostTargetTime
// 0x0000 (0x0030 - 0x0030)
class USettings_CompanionCommandFlankLostTargetTime : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Settings_CompanionCommandFlankLostTargetTime");
		return ptr;
	}

};


// Class Indiana.Follow_TeleportRotation
// 0x0000 (0x0030 - 0x0030)
class UFollow_TeleportRotation : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Follow_TeleportRotation");
		return ptr;
	}

};


// Class Indiana.Conversation_TeleportRotation
// 0x0000 (0x0030 - 0x0030)
class UConversation_TeleportRotation : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Conversation_TeleportRotation");
		return ptr;
	}

};


// Class Indiana.Wander_WanderRadius
// 0x0000 (0x0030 - 0x0030)
class UWander_WanderRadius : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Wander_WanderRadius");
		return ptr;
	}

};


// Class Indiana.Search_UnreachableWaitTime
// 0x0000 (0x0030 - 0x0030)
class USearch_UnreachableWaitTime : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Search_UnreachableWaitTime");
		return ptr;
	}

};


// Class Indiana.Search_WanderIdleTime
// 0x0000 (0x0030 - 0x0030)
class USearch_WanderIdleTime : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Search_WanderIdleTime");
		return ptr;
	}

};


// Class Indiana.Teleport_TeleportDuration
// 0x0000 (0x0030 - 0x0030)
class UTeleport_TeleportDuration : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Teleport_TeleportDuration");
		return ptr;
	}

};


// Class Indiana.Teleport_TeleportTargetRotation
// 0x0000 (0x0030 - 0x0030)
class UTeleport_TeleportTargetRotation : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Teleport_TeleportTargetRotation");
		return ptr;
	}

};


// Class Indiana.Follow_MinRange
// 0x0000 (0x0030 - 0x0030)
class UFollow_MinRange : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Follow_MinRange");
		return ptr;
	}

};


// Class Indiana.Follow_MaxRange
// 0x0000 (0x0030 - 0x0030)
class UFollow_MaxRange : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Follow_MaxRange");
		return ptr;
	}

};


// Class Indiana.SpellTarget_MaxRange
// 0x0000 (0x0030 - 0x0030)
class USpellTarget_MaxRange : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.SpellTarget_MaxRange");
		return ptr;
	}

};


// Class Indiana.SpellTarget_MinRange
// 0x0000 (0x0030 - 0x0030)
class USpellTarget_MinRange : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.SpellTarget_MinRange");
		return ptr;
	}

};


// Class Indiana.Investigate_PreMoveWaitTime
// 0x0000 (0x0030 - 0x0030)
class UInvestigate_PreMoveWaitTime : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Investigate_PreMoveWaitTime");
		return ptr;
	}

};


// Class Indiana.Investigate_ArrivalRadius
// 0x0000 (0x0030 - 0x0030)
class UInvestigate_ArrivalRadius : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Investigate_ArrivalRadius");
		return ptr;
	}

};


// Class Indiana.Investigate_DeadBodyWanderIdleTime
// 0x0000 (0x0030 - 0x0030)
class UInvestigate_DeadBodyWanderIdleTime : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Investigate_DeadBodyWanderIdleTime");
		return ptr;
	}

};


// Class Indiana.Investigate_EndWaitTime
// 0x0000 (0x0030 - 0x0030)
class UInvestigate_EndWaitTime : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Investigate_EndWaitTime");
		return ptr;
	}

};


// Class Indiana.Investigate_StimulusUpdateMinDuration
// 0x0000 (0x0030 - 0x0030)
class UInvestigate_StimulusUpdateMinDuration : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Investigate_StimulusUpdateMinDuration");
		return ptr;
	}

};


// Class Indiana.Investigate_ExitChatterTriggerTime
// 0x0000 (0x0030 - 0x0030)
class UInvestigate_ExitChatterTriggerTime : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Investigate_ExitChatterTriggerTime");
		return ptr;
	}

};


// Class Indiana.Furniture_EntryAcceptanceRadius
// 0x0000 (0x0030 - 0x0030)
class UFurniture_EntryAcceptanceRadius : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Furniture_EntryAcceptanceRadius");
		return ptr;
	}

};


// Class Indiana.MoveTo_ArrivalWaitTime
// 0x0000 (0x0030 - 0x0030)
class UMoveTo_ArrivalWaitTime : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.MoveTo_ArrivalWaitTime");
		return ptr;
	}

};


// Class Indiana.CalledShot_CameraCutDelay
// 0x0000 (0x0030 - 0x0030)
class UCalledShot_CameraCutDelay : public UAIFValue
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CalledShot_CameraCutDelay");
		return ptr;
	}

};


// Class Indiana.AIInt
// 0x0000 (0x0030 - 0x0030)
class UAIInt : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AIInt");
		return ptr;
	}

};


// Class Indiana.CalledShot_FireIndex
// 0x0000 (0x0030 - 0x0030)
class UCalledShot_FireIndex : public UAIInt
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CalledShot_FireIndex");
		return ptr;
	}

};


// Class Indiana.FiringPatternComplete_FinishBehavior
// 0x0000 (0x0030 - 0x0030)
class UFiringPatternComplete_FinishBehavior : public UAIInt
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.FiringPatternComplete_FinishBehavior");
		return ptr;
	}

};


// Class Indiana.FiringPatternComplete_FinishTask
// 0x0000 (0x0030 - 0x0030)
class UFiringPatternComplete_FinishTask : public UAIInt
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.FiringPatternComplete_FinishTask");
		return ptr;
	}

};


// Class Indiana.FiringPatternComplete_Repeat
// 0x0000 (0x0030 - 0x0030)
class UFiringPatternComplete_Repeat : public UAIInt
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.FiringPatternComplete_Repeat");
		return ptr;
	}

};


// Class Indiana.FiringPatternComplete_Cover
// 0x0000 (0x0030 - 0x0030)
class UFiringPatternComplete_Cover : public UAIInt
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.FiringPatternComplete_Cover");
		return ptr;
	}

};


// Class Indiana.MeleeAction_CurrentRequest
// 0x0000 (0x0030 - 0x0030)
class UMeleeAction_CurrentRequest : public UAIInt
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.MeleeAction_CurrentRequest");
		return ptr;
	}

};


// Class Indiana.MeleeAction_RecoveryDodgeDirection
// 0x0000 (0x0030 - 0x0030)
class UMeleeAction_RecoveryDodgeDirection : public UAIInt
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.MeleeAction_RecoveryDodgeDirection");
		return ptr;
	}

};


// Class Indiana.WeaponSlot_CurrentRequest
// 0x0000 (0x0030 - 0x0030)
class UWeaponSlot_CurrentRequest : public UAIInt
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.WeaponSlot_CurrentRequest");
		return ptr;
	}

};


// Class Indiana.Context_CurrentRequest
// 0x0000 (0x0030 - 0x0030)
class UContext_CurrentRequest : public UAIInt
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Context_CurrentRequest");
		return ptr;
	}

};


// Class Indiana.Dodge_Direction
// 0x0000 (0x0030 - 0x0030)
class UDodge_Direction : public UAIInt
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Dodge_Direction");
		return ptr;
	}

};


// Class Indiana.AILocation
// 0x0000 (0x0030 - 0x0030)
class UAILocation : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AILocation");
		return ptr;
	}

};


// Class Indiana.AILocationWritable
// 0x0000 (0x0030 - 0x0030)
class UAILocationWritable : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AILocationWritable");
		return ptr;
	}

};


// Class Indiana.General_MoveLocation
// 0x0000 (0x0030 - 0x0030)
class UGeneral_MoveLocation : public UAILocationWritable
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_MoveLocation");
		return ptr;
	}

};


// Class Indiana.General_DecisionTreeLocation
// 0x0000 (0x0030 - 0x0030)
class UGeneral_DecisionTreeLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_DecisionTreeLocation");
		return ptr;
	}

};


// Class Indiana.General_DecisionTreeActorLocation
// 0x0000 (0x0030 - 0x0030)
class UGeneral_DecisionTreeActorLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_DecisionTreeActorLocation");
		return ptr;
	}

};


// Class Indiana.General_CurrentLocation
// 0x0000 (0x0030 - 0x0030)
class UGeneral_CurrentLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_CurrentLocation");
		return ptr;
	}

};


// Class Indiana.General_PrimaryTargetStimulusLocation
// 0x0000 (0x0030 - 0x0030)
class UGeneral_PrimaryTargetStimulusLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_PrimaryTargetStimulusLocation");
		return ptr;
	}

};


// Class Indiana.General_PrimaryTargetAimLocation
// 0x0000 (0x0030 - 0x0030)
class UGeneral_PrimaryTargetAimLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_PrimaryTargetAimLocation");
		return ptr;
	}

};


// Class Indiana.General_PrimaryTargetHeadLocation
// 0x0000 (0x0030 - 0x0030)
class UGeneral_PrimaryTargetHeadLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_PrimaryTargetHeadLocation");
		return ptr;
	}

};


// Class Indiana.General_PrimaryTargetCheatAimLocation
// 0x0000 (0x0030 - 0x0030)
class UGeneral_PrimaryTargetCheatAimLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_PrimaryTargetCheatAimLocation");
		return ptr;
	}

};


// Class Indiana.General_PrimaryTargetCheatHeadLocation
// 0x0000 (0x0030 - 0x0030)
class UGeneral_PrimaryTargetCheatHeadLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_PrimaryTargetCheatHeadLocation");
		return ptr;
	}

};


// Class Indiana.General_PrimaryTargetMovingAimLocation
// 0x0000 (0x0030 - 0x0030)
class UGeneral_PrimaryTargetMovingAimLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_PrimaryTargetMovingAimLocation");
		return ptr;
	}

};


// Class Indiana.General_PrimaryTargetMovingHeadLocation
// 0x0000 (0x0030 - 0x0030)
class UGeneral_PrimaryTargetMovingHeadLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_PrimaryTargetMovingHeadLocation");
		return ptr;
	}

};


// Class Indiana.General_PrimaryTargetSphereCheatLocaiton
// 0x0000 (0x0030 - 0x0030)
class UGeneral_PrimaryTargetSphereCheatLocaiton : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_PrimaryTargetSphereCheatLocaiton");
		return ptr;
	}

};


// Class Indiana.General_PrimaryTargetStimulusSourceActorLocaiton
// 0x0000 (0x0030 - 0x0030)
class UGeneral_PrimaryTargetStimulusSourceActorLocaiton : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_PrimaryTargetStimulusSourceActorLocaiton");
		return ptr;
	}

};


// Class Indiana.General_PrimaryTargetProjectedStimulusLocation
// 0x0000 (0x0030 - 0x0030)
class UGeneral_PrimaryTargetProjectedStimulusLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_PrimaryTargetProjectedStimulusLocation");
		return ptr;
	}

};


// Class Indiana.General_RandomNearbyLocation
// 0x0000 (0x0030 - 0x0030)
class UGeneral_RandomNearbyLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_RandomNearbyLocation");
		return ptr;
	}

};


// Class Indiana.General_VantageLocationForPrimaryTarget
// 0x0000 (0x0030 - 0x0030)
class UGeneral_VantageLocationForPrimaryTarget : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_VantageLocationForPrimaryTarget");
		return ptr;
	}

};


// Class Indiana.General_FurthestLocationOnSpline
// 0x0000 (0x0030 - 0x0030)
class UGeneral_FurthestLocationOnSpline : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_FurthestLocationOnSpline");
		return ptr;
	}

};


// Class Indiana.Cover_CoverFiringLocation
// 0x0000 (0x0030 - 0x0030)
class UCover_CoverFiringLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Cover_CoverFiringLocation");
		return ptr;
	}

};


// Class Indiana.Cover_CoverFiringAimLocation
// 0x0000 (0x0030 - 0x0030)
class UCover_CoverFiringAimLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Cover_CoverFiringAimLocation");
		return ptr;
	}

};


// Class Indiana.Cover_CoverIntoCoverFiringAim
// 0x0000 (0x0030 - 0x0030)
class UCover_CoverIntoCoverFiringAim : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Cover_CoverIntoCoverFiringAim");
		return ptr;
	}

};


// Class Indiana.Cover_CoverLocation
// 0x0000 (0x0030 - 0x0030)
class UCover_CoverLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Cover_CoverLocation");
		return ptr;
	}

};


// Class Indiana.Cover_CoverWallLocation
// 0x0000 (0x0030 - 0x0030)
class UCover_CoverWallLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Cover_CoverWallLocation");
		return ptr;
	}

};


// Class Indiana.Melee_BodyAttackingTargetLocation
// 0x0000 (0x0030 - 0x0030)
class UMelee_BodyAttackingTargetLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Melee_BodyAttackingTargetLocation");
		return ptr;
	}

};


// Class Indiana.Patrol_PatrolNodeOrientationLocation
// 0x0000 (0x0030 - 0x0030)
class UPatrol_PatrolNodeOrientationLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Patrol_PatrolNodeOrientationLocation");
		return ptr;
	}

};


// Class Indiana.Follow_TeleportLocation
// 0x0000 (0x0030 - 0x0030)
class UFollow_TeleportLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Follow_TeleportLocation");
		return ptr;
	}

};


// Class Indiana.Conversation_TeleportLocation
// 0x0000 (0x0030 - 0x0030)
class UConversation_TeleportLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Conversation_TeleportLocation");
		return ptr;
	}

};


// Class Indiana.Follow_FollowTarget
// 0x0000 (0x0030 - 0x0030)
class UFollow_FollowTarget : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Follow_FollowTarget");
		return ptr;
	}

};


// Class Indiana.Wander_Origin
// 0x0000 (0x0030 - 0x0030)
class UWander_Origin : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Wander_Origin");
		return ptr;
	}

};


// Class Indiana.Idle_Origin
// 0x0000 (0x0030 - 0x0030)
class UIdle_Origin : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Idle_Origin");
		return ptr;
	}

};


// Class Indiana.Idle_OrientationLocation
// 0x0000 (0x0030 - 0x0030)
class UIdle_OrientationLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Idle_OrientationLocation");
		return ptr;
	}

};


// Class Indiana.Furniture_EntryLocation
// 0x0000 (0x0030 - 0x0030)
class UFurniture_EntryLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Furniture_EntryLocation");
		return ptr;
	}

};


// Class Indiana.Furniture_ProjectedEntryLocation
// 0x0000 (0x0030 - 0x0030)
class UFurniture_ProjectedEntryLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Furniture_ProjectedEntryLocation");
		return ptr;
	}

};


// Class Indiana.Furniture_ExitLocation
// 0x0000 (0x0030 - 0x0030)
class UFurniture_ExitLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Furniture_ExitLocation");
		return ptr;
	}

};


// Class Indiana.Furniture_RotationLocation
// 0x0000 (0x0030 - 0x0030)
class UFurniture_RotationLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Furniture_RotationLocation");
		return ptr;
	}

};


// Class Indiana.Jump_StartLocation
// 0x0000 (0x0030 - 0x0030)
class UJump_StartLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Jump_StartLocation");
		return ptr;
	}

};


// Class Indiana.Jump_EndLocation
// 0x0000 (0x0030 - 0x0030)
class UJump_EndLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Jump_EndLocation");
		return ptr;
	}

};


// Class Indiana.Crouch_StartLocation
// 0x0000 (0x0030 - 0x0030)
class UCrouch_StartLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Crouch_StartLocation");
		return ptr;
	}

};


// Class Indiana.Crouch_EndLocation
// 0x0000 (0x0030 - 0x0030)
class UCrouch_EndLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Crouch_EndLocation");
		return ptr;
	}

};


// Class Indiana.Walk_StartLocation
// 0x0000 (0x0030 - 0x0030)
class UWalk_StartLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Walk_StartLocation");
		return ptr;
	}

};


// Class Indiana.Walk_EndLocation
// 0x0000 (0x0030 - 0x0030)
class UWalk_EndLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Walk_EndLocation");
		return ptr;
	}

};


// Class Indiana.CompanionCommand_MoveTo
// 0x0000 (0x0030 - 0x0030)
class UCompanionCommand_MoveTo : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionCommand_MoveTo");
		return ptr;
	}

};


// Class Indiana.General_HealTargetLocation
// 0x0000 (0x0030 - 0x0030)
class UGeneral_HealTargetLocation : public UAILocation
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.General_HealTargetLocation");
		return ptr;
	}

};


// Class Indiana.AI_UObject
// 0x0000 (0x0030 - 0x0030)
class UAI_UObject : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AI_UObject");
		return ptr;
	}

};


// Class Indiana.AI_DisableStatusEffect
// 0x0000 (0x0030 - 0x0030)
class UAI_DisableStatusEffect : public UAI_UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AI_DisableStatusEffect");
		return ptr;
	}

};


// Class Indiana.AI_FleeStatusEffect
// 0x0000 (0x0030 - 0x0030)
class UAI_FleeStatusEffect : public UAI_UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AI_FleeStatusEffect");
		return ptr;
	}

};


// Class Indiana.AI_PersuadeStatusEffect
// 0x0000 (0x0030 - 0x0030)
class UAI_PersuadeStatusEffect : public UAI_UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AI_PersuadeStatusEffect");
		return ptr;
	}

};


// Class Indiana.AI_TeleportStartAnimation
// 0x0000 (0x0030 - 0x0030)
class UAI_TeleportStartAnimation : public UAI_UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AI_TeleportStartAnimation");
		return ptr;
	}

};


// Class Indiana.AI_TeleportEmergingAnimation
// 0x0000 (0x0030 - 0x0030)
class UAI_TeleportEmergingAnimation : public UAI_UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AI_TeleportEmergingAnimation");
		return ptr;
	}

};


// Class Indiana.AI_TeleportExitAnimation
// 0x0000 (0x0030 - 0x0030)
class UAI_TeleportExitAnimation : public UAI_UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AI_TeleportExitAnimation");
		return ptr;
	}

};


// Class Indiana.AI_TeleportEQS
// 0x0000 (0x0030 - 0x0030)
class UAI_TeleportEQS : public UAI_UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AI_TeleportEQS");
		return ptr;
	}

};


// Class Indiana.AI_SpawnActorAnimation
// 0x0000 (0x0030 - 0x0030)
class UAI_SpawnActorAnimation : public UAI_UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AI_SpawnActorAnimation");
		return ptr;
	}

};


// Class Indiana.AI_CowerAnimation
// 0x0000 (0x0030 - 0x0030)
class UAI_CowerAnimation : public UAI_UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AI_CowerAnimation");
		return ptr;
	}

};


// Class Indiana.AI_AnimationStateAnimation
// 0x0000 (0x0030 - 0x0030)
class UAI_AnimationStateAnimation : public UAI_UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AI_AnimationStateAnimation");
		return ptr;
	}

};


// Class Indiana.AISettings_Behavior
// 0x0000 (0x0030 - 0x0030)
class UAISettings_Behavior : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AISettings_Behavior");
		return ptr;
	}

};


// Class Indiana.AISettings_DefensiveAction
// 0x0078 (0x00B0 - 0x0038)
class UAISettings_DefensiveAction : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x78];                                      // 0x0038(0x0078) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AISettings_DefensiveAction");
		return ptr;
	}

};


// Class Indiana.AISettings_Follow
// 0x0058 (0x0088 - 0x0030)
class UAISettings_Follow : public UAISettings_Behavior
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0030(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AISettings_Follow");
		return ptr;
	}

};


// Class Indiana.AISettings_FollowPlayer
// 0x0000 (0x0030 - 0x0030)
class UAISettings_FollowPlayer : public UAISettings_Behavior
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AISettings_FollowPlayer");
		return ptr;
	}

};


// Class Indiana.AISettings_Furniture
// 0x0028 (0x0058 - 0x0030)
class UAISettings_Furniture : public UAISettings_Behavior
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0030(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AISettings_Furniture");
		return ptr;
	}

};


// Class Indiana.AISettings_Idle
// 0x0000 (0x0030 - 0x0030)
class UAISettings_Idle : public UAISettings_Behavior
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AISettings_Idle");
		return ptr;
	}

};


// Class Indiana.AISettings_Patrol
// 0x0010 (0x0040 - 0x0030)
class UAISettings_Patrol : public UAISettings_Behavior
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0030(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AISettings_Patrol");
		return ptr;
	}

};


// Class Indiana.AISettings_Traverse
// 0x0020 (0x0050 - 0x0030)
class UAISettings_Traverse : public UAISettings_Behavior
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0030(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AISettings_Traverse");
		return ptr;
	}

};


// Class Indiana.AISettings_Wander
// 0x0018 (0x0048 - 0x0030)
class UAISettings_Wander : public UAISettings_Behavior
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0030(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AISettings_Wander");
		return ptr;
	}

};


// Class Indiana.AISettings_Weapon
// 0x0228 (0x0260 - 0x0038)
class UAISettings_Weapon : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x228];                                     // 0x0038(0x0228) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AISettings_Weapon");
		return ptr;
	}

};


// Class Indiana.AISettingsComponent
// 0x02C8 (0x03E0 - 0x0118)
class UAISettingsComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x2C8];                                     // 0x0118(0x02C8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AISettingsComponent");
		return ptr;
	}


	void STATIC_OnUnequipWeapon(class UWeapon* Weapon);
	void STATIC_OnEquipWeapon(class UWeapon* Weapon);
};


// Class Indiana.TargetingComponent
// 0x0008 (0x0120 - 0x0118)
class UTargetingComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0118(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.TargetingComponent");
		return ptr;
	}

};


// Class Indiana.AiTargetingComponent
// 0x0010 (0x0130 - 0x0120)
class UAiTargetingComponent : public UTargetingComponent
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0120(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AiTargetingComponent");
		return ptr;
	}

};


// Class Indiana.Alarm
// 0x0010 (0x0398 - 0x0388)
class AAlarm : public AActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0388(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Alarm");
		return ptr;
	}

};


// Class Indiana.AlarmComponent
// 0x0018 (0x0130 - 0x0118)
class UAlarmComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0118(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AlarmComponent");
		return ptr;
	}


	EAlarmState GetAlarmState();
};


// Class Indiana.Item
// 0x00E8 (0x0118 - 0x0030)
class UItem : public UObject
{
public:
	unsigned char                                      UnknownData00[0xE8];                                      // 0x0030(0x00E8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Item");
		return ptr;
	}


	void STATIC_SetPlayerOwnership(bool bRemoveNonPlayerOwnership);
	void STATIC_SetOwnership(class UClass* Faction, bool bInPlayerOwned);
	void STATIC_SetNonPlayerOwnership(class UClass* Faction, bool bRemovePlayerOwnership);
	bool IsPlayerOwned();
	class UClass* GetOwningFaction();
	void GetOwningActor();
	void STATIC_ClearPlayerOwnership();
	void STATIC_ClearNonPlayerOwnership();
	void STATIC_ClearAllOwnership();
	bool CanPlayerSafelyTake();
};


// Class Indiana.Ammo
// 0x0088 (0x01A0 - 0x0118)
class UAmmo : public UItem
{
public:
	unsigned char                                      UnknownData00[0x88];                                      // 0x0118(0x0088) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Ammo");
		return ptr;
	}

};


// Class Indiana.AmmoPoolBase
// 0x0050 (0x0080 - 0x0030)
class UAmmoPoolBase : public UObject
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0030(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AmmoPoolBase");
		return ptr;
	}


	bool UsesConsumables();
	bool UsesAmmo();
	void STATIC_OnTacticalTimeDilationEnd(float Duration);
	bool IsReloading();
	int GetCurrentPoolSize();
	class UClass* GetCurrentConsumableClass();
	class UClass* GetCurrentAmmoClass();
	float GetBaseReloadTime();
};


// Class Indiana.RadialSectionWidget
// 0x0010 (0x0230 - 0x0220)
class URadialSectionWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0220(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.RadialSectionWidget");
		return ptr;
	}

};


// Class Indiana.AmmoRadialSectionWidget
// 0x0020 (0x0250 - 0x0230)
class UAmmoRadialSectionWidget : public URadialSectionWidget
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0230(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AmmoRadialSectionWidget");
		return ptr;
	}

};


// Class Indiana.AmmoReadoutWidget
// 0x00B0 (0x0358 - 0x02A8)
class UAmmoReadoutWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0xB0];                                      // 0x02A8(0x00B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AmmoReadoutWidget");
		return ptr;
	}


	void STATIC_OnWeaponSwitch(class UWeapon* EquippedWeapon);
	void STATIC_OnReloadComplete(class UWeapon* EquippedWeapon);
	void STATIC_OnPlayerCombatStateChange(bool bCombatIn, bool bRestoring);
	void STATIC_OnHUDVisibilityChanged(bool bVisible);
	void STATIC_OnHeldWeaponTextDisplayModeChanged(int ModeIn);
	void STATIC_OnHeldWeaponDisplayModeChanged(int ModeIn);
	void STATIC_EvaluateLowAmmoWarning(int MaxClipSize, int CurrentClipSize, int RemainingAmmo);
};


// Class Indiana.AnimationAudioSet
// 0x0050 (0x0088 - 0x0038)
class UAnimationAudioSet : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0038(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimationAudioSet");
		return ptr;
	}

};


// Class Indiana.AnimationBehaviorStateInfo
// 0x0000 (0x0120 - 0x0120)
class UAnimationBehaviorStateInfo : public UEmpty_BehaviorStateInfo
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimationBehaviorStateInfo");
		return ptr;
	}

};


// Class Indiana.AnimationRequestData
// 0x0010 (0x0078 - 0x0068)
class UAnimationRequestData : public UDecisionTreeEmptyRequestData
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0068(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimationRequestData");
		return ptr;
	}

};


// Class Indiana.AnimationCurveUtils
// 0x0000 (0x0030 - 0x0030)
class UAnimationCurveUtils : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimationCurveUtils");
		return ptr;
	}

};


// Class Indiana.DisableStatusEffect
// 0x0010 (0x0198 - 0x0188)
class UDisableStatusEffect : public UStatusEffect
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0188(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.DisableStatusEffect");
		return ptr;
	}

};


// Class Indiana.AnimDisableStatusEffect
// 0x0008 (0x01A0 - 0x0198)
class UAnimDisableStatusEffect : public UDisableStatusEffect
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0198(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimDisableStatusEffect");
		return ptr;
	}

};


// Class Indiana.BoneModifications
// 0x0068 (0x00A0 - 0x0038)
class UBoneModifications : public UPrimaryDataAsset
{
public:
	unsigned char                                      UnknownData00[0x68];                                      // 0x0038(0x0068) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BoneModifications");
		return ptr;
	}

};


// Class Indiana.BoneModificationsPreset
// 0x0050 (0x0088 - 0x0038)
class UBoneModificationsPreset : public UPrimaryDataAsset
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0038(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BoneModificationsPreset");
		return ptr;
	}

};


// Class Indiana.AnimNotify_AttachWeapon
// 0x0000 (0x0040 - 0x0040)
class UAnimNotify_AttachWeapon : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_AttachWeapon");
		return ptr;
	}

};


// Class Indiana.AnimNotify_AudioEvent
// 0x0010 (0x0050 - 0x0040)
class UAnimNotify_AudioEvent : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0040(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_AudioEvent");
		return ptr;
	}

};


// Class Indiana.AnimNotify_Despawn
// 0x0000 (0x0040 - 0x0040)
class UAnimNotify_Despawn : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_Despawn");
		return ptr;
	}

};


// Class Indiana.AnimNotify_DetachWeapon
// 0x0000 (0x0040 - 0x0040)
class UAnimNotify_DetachWeapon : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_DetachWeapon");
		return ptr;
	}

};


// Class Indiana.AnimNotify_EventEffects
// 0x0008 (0x0048 - 0x0040)
class UAnimNotify_EventEffects : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0040(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_EventEffects");
		return ptr;
	}

};


// Class Indiana.AnimNotify_Finished
// 0x0000 (0x0040 - 0x0040)
class UAnimNotify_Finished : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_Finished");
		return ptr;
	}

};


// Class Indiana.AnimNotify_FootStep
// 0x0008 (0x0048 - 0x0040)
class UAnimNotify_FootStep : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0040(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_FootStep");
		return ptr;
	}

};


// Class Indiana.AnimNotify_IndianaAkEvent
// 0x0010 (0x0050 - 0x0040)
class UAnimNotify_IndianaAkEvent : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0040(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_IndianaAkEvent");
		return ptr;
	}

};


// Class Indiana.AnimNotify_MedkitEnd
// 0x0000 (0x0040 - 0x0040)
class UAnimNotify_MedkitEnd : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_MedkitEnd");
		return ptr;
	}

};


// Class Indiana.AnimNotify_MeleeActionFinished
// 0x0000 (0x0040 - 0x0040)
class UAnimNotify_MeleeActionFinished : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_MeleeActionFinished");
		return ptr;
	}

};


// Class Indiana.AnimNotify_MeleeAllowInput
// 0x0008 (0x0048 - 0x0040)
class UAnimNotify_MeleeAllowInput : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0040(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_MeleeAllowInput");
		return ptr;
	}

};


// Class Indiana.AnimNotify_MeleeCanSwing
// 0x0000 (0x0040 - 0x0040)
class UAnimNotify_MeleeCanSwing : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_MeleeCanSwing");
		return ptr;
	}

};


// Class Indiana.AnimNotify_MeleeCheckInput
// 0x0000 (0x0040 - 0x0040)
class UAnimNotify_MeleeCheckInput : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_MeleeCheckInput");
		return ptr;
	}

};


// Class Indiana.AnimNotify_MeleeRecoil
// 0x0000 (0x0040 - 0x0040)
class UAnimNotify_MeleeRecoil : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_MeleeRecoil");
		return ptr;
	}

};


// Class Indiana.AnimNotify_ParamsEvent
// 0x0008 (0x0048 - 0x0040)
class UAnimNotify_ParamsEvent : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0040(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_ParamsEvent");
		return ptr;
	}

};


// Class Indiana.AnimNotify_PlayChatter
// 0x0008 (0x0048 - 0x0040)
class UAnimNotify_PlayChatter : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0040(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_PlayChatter");
		return ptr;
	}

};


// Class Indiana.AnimNotify_PropDespawn
// 0x0010 (0x0050 - 0x0040)
class UAnimNotify_PropDespawn : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0040(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_PropDespawn");
		return ptr;
	}

};


// Class Indiana.PropData
// 0x0010 (0x0048 - 0x0038)
class UPropData : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0038(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.PropData");
		return ptr;
	}

};


// Class Indiana.NewPropData
// 0x0068 (0x00A0 - 0x0038)
class UNewPropData : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x68];                                      // 0x0038(0x0068) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.NewPropData");
		return ptr;
	}

};


// Class Indiana.AnimNotify_PropSpawn
// 0x0010 (0x0050 - 0x0040)
class UAnimNotify_PropSpawn : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0040(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_PropSpawn");
		return ptr;
	}

};


// Class Indiana.AnimNotify_RagDoll
// 0x0020 (0x0060 - 0x0040)
class UAnimNotify_RagDoll : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0040(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_RagDoll");
		return ptr;
	}

};


// Class Indiana.AnimNotify_UpdateCanisterVisual
// 0x0000 (0x0040 - 0x0040)
class UAnimNotify_UpdateCanisterVisual : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_UpdateCanisterVisual");
		return ptr;
	}

};


// Class Indiana.AnimNotify_UseMedKit
// 0x0000 (0x0040 - 0x0040)
class UAnimNotify_UseMedKit : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_UseMedKit");
		return ptr;
	}

};


// Class Indiana.AnimNotify_WeaponFire
// 0x0000 (0x0040 - 0x0040)
class UAnimNotify_WeaponFire : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_WeaponFire");
		return ptr;
	}

};


// Class Indiana.AnimNotify_WeaponVisualEvent
// 0x0010 (0x0050 - 0x0040)
class UAnimNotify_WeaponVisualEvent : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0040(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotify_WeaponVisualEvent");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_AltIKToggle
// 0x0008 (0x0040 - 0x0038)
class UAnimNotifyState_AltIKToggle : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_AltIKToggle");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_AudioEventLoop
// 0x0008 (0x0040 - 0x0038)
class UAnimNotifyState_AudioEventLoop : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_AudioEventLoop");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_DisableAutoStep
// 0x0000 (0x0038 - 0x0038)
class UAnimNotifyState_DisableAutoStep : public UAnimNotifyState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_DisableAutoStep");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_DisableDetection
// 0x0000 (0x0038 - 0x0038)
class UAnimNotifyState_DisableDetection : public UAnimNotifyState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_DisableDetection");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_DisableHipPoses
// 0x0000 (0x0038 - 0x0038)
class UAnimNotifyState_DisableHipPoses : public UAnimNotifyState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_DisableHipPoses");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_DisableVision
// 0x0000 (0x0038 - 0x0038)
class UAnimNotifyState_DisableVision : public UAnimNotifyState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_DisableVision");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_HideWeapon
// 0x0000 (0x0038 - 0x0038)
class UAnimNotifyState_HideWeapon : public UAnimNotifyState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_HideWeapon");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_InspectEnd
// 0x0000 (0x0038 - 0x0038)
class UAnimNotifyState_InspectEnd : public UAnimNotifyState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_InspectEnd");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_Invulnerable
// 0x0008 (0x0040 - 0x0038)
class UAnimNotifyState_Invulnerable : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_Invulnerable");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_PreventInterrupts
// 0x0000 (0x0038 - 0x0038)
class UAnimNotifyState_PreventInterrupts : public UAnimNotifyState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_PreventInterrupts");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_FurnitureInterrupt
// 0x0008 (0x0040 - 0x0038)
class UAnimNotifyState_FurnitureInterrupt : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_FurnitureInterrupt");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_MeleeAllowInput
// 0x0008 (0x0040 - 0x0038)
class UAnimNotifyState_MeleeAllowInput : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_MeleeAllowInput");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_MeleeCanSwing
// 0x0000 (0x0038 - 0x0038)
class UAnimNotifyState_MeleeCanSwing : public UAnimNotifyState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_MeleeCanSwing");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_MeleeCheckInput
// 0x0000 (0x0038 - 0x0038)
class UAnimNotifyState_MeleeCheckInput : public UAnimNotifyState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_MeleeCheckInput");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_MeleeDamage
// 0x0010 (0x0048 - 0x0038)
class UAnimNotifyState_MeleeDamage : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0038(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_MeleeDamage");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_Prop
// 0x0018 (0x0050 - 0x0038)
class UAnimNotifyState_Prop : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0038(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_Prop");
		return ptr;
	}


	void STATIC_OnMontageEnded(class UAnimMontage* Montage, bool bInterrupted, class USkeletalMeshComponent* MeshComp);
};


// Class Indiana.AnimNotifyState_SuppressFire
// 0x0000 (0x0038 - 0x0038)
class UAnimNotifyState_SuppressFire : public UAnimNotifyState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_SuppressFire");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_ToggleArmPose
// 0x0000 (0x0038 - 0x0038)
class UAnimNotifyState_ToggleArmPose : public UAnimNotifyState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_ToggleArmPose");
		return ptr;
	}

};


// Class Indiana.AnimNotifyState_ToggleTracking
// 0x0008 (0x0040 - 0x0038)
class UAnimNotifyState_ToggleTracking : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AnimNotifyState_ToggleTracking");
		return ptr;
	}

};


// Class Indiana.AoEStatusEffect
// 0x0058 (0x01E0 - 0x0188)
class UAoEStatusEffect : public UStatusEffect
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0188(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AoEStatusEffect");
		return ptr;
	}

};


// Class Indiana.AppearanceComponent
// 0x0380 (0x0498 - 0x0118)
class UAppearanceComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x380];                                     // 0x0118(0x0380) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AppearanceComponent");
		return ptr;
	}


	void STATIC_SetVectorParameter(const struct FName& Parameter, const struct FVector& Vector);
	void STATIC_SetSlotVectorParameter(const struct FName& SlotName, const struct FName& Parameter, const struct FVector& Vector);
	void STATIC_SetSlotTextureParameter(const struct FName& SlotName, const struct FName& Parameter, class UTexture* Texture);
	void STATIC_SetSlotScalarParameter(const struct FName& SlotName, const struct FName& Parameter, float Scalar);
	void STATIC_SetSkinTone(class USkinTone* NewSkinTone);
	void STATIC_SetScar(class UScar* NewScar);
	void STATIC_SetScalarParameter(const struct FName& Parameter, float Scalar);
	void STATIC_SetMakeup(class UMakeup* NewMakeup);
	void STATIC_SetHairColor(class UHairColor* NewColor);
	void STATIC_SetHair(class UHairAppearances* NewHair);
	void STATIC_SetGender(const struct FGameplayTag& Gender);
	void STATIC_SetEyeColor(class UEyeColor* NewColor);
	void STATIC_SetDirt(class UDirt* NewDirt);
	void STATIC_SetDefaultHead(class UHeadAppearances* Head);
	void STATIC_SetDefaultBody(class UBodyAppearances* Body);
	void STATIC_SetBrows(class UBrows* NewBrows);
	void STATIC_SetBoneModificationPresets(class UBoneModificationsPreset* Presets);
	void STATIC_SetBoneModification(class UBoneModifications* Modifications, float Value);
	void STATIC_SetBeardColor(class UBeardColor* NewColor);
	void STATIC_SetBeard(class UBeardAppearances* NewBeard);
	void STATIC_SetAge(float NewAge);
	void STATIC_RemoveBoneModification(class UBoneModifications* Modifications);
	void STATIC_RefreshFullAppearance();
	void STATIC_InvalidateOldBoneModifications();
	bool GetBreakBoneName(const struct FGameplayTag& BodyPartTag, struct FName* BoneName);
	bool GetBreakBoneAndSocketNames(const struct FGameplayTag& BodyPartTag, struct FName* BoneName, struct FName* AttachedSocket, struct FName* DetachedSocket);
	void GetBreakableBoneNames();
	void GetBodyPartTags();
	TArray<struct FBodyPart> GetBodyPartsArray();
	struct FGameplayTag GetBodyPart(const struct FName& BoneName, const struct FVector& ImpactLocation);
	void STATIC_DebugTargetVertexColors();
	void STATIC_ApplyAppearancePreset(class UAppearancePreset* Preset);
};


// Class Indiana.AppearancePreset
// 0x00D0 (0x0108 - 0x0038)
class UAppearancePreset : public UPrimaryDataAsset
{
public:
	unsigned char                                      UnknownData00[0xD0];                                      // 0x0038(0x00D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AppearancePreset");
		return ptr;
	}

};


// Class Indiana.ApplyRosterSkillBonusesStatusEffect
// 0x0038 (0x01C0 - 0x0188)
class UApplyRosterSkillBonusesStatusEffect : public UStatusEffect
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0188(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ApplyRosterSkillBonusesStatusEffect");
		return ptr;
	}

};


// Class Indiana.ApproachBehaviorStateInfo
// 0x0040 (0x0160 - 0x0120)
class UApproachBehaviorStateInfo : public UEmpty_BehaviorStateInfo
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0120(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ApproachBehaviorStateInfo");
		return ptr;
	}

};


// Class Indiana.ApproachRequestData
// 0x0000 (0x0068 - 0x0068)
class UApproachRequestData : public UDecisionTreeEmptyRequestData
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ApproachRequestData");
		return ptr;
	}

};


// Class Indiana.Aptitude
// 0x00A0 (0x00D0 - 0x0030)
class UAptitude : public UObject
{
public:
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0030(0x00A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Aptitude");
		return ptr;
	}

};


// Class Indiana.AptitudeReadoutWidget
// 0x0020 (0x02C8 - 0x02A8)
class UAptitudeReadoutWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x02A8(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AptitudeReadoutWidget");
		return ptr;
	}

};


// Class Indiana.AptitudeSummaryWidget
// 0x0018 (0x0238 - 0x0220)
class UAptitudeSummaryWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0220(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AptitudeSummaryWidget");
		return ptr;
	}

};


// Class Indiana.DegradableItem
// 0x0010 (0x0128 - 0x0118)
class UDegradableItem : public UItem
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0118(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.DegradableItem");
		return ptr;
	}

};


// Class Indiana.ArmorBase
// 0x0090 (0x01B8 - 0x0128)
class UArmorBase : public UDegradableItem
{
public:
	unsigned char                                      UnknownData00[0x90];                                      // 0x0128(0x0090) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ArmorBase");
		return ptr;
	}

};


// Class Indiana.ArmorComponent
// 0x0070 (0x0188 - 0x0118)
class UArmorComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x70];                                      // 0x0118(0x0070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ArmorComponent");
		return ptr;
	}


	void STATIC_TinkerAdvanceArmor(bool bIgnoreCost);
};


// Class Indiana.ArmorItem
// 0x0040 (0x01F8 - 0x01B8)
class UArmorItem : public UArmorBase
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x01B8(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ArmorItem");
		return ptr;
	}

};


// Class Indiana.ArmorModItem
// 0x00A8 (0x0260 - 0x01B8)
class UArmorModItem : public UArmorBase
{
public:
	unsigned char                                      UnknownData00[0xA8];                                      // 0x01B8(0x00A8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ArmorModItem");
		return ptr;
	}

};


// Class Indiana.ArmorModArmoring
// 0x0000 (0x0260 - 0x0260)
class UArmorModArmoring : public UArmorModItem
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ArmorModArmoring");
		return ptr;
	}

};


// Class Indiana.ArmorModUtility
// 0x0000 (0x0260 - 0x0260)
class UArmorModUtility : public UArmorModItem
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ArmorModUtility");
		return ptr;
	}

};


// Class Indiana.ArmorModResistance
// 0x0000 (0x0260 - 0x0260)
class UArmorModResistance : public UArmorModItem
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ArmorModResistance");
		return ptr;
	}

};


// Class Indiana.ArmorModDampening
// 0x0000 (0x0260 - 0x0260)
class UArmorModDampening : public UArmorModItem
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ArmorModDampening");
		return ptr;
	}

};


// Class Indiana.ArmorSet
// 0x0178 (0x0370 - 0x01F8)
class UArmorSet : public UArmorItem
{
public:
	unsigned char                                      UnknownData00[0x178];                                     // 0x01F8(0x0178) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ArmorSet");
		return ptr;
	}

};


// Class Indiana.ArmorStatusEffect
// 0x0020 (0x01A8 - 0x0188)
class UArmorStatusEffect : public UStatusEffect
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0188(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ArmorStatusEffect");
		return ptr;
	}

};


// Class Indiana.AssetCollection
// 0x00A8 (0x00D8 - 0x0030)
class UAssetCollection : public UObject
{
public:
	unsigned char                                      UnknownData00[0xA8];                                      // 0x0030(0x00A8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AssetCollection");
		return ptr;
	}

};


// Class Indiana.AssetList
// 0x0050 (0x0088 - 0x0038)
class UAssetList : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0038(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AssetList");
		return ptr;
	}

};


// Class Indiana.ModVisual
// 0x0038 (0x0068 - 0x0030)
class UModVisual : public UObject
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0030(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ModVisual");
		return ptr;
	}

};


// Class Indiana.AttachFxModVisual
// 0x0038 (0x00A0 - 0x0068)
class UAttachFxModVisual : public UModVisual
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0068(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AttachFxModVisual");
		return ptr;
	}

};


// Class Indiana.AttackInfo
// 0x0020 (0x0050 - 0x0030)
class UAttackInfo : public UObject
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0030(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AttackInfo");
		return ptr;
	}

};


// Class Indiana.MeleeAttackInfo
// 0x0008 (0x0058 - 0x0050)
class UMeleeAttackInfo : public UAttackInfo
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0050(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.MeleeAttackInfo");
		return ptr;
	}

};


// Class Indiana.AttributeSliderGroupWidget
// 0x00D0 (0x0378 - 0x02A8)
class UAttributeSliderGroupWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0xD0];                                      // 0x02A8(0x00D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AttributeSliderGroupWidget");
		return ptr;
	}

};


// Class Indiana.AttributeSliderPageWidget
// 0x0088 (0x0330 - 0x02A8)
class UAttributeSliderPageWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x88];                                      // 0x02A8(0x0088) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AttributeSliderPageWidget");
		return ptr;
	}

};


// Class Indiana.AttributeSummaryEntryWidget
// 0x0038 (0x0258 - 0x0220)
class UAttributeSummaryEntryWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0220(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AttributeSummaryEntryWidget");
		return ptr;
	}

};


// Class Indiana.AttributeSummaryGroupWidget
// 0x0018 (0x0238 - 0x0220)
class UAttributeSummaryGroupWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0220(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AttributeSummaryGroupWidget");
		return ptr;
	}

};


// Class Indiana.AttributeSummaryWidget
// 0x0068 (0x0288 - 0x0220)
class UAttributeSummaryWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x68];                                      // 0x0220(0x0068) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AttributeSummaryWidget");
		return ptr;
	}

};


// Class Indiana.AudioHelpers
// 0x0000 (0x0030 - 0x0030)
class UAudioHelpers : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AudioHelpers");
		return ptr;
	}


	class UAkAudioEvent* LoadAkAudioEventReference(const class FString& Path);
};


// Class Indiana.InteractableActor
// 0x0050 (0x03D8 - 0x0388)
class AInteractableActor : public AActor
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0388(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.InteractableActor");
		return ptr;
	}

};


// Class Indiana.AudioLogActor
// 0x0050 (0x0428 - 0x03D8)
class AAudioLogActor : public AInteractableActor
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x03D8(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AudioLogActor");
		return ptr;
	}

};


// Class Indiana.AudioLogDataAsset
// 0x0020 (0x0058 - 0x0038)
class UAudioLogDataAsset : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0038(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AudioLogDataAsset");
		return ptr;
	}

};


// Class Indiana.AudioLogLibraryDataAsset
// 0x0040 (0x0078 - 0x0038)
class UAudioLogLibraryDataAsset : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0038(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AudioLogLibraryDataAsset");
		return ptr;
	}

};


// Class Indiana.GenericCollapsableList
// 0x0058 (0x0300 - 0x02A8)
class UGenericCollapsableList : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x02A8(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.GenericCollapsableList");
		return ptr;
	}


	void STATIC_ExpandableAreaExpansionChanged(class UExpandableAreaBase* Area, bool bIsExpanded);
};


// Class Indiana.AudioLogList
// 0x00A0 (0x03A0 - 0x0300)
class UAudioLogList : public UGenericCollapsableList
{
public:
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0300(0x00A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AudioLogList");
		return ptr;
	}


	void STATIC_OnAudioLogViewedCB(class UGenericCollapsableListEntry* ListEntry);
	void STATIC_OnAudioLogSelectedCB(class UGenericCollapsableListEntry* ListEntry);
	void STATIC_OnAudioLogLibraryLoaded(class UAudioLogLibraryDataAsset* LoadedAudioLogLibrary);
	void STATIC_AddOldAudioLog(class UAudioLogDataAsset* AudioLogDataAsset);
	void STATIC_AddNewAudioLog(class UAudioLogDataAsset* AudioLogDataAsset);
};


// Class Indiana.GenericCollapsableListEntry
// 0x0028 (0x0248 - 0x0220)
class UGenericCollapsableListEntry : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0220(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.GenericCollapsableListEntry");
		return ptr;
	}

};


// Class Indiana.AudioLogListEntryWidget
// 0x0000 (0x0248 - 0x0248)
class UAudioLogListEntryWidget : public UGenericCollapsableListEntry
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AudioLogListEntryWidget");
		return ptr;
	}

};


// Class Indiana.AudioLogManager
// 0x0148 (0x0178 - 0x0030)
class UAudioLogManager : public UObject
{
public:
	unsigned char                                      UnknownData00[0x148];                                     // 0x0030(0x0148) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AudioLogManager");
		return ptr;
	}


	void STATIC_StopCurrentAudioLog(bool bForce);
	void STATIC_ResumeCurrentAudioLog(bool bForce, bool bFromPlay);
	void STATIC_PlayAudioLog(int AudioLogIndex);
	void STATIC_PauseCurrentAudioLog(bool bForce, bool bFromStop);
	void STATIC_OnPreMapLoad(const class FString& MapName);
	void STATIC_OnPostMapLoad(class UWorld* World);
	void STATIC_OnLoadComplete(const class FString& Filename, ELoadGameResult Result);
	void STATIC_OnConversationEnded(class UConversationInstance* ConversationInstance);
	void STATIC_OnCombatStateChanged(bool bInCombat, bool bRestoring);
	void STATIC_OnAudioLogLibraryLoaded();
	bool IsPlayingAudioLog();
	EAudioLogPlayState GetCurrentAudioLogPlayState();
	bool CanStopCurrentAudioLog(bool bExclusive);
	bool CanResumeCurrentAudioLog(bool bExclusive);
	bool CanPauseCurrentAudioLog(bool bExclusive);
};


// Class Indiana.IndianaInterfaceUserWidget
// 0x0008 (0x02B0 - 0x02A8)
class UIndianaInterfaceUserWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x02A8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.IndianaInterfaceUserWidget");
		return ptr;
	}


	void STATIC_SetInterfaceUserFocus();
	void STATIC_SetCursorVisible(bool bVisible);
};


// Class Indiana.AudioLogWidget
// 0x0090 (0x0340 - 0x02B0)
class UAudioLogWidget : public UIndianaInterfaceUserWidget
{
public:
	unsigned char                                      UnknownData00[0x90];                                      // 0x02B0(0x0090) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AudioLogWidget");
		return ptr;
	}


	void STATIC_TacticalTimeDilationStart();
	void STATIC_TacticalTimeDilationEnd(float Delta);
	void STATIC_ShowAudioLog(bool bShow, float CurrentRenderOpacity);
	void STATIC_OnHUDVisibilityChanged(bool bVisible);
	void STATIC_OnAudioLogPlayStateChanged(EAudioLogPlayState NewPlayState);
	bool CanStopAudioLog();
};


// Class Indiana.AudioParamModVisual
// 0x0020 (0x0088 - 0x0068)
class UAudioParamModVisual : public UModVisual
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0068(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AudioParamModVisual");
		return ptr;
	}

};


// Class Indiana.AudioSwitchModVisual
// 0x0020 (0x0088 - 0x0068)
class UAudioSwitchModVisual : public UModVisual
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0068(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AudioSwitchModVisual");
		return ptr;
	}

};


// Class Indiana.AutoSneakAttackStatusEffect
// 0x0000 (0x0188 - 0x0188)
class UAutoSneakAttackStatusEffect : public UStatusEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AutoSneakAttackStatusEffect");
		return ptr;
	}

};


// Class Indiana.AutoStasisTriggerComponent
// 0x0000 (0x02B0 - 0x02B0)
class UAutoStasisTriggerComponent : public USceneComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AutoStasisTriggerComponent");
		return ptr;
	}

};


// Class Indiana.AutoStasisTrigger
// 0x0028 (0x0408 - 0x03E0)
class AAutoStasisTrigger : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x03E0(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.AutoStasisTrigger");
		return ptr;
	}

};


// Class Indiana.BackgroundPanelWidget
// 0x0088 (0x02A8 - 0x0220)
class UBackgroundPanelWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x88];                                      // 0x0220(0x0088) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BackgroundPanelWidget");
		return ptr;
	}


	void STATIC_SetBackgroundFocused(bool bFocused);
	void STATIC_RegisterButtons(TArray<class UButtonBase*> Buttons);
	void STATIC_OnOuterTextureLoaded(class UTexture2D* Texture);
	void STATIC_OnInnerTextureLoaded(class UTexture2D* Texture);
};


// Class Indiana.BackgroundSplitPanelWidget
// 0x00E8 (0x0308 - 0x0220)
class UBackgroundSplitPanelWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0xE8];                                      // 0x0220(0x00E8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BackgroundSplitPanelWidget");
		return ptr;
	}


	void STATIC_OnOuterTopTextureLoaded(class UTexture2D* Texture);
	void STATIC_OnOuterBottomTextureLoaded(class UTexture2D* Texture);
	void STATIC_OnInnerTopTextureLoaded(class UTexture2D* Texture);
	void STATIC_OnInnerBottomTextureLoaded(class UTexture2D* Texture);
};


// Class Indiana.BaseInventoryItemManagement
// 0x0098 (0x0348 - 0x02B0)
class UBaseInventoryItemManagement : public UIndianaInterfaceUserWidget
{
public:
	unsigned char                                      UnknownData00[0x98];                                      // 0x02B0(0x0098) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BaseInventoryItemManagement");
		return ptr;
	}


	void STATIC_OnDragDrop_SetArmorSlot(class UIndianaDragDropOperation* Operation);
	void STATIC_OnDragDrop_JunkItem(class UIndianaDragDropOperation* Operation);
	void STATIC_OnDragDrop_ClearWeaponSlot(class UIndianaDragDropOperation* Operation);
	void STATIC_OnDragDrop_BreakDownItem(class UIndianaDragDropOperation* Operation);
};


// Class Indiana.BaseMapEntryWidget
// 0x0000 (0x02A8 - 0x02A8)
class UBaseMapEntryWidget : public UIndianaUserWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BaseMapEntryWidget");
		return ptr;
	}

};


// Class Indiana.EventEffect
// 0x0000 (0x0030 - 0x0030)
class UEventEffect : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.EventEffect");
		return ptr;
	}

};


// Class Indiana.BasePlayAnimEventEffect
// 0x0010 (0x0040 - 0x0030)
class UBasePlayAnimEventEffect : public UEventEffect
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0030(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BasePlayAnimEventEffect");
		return ptr;
	}

};


// Class Indiana.BaseTeamData
// 0x0050 (0x0080 - 0x0030)
class UBaseTeamData : public UObject
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0030(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BaseTeamData");
		return ptr;
	}

};


// Class Indiana.BasicMapFloorTrackedActor
// 0x0030 (0x03B8 - 0x0388)
class ABasicMapFloorTrackedActor : public AActor
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0388(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BasicMapFloorTrackedActor");
		return ptr;
	}

};


// Class Indiana.NewBeacon
// 0x0080 (0x0408 - 0x0388)
class ANewBeacon : public AActor
{
public:
	unsigned char                                      UnknownData00[0x80];                                      // 0x0388(0x0080) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.NewBeacon");
		return ptr;
	}

};


// Class Indiana.BeaconComponent
// 0x0030 (0x02E0 - 0x02B0)
class UBeaconComponent : public USceneComponent
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x02B0(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BeaconComponent");
		return ptr;
	}


	void STATIC_Show();
	void STATIC_Hide();
};


// Class Indiana.BeaconManager
// 0x0118 (0x0148 - 0x0030)
class UBeaconManager : public UObject
{
public:
	unsigned char                                      UnknownData00[0x118];                                     // 0x0030(0x0118) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BeaconManager");
		return ptr;
	}


	void STATIC_OnShipChangedLocation(class UShipDestinationData* NewShipLocation);
};


// Class Indiana.BeaconMapEntryWidget
// 0x0058 (0x0300 - 0x02A8)
class UBeaconMapEntryWidget : public UBaseMapEntryWidget
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x02A8(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BeaconMapEntryWidget");
		return ptr;
	}

};


// Class Indiana.BeaconTagWidget
// 0x0070 (0x0318 - 0x02A8)
class UBeaconTagWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x70];                                      // 0x02A8(0x0070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BeaconTagWidget");
		return ptr;
	}


	void STATIC_OnWaypointMarkerVisibilityChanged(bool bVisible);
	void STATIC_OnHUDVisibilityChanged(bool bVisible);
};


// Class Indiana.IndianaWidgetComponent
// 0x0030 (0x0780 - 0x0750)
class UIndianaWidgetComponent : public UWidgetComponent
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0750(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.IndianaWidgetComponent");
		return ptr;
	}

};


// Class Indiana.BeaconTagWidgetComponent
// 0x0010 (0x0790 - 0x0780)
class UBeaconTagWidgetComponent : public UIndianaWidgetComponent
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0780(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BeaconTagWidgetComponent");
		return ptr;
	}

};


// Class Indiana.Destructible
// 0x01B0 (0x0538 - 0x0388)
class ADestructible : public AActor
{
public:
	unsigned char                                      UnknownData00[0x1B0];                                     // 0x0388(0x01B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Destructible");
		return ptr;
	}


	void STATIC_SetDestructibleState(EDestructibleState NewState);
	void STATIC_ReceiveTriggerUntripped();
	void STATIC_ReceiveTriggerTripped();
	void STATIC_ReceiveTriggerDisarmed();
	void STATIC_ReceiveTriggerArmed();
	void STATIC_ReceivePreDeploy();
	void STATIC_ReceiveDeployOrder();
	void STATIC_OnHealthChanged(float HealthChange, class AActor* InInstigator);
};


// Class Indiana.BeamLauncher
// 0x0120 (0x0658 - 0x0538)
class ABeamLauncher : public ADestructible
{
public:
	unsigned char                                      UnknownData00[0x120];                                     // 0x0538(0x0120) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BeamLauncher");
		return ptr;
	}

};


// Class Indiana.WeaponMode
// 0x0100 (0x0130 - 0x0030)
class UWeaponMode : public UObject
{
public:
	unsigned char                                      UnknownData00[0x100];                                     // 0x0030(0x0100) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.WeaponMode");
		return ptr;
	}


	bool IsIdle();
	bool IsFullyAimed();
	bool IsCharging();
	class UClass* GetSecondaryDamageType();
	EIndianaDamageType GetPrimaryDamageTypeEnum();
	class UClass* GetPrimaryDamageType();
};


// Class Indiana.RangedMode
// 0x0450 (0x0580 - 0x0130)
class URangedMode : public UWeaponMode
{
public:
	unsigned char                                      UnknownData00[0x450];                                     // 0x0130(0x0450) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.RangedMode");
		return ptr;
	}


	void STATIC_OnMontageBlendingOut(class UAnimMontage* Montage, bool bInterrupted);
	bool HasScope();
	float GetWeaponCurrentAmmoGaugeAlpha();
	struct FVector GetShotOrigin();
	struct FRotator GetMuzzleRotation();
	bool GetMuzzleLocationAndRotation(struct FVector* Location, struct FRotator* Rotation);
	struct FVector GetMuzzleLocation();
	struct FVector GetAimingUpDirection();
	struct FVector GetAimingDirection();
};


// Class Indiana.BeamMode
// 0x00F0 (0x0670 - 0x0580)
class UBeamMode : public URangedMode
{
public:
	unsigned char                                      UnknownData00[0xF0];                                      // 0x0580(0x00F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BeamMode");
		return ptr;
	}


	bool IsTargetingPlayer();
	bool HasLockedTarget();
	struct FVector GetTargetLocation();
};


// Class Indiana.BeardAppearances
// 0x0010 (0x0048 - 0x0038)
class UBeardAppearances : public UPrimaryDataAsset
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0038(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BeardAppearances");
		return ptr;
	}

};


// Class Indiana.BeardColor
// 0x0020 (0x0058 - 0x0038)
class UBeardColor : public UPrimaryDataAsset
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0038(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BeardColor");
		return ptr;
	}

};


// Class Indiana.FurnitureActor
// 0x0010 (0x0398 - 0x0388)
class AFurnitureActor : public AActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0388(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.FurnitureActor");
		return ptr;
	}

};


// Class Indiana.Bed
// 0x0038 (0x03D0 - 0x0398)
class ABed : public AFurnitureActor
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0398(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Bed");
		return ptr;
	}

};


// Class Indiana.BehaviorStackComponent
// 0x0150 (0x0268 - 0x0118)
class UBehaviorStackComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x150];                                     // 0x0118(0x0150) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BehaviorStackComponent");
		return ptr;
	}

};


// Class Indiana.EQS_BehaviorStateInfo
// 0x0058 (0x0178 - 0x0120)
class UEQS_BehaviorStateInfo : public UBehaviorStateInfo
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0120(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.EQS_BehaviorStateInfo");
		return ptr;
	}

};


// Class Indiana.BehaviorTreeGlobalParams
// 0x0018 (0x0048 - 0x0030)
class UBehaviorTreeGlobalParams : public UObject
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0030(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BehaviorTreeGlobalParams");
		return ptr;
	}

};


// Class Indiana.IndianaAnimInstance
// 0x01D0 (0x0540 - 0x0370)
class UIndianaAnimInstance : public UAnimInstance
{
public:
	unsigned char                                      UnknownData00[0x1D0];                                     // 0x0370(0x01D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.IndianaAnimInstance");
		return ptr;
	}


	float Montage_SkipToEnd(class UAnimMontage* MontageToPlay);
	void STATIC_AnimNotify_ToggleFootIK();
	void STATIC_AnimNotify_EnableFootIK();
	void STATIC_AnimNotify_DisableFootIK();
};


// Class Indiana.CharacterAnimInstance
// 0x00C0 (0x0600 - 0x0540)
class UCharacterAnimInstance : public UIndianaAnimInstance
{
public:
	unsigned char                                      UnknownData00[0xC0];                                      // 0x0540(0x00C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterAnimInstance");
		return ptr;
	}


	void STATIC_SetDisabledAnimation(const struct FAnimEventGameplayTagContainer& Container);
	void STATIC_OnRebuildAnimationSetData();
	void STATIC_OnNewWeaponAnimations(class UWeaponAnimations* NewWeaponAnimations);
	void STATIC_OnNewLocomotionAnimationSet(class ULocomotionAnimationSet* NewLocomtionAnimationSet);
	void STATIC_OnMovementLanded(float Distance);
	bool IsMontagePlayingOnSlot(const struct FName& SlotNodeName);
};


// Class Indiana.TPVAnimInstance
// 0x03F0 (0x09F0 - 0x0600)
class UTPVAnimInstance : public UCharacterAnimInstance
{
public:
	unsigned char                                      UnknownData00[0x3F0];                                     // 0x0600(0x03F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.TPVAnimInstance");
		return ptr;
	}


	void STATIC_UpdateAnimationSetUpdate();
	void STATIC_SetStateTransitioned(EAnimTreeState State, bool Transitioned);
	void STATIC_SetPersonality(class UTPVPersonalitySet* Personality);
	bool SetNextEmotion(EEmotion Emotion, float Duration, bool Persist, bool ForceNextEmotion);
	void STATIC_ResetEmotionToDefault();
	void STATIC_OnMontageStart(class UAnimMontage* Montage);
	void STATIC_OnMontageEnd(class UAnimMontage* Montage, bool bInterrupted);
	void STATIC_GetUpFromRagdoll(float GetUpSpeed);
	int GetAnimationSetUpdate();
	void STATIC_ClearCurrentEmotion();
	void STATIC_AnimNotify_ResetLocomotionState();
	void STATIC_AnimNotify_OnLandEnd();
	void STATIC_AnimNotify_OnJumpIntroEnd();
	void STATIC_AnimNotify_NCWalkStartEntered();
	void STATIC_AnimNotify_NCWalkEntered();
	void STATIC_AnimNotify_NCTurnEntered();
	void STATIC_AnimNotify_NCRunEntered();
	void STATIC_AnimNotify_NCIdleEntered();
	void STATIC_AnimNotify_JumpStateMachineComplete();
	void STATIC_AnimNotify_IdleStateLeft();
	void STATIC_AnimNotify_CTurnEntered();
	void STATIC_AnimNotify_CombatStateEntered();
	void STATIC_AnimNotify_ClearFurnitureFlag();
};


// Class Indiana.BipedAnimInstance
// 0x0990 (0x1380 - 0x09F0)
class UBipedAnimInstance : public UTPVAnimInstance
{
public:
	unsigned char                                      UnknownData00[0x990];                                     // 0x09F0(0x0990) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BipedAnimInstance");
		return ptr;
	}


	void STATIC_UpdatePersonalityAnims();
	void STATIC_PickRandomIdle();
	void STATIC_AnimNotify_SafeToReevaluateTalking();
};


// Class Indiana.BlockComponent
// 0x0170 (0x0288 - 0x0118)
class UBlockComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x170];                                     // 0x0118(0x0170) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BlockComponent");
		return ptr;
	}

};


// Class Indiana.BlockInventoryVolume
// 0x0000 (0x03E0 - 0x03E0)
class ABlockInventoryVolume : public AVolume
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BlockInventoryVolume");
		return ptr;
	}

};


// Class Indiana.BodyAppearances
// 0x0020 (0x0058 - 0x0038)
class UBodyAppearances : public UPrimaryDataAsset
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0038(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BodyAppearances");
		return ptr;
	}

};


// Class Indiana.BodyLocationSpellAsset
// 0x0040 (0x0078 - 0x0038)
class UBodyLocationSpellAsset : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0038(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BodyLocationSpellAsset");
		return ptr;
	}

};


// Class Indiana.BodyPartData
// 0x0010 (0x0048 - 0x0038)
class UBodyPartData : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0038(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BodyPartData");
		return ptr;
	}

};


// Class Indiana.BodyPartsComponent
// 0x0000 (0x0118 - 0x0118)
class UBodyPartsComponent : public UActorComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BodyPartsComponent");
		return ptr;
	}

};


// Class Indiana.BoneModStatusEffect
// 0x0010 (0x0198 - 0x0188)
class UBoneModStatusEffect : public UStatusEffect
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0188(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BoneModStatusEffect");
		return ptr;
	}

};


// Class Indiana.BossComponent
// 0x0030 (0x0148 - 0x0118)
class UBossComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0118(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BossComponent");
		return ptr;
	}


	void STATIC_OnHealthChanged(float HealthChange, class AActor* InInstigator);
	void STATIC_OnCombatStateChanged(bool bIsInCombat, bool bRestoring);
};


// Class Indiana.BossFightManager
// 0x0030 (0x0060 - 0x0030)
class UBossFightManager : public UObject
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0030(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BossFightManager");
		return ptr;
	}

};


// Class Indiana.BotAnimInstance
// 0x0140 (0x0B30 - 0x09F0)
class UBotAnimInstance : public UTPVAnimInstance
{
public:
	unsigned char                                      UnknownData00[0x140];                                     // 0x09F0(0x0140) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BotAnimInstance");
		return ptr;
	}

};


// Class Indiana.BrandDataAsset
// 0x00A8 (0x00E0 - 0x0038)
class UBrandDataAsset : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0xA8];                                      // 0x0038(0x00A8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BrandDataAsset");
		return ptr;
	}

};


// Class Indiana.BreakdownPopupWidget
// 0x0030 (0x02D8 - 0x02A8)
class UBreakdownPopupWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x02A8(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BreakdownPopupWidget");
		return ptr;
	}

};


// Class Indiana.Brows
// 0x0008 (0x0040 - 0x0038)
class UBrows : public UPrimaryDataAsset
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Brows");
		return ptr;
	}

};


// Class Indiana.BTDecorator_IndianaConditional
// 0x0008 (0x0078 - 0x0070)
class UBTDecorator_IndianaConditional : public UBTDecorator
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0070(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTDecorator_IndianaConditional");
		return ptr;
	}

};


// Class Indiana.BT_Con_Composite
// 0x0010 (0x0088 - 0x0078)
class UBT_Con_Composite : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0078(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Composite");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_IsLocationValid
// 0x0010 (0x0088 - 0x0078)
class UBT_Con_General_IsLocationValid : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0078(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_IsLocationValid");
		return ptr;
	}

};


// Class Indiana.BT_Con_Animation_ShouldFaceTargetBeforePlayback
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_Animation_ShouldFaceTargetBeforePlayback : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Animation_ShouldFaceTargetBeforePlayback");
		return ptr;
	}

};


// Class Indiana.BT_Con_Approach_IsTargetInConversation
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_Approach_IsTargetInConversation : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Approach_IsTargetInConversation");
		return ptr;
	}

};


// Class Indiana.BT_Con_Approach_IsInInterrogationRange
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_Approach_IsInInterrogationRange : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Approach_IsInInterrogationRange");
		return ptr;
	}

};


// Class Indiana.BT_Con_CompanionFollow_ShouldWait
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_CompanionFollow_ShouldWait : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_CompanionFollow_ShouldWait");
		return ptr;
	}

};


// Class Indiana.BT_Con_CompanionFollow_IsFollowLocationValid
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_CompanionFollow_IsFollowLocationValid : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_CompanionFollow_IsFollowLocationValid");
		return ptr;
	}

};


// Class Indiana.BT_Con_Cover_IsCoverType
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_Cover_IsCoverType : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Cover_IsCoverType");
		return ptr;
	}

};


// Class Indiana.BT_Con_Cover_WasInterrupted
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_Cover_WasInterrupted : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Cover_WasInterrupted");
		return ptr;
	}

};


// Class Indiana.BT_Con_Crouch_IsCrouchInPlace
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_Crouch_IsCrouchInPlace : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Crouch_IsCrouchInPlace");
		return ptr;
	}

};


// Class Indiana.BT_Con_Furniture_IsCurrentBehaviorState
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_Furniture_IsCurrentBehaviorState : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Furniture_IsCurrentBehaviorState");
		return ptr;
	}

};


// Class Indiana.BT_Con_Furniture_ShouldOrientToFurniture
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_Furniture_ShouldOrientToFurniture : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Furniture_ShouldOrientToFurniture");
		return ptr;
	}

};


// Class Indiana.BT_Con_Furniture_IsReserved
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_Furniture_IsReserved : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Furniture_IsReserved");
		return ptr;
	}

};


// Class Indiana.BT_Con_Furniture_IsValid
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_Furniture_IsValid : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Furniture_IsValid");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_IsSeen
// 0x0010 (0x0088 - 0x0078)
class UBT_Con_General_IsSeen : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0078(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_IsSeen");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_IsAimingPossible
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_General_IsAimingPossible : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_IsAimingPossible");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_IsFollowTargetValid
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_General_IsFollowTargetValid : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_IsFollowTargetValid");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_IsFollower
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_General_IsFollower : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_IsFollower");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_IsOnRails
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_General_IsOnRails : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_IsOnRails");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_HasEquippedWeapon
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_General_HasEquippedWeapon : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_HasEquippedWeapon");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_IsInRange
// 0x0038 (0x00B0 - 0x0078)
class UBT_Con_General_IsInRange : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0078(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_IsInRange");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_CanMoveCloserOnRails
// 0x0018 (0x0090 - 0x0078)
class UBT_Con_General_CanMoveCloserOnRails : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0078(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_CanMoveCloserOnRails");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_ClosestVantageIsInRange
// 0x0030 (0x00A8 - 0x0078)
class UBT_Con_General_ClosestVantageIsInRange : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0078(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_ClosestVantageIsInRange");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_IsFacingTarget
// 0x0018 (0x0090 - 0x0078)
class UBT_Con_General_IsFacingTarget : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0078(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_IsFacingTarget");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_CheckBooleanSelector
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_General_CheckBooleanSelector : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_CheckBooleanSelector");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_IsTimeSinceBehaviorState
// 0x0010 (0x0088 - 0x0078)
class UBT_Con_General_IsTimeSinceBehaviorState : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0078(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_IsTimeSinceBehaviorState");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_TestContinuousSeenTime
// 0x0010 (0x0088 - 0x0078)
class UBT_Con_General_TestContinuousSeenTime : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0078(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_TestContinuousSeenTime");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_IsBehaviorStateComplete
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_General_IsBehaviorStateComplete : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_IsBehaviorStateComplete");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_WithInDistance
// 0x0018 (0x0090 - 0x0078)
class UBT_Con_General_WithInDistance : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0078(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_WithInDistance");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_IsInPlayerConversation
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_General_IsInPlayerConversation : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_IsInPlayerConversation");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_IsValidHealTarget
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_General_IsValidHealTarget : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_IsValidHealTarget");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_IsPrimaryTargetStimulusType
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_General_IsPrimaryTargetStimulusType : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_IsPrimaryTargetStimulusType");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_Random
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_General_Random : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_Random");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_IsAlertStateTimeRemainingEstimateGreaterThan
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_General_IsAlertStateTimeRemainingEstimateGreaterThan : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_IsAlertStateTimeRemainingEstimateGreaterThan");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_WantsNonBehaviorCrouch
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_General_WantsNonBehaviorCrouch : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_WantsNonBehaviorCrouch");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_Dot
// 0x0028 (0x00A0 - 0x0078)
class UBT_Con_General_Dot : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0078(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_Dot");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_HasVantageOnActor
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_General_HasVantageOnActor : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_HasVantageOnActor");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_SimpleIsSeen
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_General_SimpleIsSeen : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_SimpleIsSeen");
		return ptr;
	}

};


// Class Indiana.BT_Con_General_IsCreatureType
// 0x0028 (0x00A0 - 0x0078)
class UBT_Con_General_IsCreatureType : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0078(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_General_IsCreatureType");
		return ptr;
	}

};


// Class Indiana.BT_Con_Jump_ShouldRotateToFaceJumpDirection
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_Jump_ShouldRotateToFaceJumpDirection : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Jump_ShouldRotateToFaceJumpDirection");
		return ptr;
	}

};


// Class Indiana.BT_Con_Jump_IsJumpInPlace
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_Jump_IsJumpInPlace : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Jump_IsJumpInPlace");
		return ptr;
	}

};


// Class Indiana.BT_Con_Jump_IsIntroAnimationComplete
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_Jump_IsIntroAnimationComplete : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Jump_IsIntroAnimationComplete");
		return ptr;
	}

};


// Class Indiana.BT_Con_Jump_IsOutroAnimationComplete
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_Jump_IsOutroAnimationComplete : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Jump_IsOutroAnimationComplete");
		return ptr;
	}

};


// Class Indiana.BT_Con_Melee_IsSlottingState
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_Melee_IsSlottingState : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Melee_IsSlottingState");
		return ptr;
	}

};


// Class Indiana.BT_Con_Melee_IsRecoveryType
// 0x0008 (0x0080 - 0x0078)
class UBT_Con_Melee_IsRecoveryType : public UBTDecorator_IndianaConditional
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Melee_IsRecoveryType");
		return ptr;
	}

};


// Class Indiana.BT_Con_Melee_IsDodgeRecoveryPossible
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_Melee_IsDodgeRecoveryPossible : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Melee_IsDodgeRecoveryPossible");
		return ptr;
	}

};


// Class Indiana.BT_Con_MoveTo_ShouldWaitAfterArrival
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_MoveTo_ShouldWaitAfterArrival : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_MoveTo_ShouldWaitAfterArrival");
		return ptr;
	}

};


// Class Indiana.BT_Con_Patrol_IsPatrolNodeValid
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_Patrol_IsPatrolNodeValid : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Patrol_IsPatrolNodeValid");
		return ptr;
	}

};


// Class Indiana.BT_Con_Patrol_HasPatrolNodeAction
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_Patrol_HasPatrolNodeAction : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Patrol_HasPatrolNodeAction");
		return ptr;
	}

};


// Class Indiana.BT_Con_Search_ShouldMoveDirectlyToTarget
// 0x0000 (0x0078 - 0x0078)
class UBT_Con_Search_ShouldMoveDirectlyToTarget : public UBTDecorator_IndianaConditional
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Con_Search_ShouldMoveDirectlyToTarget");
		return ptr;
	}

};


// Class Indiana.BTDecorator_IndianaScript
// 0x0008 (0x0078 - 0x0070)
class UBTDecorator_IndianaScript : public UBTDecorator
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0070(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTDecorator_IndianaScript");
		return ptr;
	}

};


// Class Indiana.BTDecorator_IndianaToggleScript
// 0x0000 (0x0070 - 0x0070)
class UBTDecorator_IndianaToggleScript : public UBTDecorator
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTDecorator_IndianaToggleScript");
		return ptr;
	}

};


// Class Indiana.BT_Scr_SetMovementState
// 0x0010 (0x0080 - 0x0070)
class UBT_Scr_SetMovementState : public UBTDecorator_IndianaToggleScript
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0070(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_SetMovementState");
		return ptr;
	}

};


// Class Indiana.BT_Scr_SetMovementState_Distance
// 0x0018 (0x0098 - 0x0080)
class UBT_Scr_SetMovementState_Distance : public UBT_Scr_SetMovementState
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0080(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_SetMovementState_Distance");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Approach_Interrogate
// 0x0000 (0x0078 - 0x0078)
class UBT_Scr_Approach_Interrogate : public UBTDecorator_IndianaScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Approach_Interrogate");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Approach_SetApproaching
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_Approach_SetApproaching : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Approach_SetApproaching");
		return ptr;
	}

};


// Class Indiana.BT_Scr_CalledShot_CameraStep
// 0x0008 (0x0080 - 0x0078)
class UBT_Scr_CalledShot_CameraStep : public UBTDecorator_IndianaScript
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_CalledShot_CameraStep");
		return ptr;
	}

};


// Class Indiana.BT_Scr_CalledShot_Teleport
// 0x0000 (0x0078 - 0x0078)
class UBT_Scr_CalledShot_Teleport : public UBTDecorator_IndianaScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_CalledShot_Teleport");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Cover_IncrementCoverUseCounter
// 0x0000 (0x0078 - 0x0078)
class UBT_Scr_Cover_IncrementCoverUseCounter : public UBTDecorator_IndianaScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Cover_IncrementCoverUseCounter");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Cover_SetCoverType
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_Cover_SetCoverType : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Cover_SetCoverType");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Cover_ClearInterrupted
// 0x0000 (0x0078 - 0x0078)
class UBT_Scr_Cover_ClearInterrupted : public UBTDecorator_IndianaScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Cover_ClearInterrupted");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Crouch_UpdatePrematureExit
// 0x0000 (0x0078 - 0x0078)
class UBT_Scr_Crouch_UpdatePrematureExit : public UBTDecorator_IndianaScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Crouch_UpdatePrematureExit");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Flank_ForceTargetOverride
// 0x0000 (0x0078 - 0x0078)
class UBT_Scr_Flank_ForceTargetOverride : public UBTDecorator_IndianaScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Flank_ForceTargetOverride");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Follow_ClearTeleportFlag
// 0x0000 (0x0078 - 0x0078)
class UBT_Scr_Follow_ClearTeleportFlag : public UBTDecorator_IndianaScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Follow_ClearTeleportFlag");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Furniture_SetFurniture
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_Furniture_SetFurniture : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Furniture_SetFurniture");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Furniture_SetConversationWaitState
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_Furniture_SetConversationWaitState : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Furniture_SetConversationWaitState");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Furniture_TransitionState
// 0x0000 (0x0078 - 0x0078)
class UBT_Scr_Furniture_TransitionState : public UBTDecorator_IndianaScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Furniture_TransitionState");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Furniture_AttemptToReserve
// 0x0000 (0x0078 - 0x0078)
class UBT_Scr_Furniture_AttemptToReserve : public UBTDecorator_IndianaScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Furniture_AttemptToReserve");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Furniture_ForceInterest
// 0x0000 (0x0078 - 0x0078)
class UBT_Scr_Furniture_ForceInterest : public UBTDecorator_IndianaScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Furniture_ForceInterest");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_SetAnimationParameter
// 0x0008 (0x0078 - 0x0070)
class UBT_Scr_General_SetAnimationParameter : public UBTDecorator_IndianaToggleScript
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0070(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_SetAnimationParameter");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_LockAIState
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_General_LockAIState : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_LockAIState");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_RequestPrimaryTarget
// 0x0008 (0x0080 - 0x0078)
class UBT_Scr_General_RequestPrimaryTarget : public UBTDecorator_IndianaScript
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_RequestPrimaryTarget");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_PromoteQueuedToPrimaryTarget
// 0x0000 (0x0078 - 0x0078)
class UBT_Scr_General_PromoteQueuedToPrimaryTarget : public UBTDecorator_IndianaScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_PromoteQueuedToPrimaryTarget");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_ClearStimulus
// 0x0000 (0x0078 - 0x0078)
class UBT_Scr_General_ClearStimulus : public UBTDecorator_IndianaScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_ClearStimulus");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_SetBehaviorStateComplete
// 0x0010 (0x0088 - 0x0078)
class UBT_Scr_General_SetBehaviorStateComplete : public UBTDecorator_IndianaScript
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0078(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_SetBehaviorStateComplete");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_TriggerChatterEvent
// 0x0008 (0x0080 - 0x0078)
class UBT_Scr_General_TriggerChatterEvent : public UBTDecorator_IndianaScript
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_TriggerChatterEvent");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_ClearTargetDetection
// 0x0010 (0x0088 - 0x0078)
class UBT_Scr_General_ClearTargetDetection : public UBTDecorator_IndianaScript
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0078(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_ClearTargetDetection");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_CancelCompanionCommandAttack
// 0x0008 (0x0080 - 0x0078)
class UBT_Scr_General_CancelCompanionCommandAttack : public UBTDecorator_IndianaScript
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_CancelCompanionCommandAttack");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_ChangeCapsuleRadius
// 0x0008 (0x0078 - 0x0070)
class UBT_Scr_General_ChangeCapsuleRadius : public UBTDecorator_IndianaToggleScript
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0070(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_ChangeCapsuleRadius");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_SetCanBump
// 0x0008 (0x0078 - 0x0070)
class UBT_Scr_General_SetCanBump : public UBTDecorator_IndianaToggleScript
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0070(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_SetCanBump");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_LockAllRotations
// 0x0008 (0x0078 - 0x0070)
class UBT_Scr_General_LockAllRotations : public UBTDecorator_IndianaToggleScript
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0070(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_LockAllRotations");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_SwitchContext
// 0x0008 (0x0080 - 0x0078)
class UBT_Scr_General_SwitchContext : public UBTDecorator_IndianaScript
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_SwitchContext");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_Crouch
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_General_Crouch : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_Crouch");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_StartBehaviorStateCountdown
// 0x0008 (0x0080 - 0x0078)
class UBT_Scr_General_StartBehaviorStateCountdown : public UBTDecorator_IndianaScript
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_StartBehaviorStateCountdown");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_TurnOffCharacterCollisionToggle
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_General_TurnOffCharacterCollisionToggle : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_TurnOffCharacterCollisionToggle");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_TurnOffMesh
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_General_TurnOffMesh : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_TurnOffMesh");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_EnableContinousMovement
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_General_EnableContinousMovement : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_EnableContinousMovement");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_Teleport
// 0x0010 (0x0088 - 0x0078)
class UBT_Scr_General_Teleport : public UBTDecorator_IndianaScript
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0078(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_Teleport");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_EnableGodVision
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_General_EnableGodVision : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_EnableGodVision");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_SetAlertStateMinDuration
// 0x0008 (0x0080 - 0x0078)
class UBT_Scr_General_SetAlertStateMinDuration : public UBTDecorator_IndianaScript
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_SetAlertStateMinDuration");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_RegisterAreaRange
// 0x0008 (0x0078 - 0x0070)
class UBT_Scr_General_RegisterAreaRange : public UBTDecorator_IndianaToggleScript
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0070(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_RegisterAreaRange");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_SetBehaviorNavigationSettings
// 0x0010 (0x0080 - 0x0070)
class UBT_Scr_General_SetBehaviorNavigationSettings : public UBTDecorator_IndianaToggleScript
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0070(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_SetBehaviorNavigationSettings");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_SetOverrideBehaviorAnimation
// 0x0008 (0x0078 - 0x0070)
class UBT_Scr_General_SetOverrideBehaviorAnimation : public UBTDecorator_IndianaToggleScript
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0070(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_SetOverrideBehaviorAnimation");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_SetArcing
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_General_SetArcing : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_SetArcing");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_SetTogglableAction
// 0x0010 (0x0080 - 0x0070)
class UBT_Scr_General_SetTogglableAction : public UBTDecorator_IndianaToggleScript
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0070(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_SetTogglableAction");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_ToggleMovementOptimizations
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_General_ToggleMovementOptimizations : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_ToggleMovementOptimizations");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_DisableNavWalking
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_General_DisableNavWalking : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_DisableNavWalking");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_SetCowering
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_General_SetCowering : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_SetCowering");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_Mute
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_General_Mute : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_Mute");
		return ptr;
	}

};


// Class Indiana.BT_Scr_General_DisableRelavancy
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_General_DisableRelavancy : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_General_DisableRelavancy");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Investigate_NotifyPreMoveWaitCompleted
// 0x0000 (0x0078 - 0x0078)
class UBT_Scr_Investigate_NotifyPreMoveWaitCompleted : public UBTDecorator_IndianaScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Investigate_NotifyPreMoveWaitCompleted");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Investigate_EndWaitExit
// 0x0000 (0x0078 - 0x0078)
class UBT_Scr_Investigate_EndWaitExit : public UBTDecorator_IndianaScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Investigate_EndWaitExit");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Jump_SetAnimationJumpFlag
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_Jump_SetAnimationJumpFlag : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Jump_SetAnimationJumpFlag");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Jump_LaunchJump
// 0x0000 (0x0078 - 0x0078)
class UBT_Scr_Jump_LaunchJump : public UBTDecorator_IndianaScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Jump_LaunchJump");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Jump_SetJumpGravity
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_Jump_SetJumpGravity : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Jump_SetJumpGravity");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Melee_IncrementPattern
// 0x0000 (0x0078 - 0x0078)
class UBT_Scr_Melee_IncrementPattern : public UBTDecorator_IndianaScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Melee_IncrementPattern");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Melee_SetIsAttacking
// 0x0000 (0x0070 - 0x0070)
class UBT_Scr_Melee_SetIsAttacking : public UBTDecorator_IndianaToggleScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Melee_SetIsAttacking");
		return ptr;
	}

};


// Class Indiana.BT_Scr_Patrol_SetBehaviorStateComplete
// 0x0000 (0x0078 - 0x0078)
class UBT_Scr_Patrol_SetBehaviorStateComplete : public UBTDecorator_IndianaScript
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BT_Scr_Patrol_SetBehaviorStateComplete");
		return ptr;
	}

};


// Class Indiana.BTService_IndianaBase
// 0x0000 (0x0078 - 0x0078)
class UBTService_IndianaBase : public UBTService
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_IndianaBase");
		return ptr;
	}

};


// Class Indiana.BTService_Chatter
// 0x0008 (0x0080 - 0x0078)
class UBTService_Chatter : public UBTService_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_Chatter");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_TargetLostCover
// 0x0010 (0x0088 - 0x0078)
class UBTService_EventFirer_TargetLostCover : public UBTService_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0078(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_TargetLostCover");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_TargetLostRanged
// 0x0020 (0x0098 - 0x0078)
class UBTService_EventFirer_TargetLostRanged : public UBTService_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0078(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_TargetLostRanged");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_UnsafeCover
// 0x0020 (0x0098 - 0x0078)
class UBTService_EventFirer_UnsafeCover : public UBTService_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0078(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_UnsafeCover");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_UnsafeOccupiedCover
// 0x0008 (0x0080 - 0x0078)
class UBTService_EventFirer_UnsafeOccupiedCover : public UBTService_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_UnsafeOccupiedCover");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_SuspiciousComplete
// 0x0000 (0x0078 - 0x0078)
class UBTService_EventFirer_SuspiciousComplete : public UBTService_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_SuspiciousComplete");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_InvestigateComplete
// 0x0000 (0x0078 - 0x0078)
class UBTService_EventFirer_InvestigateComplete : public UBTService_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_InvestigateComplete");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_DeactivatedComplete
// 0x0000 (0x0078 - 0x0078)
class UBTService_EventFirer_DeactivatedComplete : public UBTService_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_DeactivatedComplete");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_ApproachComplete
// 0x0000 (0x0078 - 0x0078)
class UBTService_EventFirer_ApproachComplete : public UBTService_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_ApproachComplete");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_RetreatComplete
// 0x0000 (0x0078 - 0x0078)
class UBTService_EventFirer_RetreatComplete : public UBTService_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_RetreatComplete");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_CompanionFollowComplete
// 0x0000 (0x0078 - 0x0078)
class UBTService_EventFirer_CompanionFollowComplete : public UBTService_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_CompanionFollowComplete");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_SEComplete
// 0x0008 (0x0080 - 0x0078)
class UBTService_EventFirer_SEComplete : public UBTService_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_SEComplete");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_InvalidSearch
// 0x0000 (0x0078 - 0x0078)
class UBTService_EventFirer_InvalidSearch : public UBTService_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_InvalidSearch");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_SearchComplete
// 0x0000 (0x0078 - 0x0078)
class UBTService_EventFirer_SearchComplete : public UBTService_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_SearchComplete");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_SearchTargetLost
// 0x0000 (0x0078 - 0x0078)
class UBTService_EventFirer_SearchTargetLost : public UBTService_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_SearchTargetLost");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_ConversationComplete
// 0x0000 (0x0078 - 0x0078)
class UBTService_EventFirer_ConversationComplete : public UBTService_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_ConversationComplete");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_InvalidMelee
// 0x0000 (0x0078 - 0x0078)
class UBTService_EventFirer_InvalidMelee : public UBTService_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_InvalidMelee");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_MeleeWait
// 0x0000 (0x0078 - 0x0078)
class UBTService_EventFirer_MeleeWait : public UBTService_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_MeleeWait");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_BlockedLOS
// 0x0008 (0x0080 - 0x0078)
class UBTService_EventFirer_BlockedLOS : public UBTService_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_BlockedLOS");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_IsNotSeen
// 0x0008 (0x0080 - 0x0078)
class UBTService_EventFirer_IsNotSeen : public UBTService_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_IsNotSeen");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_TargetOutsideMaxAbsoluteRange
// 0x0000 (0x0078 - 0x0078)
class UBTService_EventFirer_TargetOutsideMaxAbsoluteRange : public UBTService_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_TargetOutsideMaxAbsoluteRange");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_CCMoveToEnterCombatMode
// 0x0000 (0x0078 - 0x0078)
class UBTService_EventFirer_CCMoveToEnterCombatMode : public UBTService_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_CCMoveToEnterCombatMode");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_CowerComplete
// 0x0000 (0x0078 - 0x0078)
class UBTService_EventFirer_CowerComplete : public UBTService_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_CowerComplete");
		return ptr;
	}

};


// Class Indiana.BTService_EventFirer_Generic
// 0x0008 (0x0080 - 0x0078)
class UBTService_EventFirer_Generic : public UBTService_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_EventFirer_Generic");
		return ptr;
	}

};


// Class Indiana.BTService_General_FiringPattern
// 0x0048 (0x00C0 - 0x0078)
class UBTService_General_FiringPattern : public UBTService_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x0078(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_General_FiringPattern");
		return ptr;
	}

};


// Class Indiana.BTService_General_FocusAt
// 0x0060 (0x00D8 - 0x0078)
class UBTService_General_FocusAt : public UBTService_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0078(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_General_FocusAt");
		return ptr;
	}

};


// Class Indiana.BTService_RequestPrimaryTarget
// 0x0010 (0x0088 - 0x0078)
class UBTService_RequestPrimaryTarget : public UBTService_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0078(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_RequestPrimaryTarget");
		return ptr;
	}

};


// Class Indiana.BTService_Search_Chatter
// 0x0000 (0x0080 - 0x0080)
class UBTService_Search_Chatter : public UBTService_Chatter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_Search_Chatter");
		return ptr;
	}

};


// Class Indiana.BTService_Search_UpdateFire
// 0x0000 (0x0078 - 0x0078)
class UBTService_Search_UpdateFire : public UBTService_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_Search_UpdateFire");
		return ptr;
	}

};


// Class Indiana.BTService_SpellTargetService
// 0x0008 (0x0080 - 0x0078)
class UBTService_SpellTargetService : public UBTService_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTService_SpellTargetService");
		return ptr;
	}

};


// Class Indiana.BTTask_IndianaBase
// 0x0018 (0x0090 - 0x0078)
class UBTTask_IndianaBase : public UBTTaskNode
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0078(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_IndianaBase");
		return ptr;
	}

};


// Class Indiana.BTTask_Block
// 0x0010 (0x00A0 - 0x0090)
class UBTTask_Block : public UBTTask_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0090(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_Block");
		return ptr;
	}

};


// Class Indiana.BTTask_Death
// 0x0000 (0x0090 - 0x0090)
class UBTTask_Death : public UBTTask_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_Death");
		return ptr;
	}

};


// Class Indiana.BTTask_Disable
// 0x0078 (0x0108 - 0x0090)
class UBTTask_Disable : public UBTTask_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x78];                                      // 0x0090(0x0078) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_Disable");
		return ptr;
	}


	void STATIC_OnRagdollComplete(class UStatusEffect* StatusEffect);
	void STATIC_OnPushComplete(class UStatusEffect* StatusEffect);
	void STATIC_OnMontageBlendingOut(class UAnimMontage* Montage, bool bInterrupted);
	void STATIC_OnIdleFinished(class UStatusEffect* StatusEffect);
	void STATIC_OnFreezeComplete(class UStatusEffect* StatusEffect);
	void STATIC_OnDisableFinished(class UStatusEffect* StatusEffect);
};


// Class Indiana.BTTask_Dodge
// 0x0008 (0x0098 - 0x0090)
class UBTTask_Dodge : public UBTTask_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0090(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_Dodge");
		return ptr;
	}

};


// Class Indiana.BTTask_Indiana_PlayAnimation
// 0x0028 (0x00B8 - 0x0090)
class UBTTask_Indiana_PlayAnimation : public UBTTask_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0090(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_Indiana_PlayAnimation");
		return ptr;
	}

};


// Class Indiana.BTTask_IndianaMoveTo
// 0x0038 (0x00C8 - 0x0090)
class UBTTask_IndianaMoveTo : public UBTTask_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0090(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_IndianaMoveTo");
		return ptr;
	}

};


// Class Indiana.BTTask_IndianaDirectMoveTo
// 0x0008 (0x00D0 - 0x00C8)
class UBTTask_IndianaDirectMoveTo : public UBTTask_IndianaMoveTo
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x00C8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_IndianaDirectMoveTo");
		return ptr;
	}

};


// Class Indiana.BTTask_IndianaRunEQSQuery
// 0x0030 (0x00C0 - 0x0090)
class UBTTask_IndianaRunEQSQuery : public UBTTask_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0090(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_IndianaRunEQSQuery");
		return ptr;
	}

};


// Class Indiana.BTTask_IndianaWait
// 0x0018 (0x00A8 - 0x0090)
class UBTTask_IndianaWait : public UBTTask_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0090(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_IndianaWait");
		return ptr;
	}

};


// Class Indiana.BTTask_MeleeAttack
// 0x0030 (0x00C0 - 0x0090)
class UBTTask_MeleeAttack : public UBTTask_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0090(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_MeleeAttack");
		return ptr;
	}

};


// Class Indiana.BTTask_RunActions
// 0x0010 (0x00A0 - 0x0090)
class UBTTask_RunActions : public UBTTask_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0090(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_RunActions");
		return ptr;
	}

};


// Class Indiana.BTTask_RunRandomEQSQuery
// 0x0008 (0x00C8 - 0x00C0)
class UBTTask_RunRandomEQSQuery : public UBTTask_IndianaRunEQSQuery
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x00C0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_RunRandomEQSQuery");
		return ptr;
	}

};


// Class Indiana.BTTask_Script
// 0x0000 (0x0090 - 0x0090)
class UBTTask_Script : public UBTTask_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_Script");
		return ptr;
	}

};


// Class Indiana.BTTask_SwitchWeapon
// 0x0010 (0x00A0 - 0x0090)
class UBTTask_SwitchWeapon : public UBTTask_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0090(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_SwitchWeapon");
		return ptr;
	}

};


// Class Indiana.BTTask_TriggerPatrolNodeEvent
// 0x0008 (0x0098 - 0x0090)
class UBTTask_TriggerPatrolNodeEvent : public UBTTask_IndianaBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0090(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_TriggerPatrolNodeEvent");
		return ptr;
	}

};


// Class Indiana.BTTask_UseCover
// 0x0000 (0x0090 - 0x0090)
class UBTTask_UseCover : public UBTTask_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_UseCover");
		return ptr;
	}

};


// Class Indiana.BTTask_UseFurniture
// 0x0000 (0x0090 - 0x0090)
class UBTTask_UseFurniture : public UBTTask_IndianaBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.BTTask_UseFurniture");
		return ptr;
	}

};


// Class Indiana.ButtonBase
// 0x09D8 (0x0B08 - 0x0130)
class UButtonBase : public UContentWidget
{
public:
	unsigned char                                      UnknownData00[0x9D8];                                     // 0x0130(0x09D8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ButtonBase");
		return ptr;
	}


	void STATIC_SetSelectedPressedBrush(const struct FSlateBrush& InBrush);
	void STATIC_SetSelectedNormalBrush(const struct FSlateBrush& InBrush);
	void STATIC_SetSelectedHoveredBrush(const struct FSlateBrush& InBrush);
	void STATIC_SetSelectedFocusedBrush(const struct FSlateBrush& InBrush);
	void STATIC_SetSelected(bool bSelected, EFocusCause Cause);
	void STATIC_SetPressedBrush(const struct FSlateBrush& InBrush);
	void STATIC_SetNormalBrush(const struct FSlateBrush& InBrush);
	void STATIC_SetHoveredBrush(const struct FSlateBrush& InBrush);
	void STATIC_SetFocusedBrush(const struct FSlateBrush& InBrush);
	void STATIC_SetFocusable(bool bFocused);
	void STATIC_SetEnabled(bool bInEnabled);
	void STATIC_SetContentColor(const struct FLinearColor& InColorAndOpacity);
	void STATIC_SetButtonType(EButtonType TypeIn);
	void STATIC_SetButtonColor(const struct FLinearColor& InBackgroundColor);
	void STATIC_SetAllowSelectionStateChange(bool bAllowChange);
	void STATIC_SetAdvancedHitTexture(class UTexture2D* InTexture);
	void STATIC_SetAdvancedHitAlpha(int InAlpha);
	bool IsSelected();
	bool IsPressed();
	struct FSlateBrush GetSelectedPressedBrush();
	struct FSlateBrush GetSelectedNormalBrush();
	struct FSlateBrush GetSelectedHoveredBrush();
	struct FSlateBrush GetSelectedFocusedBrush();
	struct FSlateBrush GetPressedBrush();
	struct FSlateBrush GetNormalBrush();
	struct FSlateBrush GetHoveredBrush();
	struct FSlateBrush GetFocusedBrush();
	EButtonType GetButtonType();
	bool AllowsSelectionStateChange();
};


// Class Indiana.ButtonBaseContainerWidget
// 0x0038 (0x0258 - 0x0220)
class UButtonBaseContainerWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0220(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ButtonBaseContainerWidget");
		return ptr;
	}


	void STATIC_OnActivatableChange(bool bActivatable);
};


// Class Indiana.ButtonBaseSlot
// 0x0028 (0x0068 - 0x0040)
class UButtonBaseSlot : public UPanelSlot
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0040(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ButtonBaseSlot");
		return ptr;
	}


	void STATIC_SetVerticalAlignment(TEnumAsByte<EVerticalAlignment> InVerticalAlignment);
	void STATIC_SetPadding(const struct FMargin& InPadding);
	void STATIC_SetHorizontalAlignment(TEnumAsByte<EHorizontalAlignment> InHorizontalAlignment);
};


// Class Indiana.ButtonLedgerHeader
// 0x0000 (0x0B08 - 0x0B08)
class UButtonLedgerHeader : public UButtonBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ButtonLedgerHeader");
		return ptr;
	}

};


// Class Indiana.IndianaButtonWidgetStyle
// 0x07A0 (0x07D8 - 0x0038)
class UIndianaButtonWidgetStyle : public USlateWidgetStyleContainerBase
{
public:
	unsigned char                                      UnknownData00[0x7A0];                                     // 0x0038(0x07A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.IndianaButtonWidgetStyle");
		return ptr;
	}

};


// Class Indiana.CalledShotBehaviorStateInfo
// 0x00C8 (0x0240 - 0x0178)
class UCalledShotBehaviorStateInfo : public UEQS_BehaviorStateInfo
{
public:
	unsigned char                                      UnknownData00[0xC8];                                      // 0x0178(0x00C8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CalledShotBehaviorStateInfo");
		return ptr;
	}

};


// Class Indiana.DecisionTreeEQSRequestData
// 0x0020 (0x0080 - 0x0060)
class UDecisionTreeEQSRequestData : public UBehaviorStateRequestData
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0060(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.DecisionTreeEQSRequestData");
		return ptr;
	}

};


// Class Indiana.CalledShotRequestData
// 0x0000 (0x0080 - 0x0080)
class UCalledShotRequestData : public UDecisionTreeEQSRequestData
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CalledShotRequestData");
		return ptr;
	}

};


// Class Indiana.CombatCameraComponent
// 0x0040 (0x0158 - 0x0118)
class UCombatCameraComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0118(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CombatCameraComponent");
		return ptr;
	}


	void STATIC_EndCamera();
};


// Class Indiana.CalledShotCameraComponent
// 0x0098 (0x01F0 - 0x0158)
class UCalledShotCameraComponent : public UCombatCameraComponent
{
public:
	unsigned char                                      UnknownData00[0x98];                                      // 0x0158(0x0098) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CalledShotCameraComponent");
		return ptr;
	}

};


// Class Indiana.CalledShotData
// 0x0178 (0x01B0 - 0x0038)
class UCalledShotData : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x178];                                     // 0x0038(0x0178) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CalledShotData");
		return ptr;
	}

};


// Class Indiana.CartInfoWidget
// 0x00B0 (0x0358 - 0x02A8)
class UCartInfoWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0xB0];                                      // 0x02A8(0x00B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CartInfoWidget");
		return ptr;
	}

};


// Class Indiana.CastSpellEventEffect
// 0x0008 (0x0038 - 0x0030)
class UCastSpellEventEffect : public UEventEffect
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CastSpellEventEffect");
		return ptr;
	}

};


// Class Indiana.CastSpellStatusEffect
// 0x0010 (0x0198 - 0x0188)
class UCastSpellStatusEffect : public UStatusEffect
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0188(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CastSpellStatusEffect");
		return ptr;
	}

};


// Class Indiana.StatsSkillButtonEntryBase
// 0x0170 (0x0418 - 0x02A8)
class UStatsSkillButtonEntryBase : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x170];                                     // 0x02A8(0x0170) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.StatsSkillButtonEntryBase");
		return ptr;
	}


	void STATIC_UpdateButtonBrush();
};


// Class Indiana.CategoryButtonEntryWidget
// 0x0028 (0x0440 - 0x0418)
class UCategoryButtonEntryWidget : public UStatsSkillButtonEntryBase
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0418(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CategoryButtonEntryWidget");
		return ptr;
	}


	void STATIC_OnCategoryUnhoveredUnfocused();
};


// Class Indiana.CauseDamageReticleWidget
// 0x0038 (0x02E0 - 0x02A8)
class UCauseDamageReticleWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x02A8(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CauseDamageReticleWidget");
		return ptr;
	}


	void STATIC_ShowWeakAnim();
	void STATIC_ShowKillAnim();
	void STATIC_ShowHitAnim();
	void STATIC_OnCauseDamage(const struct FCauseDamageInfo& CauseDamageInfo);
};


// Class Indiana.CCAppearancePageWidget
// 0x0108 (0x03B0 - 0x02A8)
class UCCAppearancePageWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x108];                                     // 0x02A8(0x0108) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCAppearancePageWidget");
		return ptr;
	}


	void STATIC_SetCharacterDefaults();
	void STATIC_RandomizeCharacter();
	void STATIC_OnProgressToNextPage();
	void STATIC_OnExpandableAreaChanged(class UExpandableAreaBase* AreaBaseWidget, bool bIsExpanded);
	struct FEventReply OnBorderMouseDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
};


// Class Indiana.CCAptitudeListEntry
// 0x0040 (0x02E8 - 0x02A8)
class UCCAptitudeListEntry : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x02A8(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCAptitudeListEntry");
		return ptr;
	}

};


// Class Indiana.CCAptitudeListWidget
// 0x0028 (0x02D0 - 0x02A8)
class UCCAptitudeListWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x02A8(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCAptitudeListWidget");
		return ptr;
	}

};


// Class Indiana.CCAptitudePageWidget
// 0x0088 (0x0330 - 0x02A8)
class UCCAptitudePageWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x88];                                      // 0x02A8(0x0088) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCAptitudePageWidget");
		return ptr;
	}

};


// Class Indiana.CCAptitudeSummaryWidget
// 0x0018 (0x02C0 - 0x02A8)
class UCCAptitudeSummaryWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x02A8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCAptitudeSummaryWidget");
		return ptr;
	}

};


// Class Indiana.CCAttributeSummaryWidget
// 0x0018 (0x02C0 - 0x02A8)
class UCCAttributeSummaryWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x02A8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCAttributeSummaryWidget");
		return ptr;
	}

};


// Class Indiana.CCCharacterCustomizationBaseWdgt
// 0x0098 (0x0340 - 0x02A8)
class UCCCharacterCustomizationBaseWdgt : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x98];                                      // 0x02A8(0x0098) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCCharacterCustomizationBaseWdgt");
		return ptr;
	}

};


// Class Indiana.CCCharacterSummaryPageWidget
// 0x0160 (0x0408 - 0x02A8)
class UCCCharacterSummaryPageWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x160];                                     // 0x02A8(0x0160) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCCharacterSummaryPageWidget");
		return ptr;
	}

};


// Class Indiana.CCFacialCustomizationWidget
// 0x0060 (0x03A0 - 0x0340)
class UCCFacialCustomizationWidget : public UCCCharacterCustomizationBaseWdgt
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0340(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCFacialCustomizationWidget");
		return ptr;
	}

};


// Class Indiana.CCFeaturesCustomizationWidget
// 0x0000 (0x0340 - 0x0340)
class UCCFeaturesCustomizationWidget : public UCCCharacterCustomizationBaseWdgt
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCFeaturesCustomizationWidget");
		return ptr;
	}

};


// Class Indiana.CCGenderSelectionWidget
// 0x0040 (0x02E8 - 0x02A8)
class UCCGenderSelectionWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x02A8(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCGenderSelectionWidget");
		return ptr;
	}

};


// Class Indiana.CCNameSelectionWidget
// 0x0050 (0x02F8 - 0x02A8)
class UCCNameSelectionWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x02A8(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCNameSelectionWidget");
		return ptr;
	}

};


// Class Indiana.CCPerksPageWidget
// 0x0178 (0x0420 - 0x02A8)
class UCCPerksPageWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x178];                                     // 0x02A8(0x0178) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCPerksPageWidget");
		return ptr;
	}

};


// Class Indiana.CharacterSkillsBasePage
// 0x0130 (0x03D8 - 0x02A8)
class UCharacterSkillsBasePage : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x130];                                     // 0x02A8(0x0130) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterSkillsBasePage");
		return ptr;
	}

};


// Class Indiana.CCSkillsPageWidget
// 0x0080 (0x0458 - 0x03D8)
class UCCSkillsPageWidget : public UCharacterSkillsBasePage
{
public:
	unsigned char                                      UnknownData00[0x80];                                      // 0x03D8(0x0080) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCSkillsPageWidget");
		return ptr;
	}


	void STATIC_OnUserScrolled(float ScrollAmount);
};


// Class Indiana.CCSkillsSummaryCategoryWidget
// 0x0018 (0x02C0 - 0x02A8)
class UCCSkillsSummaryCategoryWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x02A8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCSkillsSummaryCategoryWidget");
		return ptr;
	}

};


// Class Indiana.CCSkillsSummaryListWidget
// 0x0010 (0x02B8 - 0x02A8)
class UCCSkillsSummaryListWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x02A8(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCSkillsSummaryListWidget");
		return ptr;
	}

};


// Class Indiana.CCSkillSummaryDetailWidget
// 0x0020 (0x02C8 - 0x02A8)
class UCCSkillSummaryDetailWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x02A8(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCSkillSummaryDetailWidget");
		return ptr;
	}

};


// Class Indiana.CCSkillSummaryWidget
// 0x0008 (0x02B0 - 0x02A8)
class UCCSkillSummaryWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x02A8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CCSkillSummaryWidget");
		return ptr;
	}

};


// Class Indiana.Chair
// 0x0038 (0x03D0 - 0x0398)
class AChair : public AFurnitureActor
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0398(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Chair");
		return ptr;
	}

};


// Class Indiana.CharacterCreationData
// 0x0020 (0x0058 - 0x0038)
class UCharacterCreationData : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0038(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterCreationData");
		return ptr;
	}

};


// Class Indiana.CharacterCreationMasterWidget
// 0x0100 (0x03B0 - 0x02B0)
class UCharacterCreationMasterWidget : public UIndianaInterfaceUserWidget
{
public:
	unsigned char                                      UnknownData00[0x100];                                     // 0x02B0(0x0100) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterCreationMasterWidget");
		return ptr;
	}


	void STATIC_PlayPartTwoOutroMovie(bool bWasSkipped);
	void STATIC_OnPageBack();
	void STATIC_OnOutroMovieTwoComplete(bool bWasSkipped);
	void STATIC_OnOutroMovieStarted();
	void STATIC_OnOutroMoviePartTwoComplete(bool bWasSkipped);
	void STATIC_OnOutroMoviePartOneComplete(bool bWasSkipped);
	void STATIC_OnIntroMovieCompleteImpl(bool bWasSkipped);
	void STATIC_OnIntroMovieComplete(bool bWasSkipped);
	void STATIC_OnIntroAnimSequenceComplete();
	void STATIC_OnFadeOutContents();
	void STATIC_OnFadeInContents();
	void STATIC_OnCharacterCreationUIStart();
};


// Class Indiana.DeathClass
// 0x00F0 (0x0120 - 0x0030)
class UDeathClass : public UObject
{
public:
	unsigned char                                      UnknownData00[0xF0];                                      // 0x0030(0x00F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.DeathClass");
		return ptr;
	}


	void STATIC_Tick(float Delta);
	class UAkAudioEvent* FindAudioEvent(const struct FGameplayTag& DeathAudioEvent);
	void STATIC_FindAndPostAudioEvent(const struct FGameplayTag& DeathAudioEvent);
	void STATIC_ExecuteOnReload(class UCharacterDeathComponent* InDeathComponent);
	void STATIC_Execute(class UCharacterDeathComponent* InDeathComponent);
};


// Class Indiana.DeathComponent
// 0x0018 (0x0130 - 0x0118)
class UDeathComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0118(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.DeathComponent");
		return ptr;
	}


	void STATIC_DeathComplete();
};


// Class Indiana.CharacterDeathComponent
// 0x01C0 (0x02F0 - 0x0130)
class UCharacterDeathComponent : public UDeathComponent
{
public:
	unsigned char                                      UnknownData00[0x1C0];                                     // 0x0130(0x01C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterDeathComponent");
		return ptr;
	}


	void STATIC_StoreDeathImpact(const struct FVector& Impulse, const struct FVector& Location, const struct FName& BoneName);
	class UMaterialInstanceDynamic* SpawnAshPile(class UStaticMesh* Mesh, class UMaterialInterface* LootablePileMaterial);
	void STATIC_RagdollCharacter(bool bIgnoreDeathMontages);
	void STATIC_OnMontageEnded(class UAnimMontage* Montage, bool bInterrupted);
	void STATIC_HideProps();
	void STATIC_HideAppearanceMeshes();
	void STATIC_GibCharacter();
	void STATIC_DetachImpactFx();
	struct FVector CalcImpactVector();
	void STATIC_BreakBone();
	void STATIC_BreakAllBones();
	void STATIC_AttachGoreCaps();
	void STATIC_AttachAllGoreCaps();
};


// Class Indiana.CharacterDeathImpulse
// 0x0008 (0x0040 - 0x0038)
class UCharacterDeathImpulse : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterDeathImpulse");
		return ptr;
	}

};


// Class Indiana.CharacterDeathData
// 0x0030 (0x0068 - 0x0038)
class UCharacterDeathData : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0038(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterDeathData");
		return ptr;
	}

};


// Class Indiana.CharacterDerivedStatsWidget
// 0x0078 (0x0320 - 0x02A8)
class UCharacterDerivedStatsWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x78];                                      // 0x02A8(0x0078) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterDerivedStatsWidget");
		return ptr;
	}

};


// Class Indiana.LedgerDescriptionPanel
// 0x0020 (0x02C8 - 0x02A8)
class ULedgerDescriptionPanel : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x02A8(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.LedgerDescriptionPanel");
		return ptr;
	}

};


// Class Indiana.CharacterDescriptionPanel
// 0x0048 (0x0310 - 0x02C8)
class UCharacterDescriptionPanel : public ULedgerDescriptionPanel
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x02C8(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterDescriptionPanel");
		return ptr;
	}

};


// Class Indiana.CharacterDetailsWidget
// 0x0038 (0x02E0 - 0x02A8)
class UCharacterDetailsWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x02A8(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterDetailsWidget");
		return ptr;
	}

};


// Class Indiana.CharacterInfoComponent
// 0x02C0 (0x03D8 - 0x0118)
class UCharacterInfoComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x2C0];                                     // 0x0118(0x02C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterInfoComponent");
		return ptr;
	}


	void STATIC_UnlockPerksWithRandomLevels_Debug();
	void STATIC_SetLevel(int NewLevel);
	void STATIC_PerkRemove(const class FString& PerkName);
	void STATIC_PerkPurchase(const class FString& PerkName);
	void STATIC_PerkPointsAdd(int Value);
	void STATIC_OnWeaponEndUnequip(class UWeapon* Weapon);
	void STATIC_OnWeaponEndEquip(class UWeapon* Weapon);
	void STATIC_OnStatUpdated(class URpgStat* Stat);
	void STATIC_OnCompanionRegistered(class AIndianaAiCharacter* Companion, bool bRegister);
	class FString GetName();
	int GetLevelScaledByWorld();
	int GetLevelScaledAtLocation(const struct FVector& Location);
	int GetLevel();
	EGender GetGender();
	ECreatureXPType GetCreatureXPType();
};


// Class Indiana.InventoryComponent
// 0x0120 (0x0238 - 0x0118)
class UInventoryComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x120];                                     // 0x0118(0x0120) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.InventoryComponent");
		return ptr;
	}


	bool TransferItemsBetweenActorsByTag(class AActor* SourceActor, class AActor* DestinationActor, const struct FGameplayTagContainer& MatchTags, int Count, bool bPotentialTheft);
	void STATIC_ShowItemRemovedNotification(class UClass* ItemType, int Count);
	void STATIC_ShowItemGainedNotification(class UClass* ItemType, int Count);
	bool RemoveItemsFromActorByTag(class AActor* Actor, const struct FGameplayTagContainer& MatchTags, int Count);
	bool RemoveItemFromActor(class AActor* Actor, class UClass* ItemType, int Count);
	void STATIC_RemoveCurrency(int Amount, bool bVendorInteraction);
	bool IsEmpty();
	bool HasItemCountOnActorByTag(class AActor* Actor, const struct FGameplayTagContainer& MatchTags, int Count);
	bool HasItemCountOnActor(class AActor* Actor, class UClass* ItemType, int Count);
	int GetItemCountOnActor(class AActor* Actor, class UClass* ItemType);
	void STATIC_DebugCreateInventory(int NumToAddPerItem, int Skip);
	bool ContainsLoot();
	void STATIC_AddLootFromTable(class ULootTableData* LootTable);
	void STATIC_AddItemToActor(class AActor* Actor, class UClass* ItemType, int Count, bool bLootable);
	void STATIC_AddItemDebug(const struct FName& ItemName, uint32_t Count);
	void STATIC_AddCurrency(int Amount, bool bLootable);
};


// Class Indiana.CharacterInventoryComponent
// 0x0038 (0x0270 - 0x0238)
class UCharacterInventoryComponent : public UInventoryComponent
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0238(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterInventoryComponent");
		return ptr;
	}

};


// Class Indiana.CharacterMedKitWidget
// 0x00D0 (0x0378 - 0x02A8)
class UCharacterMedKitWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0xD0];                                      // 0x02A8(0x00D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterMedKitWidget");
		return ptr;
	}


	void STATIC_UpdateDrugSlots(int ConsumablesUsed);
	void STATIC_OnInventoryItemAddedRemoved(const struct FItemStack& ItemStack);
	void STATIC_OnHealthChanged(float HealthChange, class AActor* InInstigator);
	void STATIC_InhalerModeChanged(int NewSetting);
	void STATIC_AbilityControlModeChanged(int NewSetting);
};


// Class Indiana.CharacterNameplateWidget
// 0x0018 (0x02C0 - 0x02A8)
class UCharacterNameplateWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x02A8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterNameplateWidget");
		return ptr;
	}


	void STATIC_OnLevelChanged(int NewLevel);
};


// Class Indiana.CharacterOverviewWidget
// 0x01F8 (0x04A0 - 0x02A8)
class UCharacterOverviewWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x1F8];                                     // 0x02A8(0x01F8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterOverviewWidget");
		return ptr;
	}


	void STATIC_OnTTDDisplayModeChanged(int TTDDisplayModeIn);
	void STATIC_OnSurvivalModeChanged(bool bSurvivalBarVisibilityIn);
	void STATIC_OnSkillUpdated(ESkill Skill, int NewValue);
	void STATIC_OnPreventTTDChanged(bool bPreventTTD);
	void STATIC_OnPlayerStatusBarModeChanged(int ModeIn);
	void STATIC_OnPlayerCombatStateChange(bool IsPlayerInCombat);
	void STATIC_OnInhalerModeChanged(int InhalerModeIn);
	void STATIC_OnHUDVisibilityChanged(bool bHUDVisibility);
	void STATIC_OnDodgeDisplayModeChanged(int DodgeDisplayModeIn);
	void STATIC_OnDodged(EDodgeDirection EDodgeDirection);
	void STATIC_OnDifficultyChanged(EGameDifficulty DifficultyIn);
	void STATIC_OnCombatStateChange(bool bCombatIn, bool bRestoring);
	void STATIC_OnAbilityControlModeChanged(int AbilityControlModeIn);
	void STATIC_HideTTDMeter(bool bHide);
};


// Class Indiana.CharacterLibrary
// 0x0000 (0x0030 - 0x0030)
class UCharacterLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterLibrary");
		return ptr;
	}


	int GetSkillValue(class AActor* Actor, ESkill Skill);
	int GetAttributeValue(class AActor* Actor, EAttribute Attribute);
};


// Class Indiana.CharacterScalingComponent
// 0x0000 (0x0118 - 0x0118)
class UCharacterScalingComponent : public UActorComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterScalingComponent");
		return ptr;
	}

};


// Class Indiana.ShoutComponent
// 0x0020 (0x0138 - 0x0118)
class UShoutComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0118(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ShoutComponent");
		return ptr;
	}

};


// Class Indiana.CharacterShoutComponent
// 0x0060 (0x0198 - 0x0138)
class UCharacterShoutComponent : public UShoutComponent
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0138(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterShoutComponent");
		return ptr;
	}


	void STATIC_OnCombatStateChange(bool bIsInCombat, bool bRestoring);
	void STATIC_OnCharacterDeath(const struct FCauseDamageInfo& CDI);
	void STATIC_OnAlertStateChange(class AActor* TargetActor, EAlertState PreviousAlertState, EAlertState TargetAlertState, bool bRestoring);
};


// Class Indiana.CharacterSkillsDescriptionPanel
// 0x0010 (0x0320 - 0x0310)
class UCharacterSkillsDescriptionPanel : public UCharacterDescriptionPanel
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0310(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterSkillsDescriptionPanel");
		return ptr;
	}

};


// Class Indiana.CharacterStatusEffectsWidget
// 0x0038 (0x02E0 - 0x02A8)
class UCharacterStatusEffectsWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x02A8(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CharacterStatusEffectsWidget");
		return ptr;
	}


	void STATIC_OnRemoveStatusEffect(class UStatusEffectManagerComponent* Sender, class UStatusEffect* StatusEffect);
	void STATIC_OnAddStatusEffect(class UStatusEffectManagerComponent* Sender, class UStatusEffect* StatusEffect);
};


// Class Indiana.FlowChart
// 0x0088 (0x00B8 - 0x0030)
class UFlowChart : public UObject
{
public:
	unsigned char                                      UnknownData00[0x88];                                      // 0x0030(0x0088) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.FlowChart");
		return ptr;
	}

};


// Class Indiana.Chatter
// 0x0070 (0x0128 - 0x00B8)
class UChatter : public UFlowChart
{
public:
	unsigned char                                      UnknownData00[0x70];                                      // 0x00B8(0x0070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Chatter");
		return ptr;
	}

};


// Class Indiana.ChatterBundleSet
// 0x0018 (0x0050 - 0x0038)
class UChatterBundleSet : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0038(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ChatterBundleSet");
		return ptr;
	}

};


// Class Indiana.ChatterEventEffect
// 0x0008 (0x0038 - 0x0030)
class UChatterEventEffect : public UEventEffect
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ChatterEventEffect");
		return ptr;
	}

};


// Class Indiana.GameDataReference
// 0x0018 (0x0050 - 0x0038)
class UGameDataReference : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0038(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.GameDataReference");
		return ptr;
	}

};


// Class Indiana.ChatterEventsGameDataReference
// 0x0000 (0x0050 - 0x0050)
class UChatterEventsGameDataReference : public UGameDataReference
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ChatterEventsGameDataReference");
		return ptr;
	}

};


// Class Indiana.ChatterGameHelpers
// 0x0000 (0x0030 - 0x0030)
class UChatterGameHelpers : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ChatterGameHelpers");
		return ptr;
	}


	void STATIC_PlayChatterEvent(class AActor* Speaker, EChatterEventType ChatterEvent);
};


// Class Indiana.ChatterManager
// 0x6FD98 (0x6FDC8 - 0x0030)
class UChatterManager : public UObject
{
public:
	unsigned char                                      UnknownData00[0x6FD98];                                   // 0x0030(0x6FD98) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ChatterManager");
		return ptr;
	}


	void STATIC_OnConversationBegin(class UConversationInstance* ConversationInstance);
};


// Class Indiana.FlowChartPlayer
// 0x0090 (0x00C0 - 0x0030)
class UFlowChartPlayer : public UObject
{
public:
	unsigned char                                      UnknownData00[0x90];                                      // 0x0030(0x0090) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.FlowChartPlayer");
		return ptr;
	}

};


// Class Indiana.ChatterPlayer
// 0x00A8 (0x0168 - 0x00C0)
class UChatterPlayer : public UFlowChartPlayer
{
public:
	unsigned char                                      UnknownData00[0xA8];                                      // 0x00C0(0x00A8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ChatterPlayer");
		return ptr;
	}

};


// Class Indiana.CheckBoxWidget
// 0x0030 (0x02D8 - 0x02A8)
class UCheckBoxWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x02A8(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CheckBoxWidget");
		return ptr;
	}


	void STATIC_UpdateCheckBoxSize(int FontSizeModifier);
};


// Class Indiana.CineCombatCameraParams
// 0x0140 (0x0170 - 0x0030)
class UCineCombatCameraParams : public UObject
{
public:
	unsigned char                                      UnknownData00[0x140];                                     // 0x0030(0x0140) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CineCombatCameraParams");
		return ptr;
	}

};


// Class Indiana.CineCombatCamera
// 0x0050 (0x03D8 - 0x0388)
class ACineCombatCamera : public AActor
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0388(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CineCombatCamera");
		return ptr;
	}

};


// Class Indiana.CineCombatSequenceActor
// 0x0010 (0x0440 - 0x0430)
class ACineCombatSequenceActor : public ALevelSequenceActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0430(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CineCombatSequenceActor");
		return ptr;
	}

};


// Class Indiana.CineCombatSequencePlayer
// 0x0040 (0x08B0 - 0x0870)
class UCineCombatSequencePlayer : public ULevelSequencePlayer
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0870(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CineCombatSequencePlayer");
		return ptr;
	}

};


// Class Indiana.CinematicPlayerWidget
// 0x0040 (0x02F0 - 0x02B0)
class UCinematicPlayerWidget : public UIndianaInterfaceUserWidget
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x02B0(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CinematicPlayerWidget");
		return ptr;
	}


	void STATIC_SkipCinematic();
	void STATIC_PlayerInputDetected();
	void STATIC_PlayCinematic(class UMovieSceneSequencePlayer* Cinematic);
	void STATIC_PauseCinematic();
	void STATIC_InitiateFadeOut();
	void STATIC_InitiateFadeIn();
	void STATIC_FinishCinematic();
};


// Class Indiana.ClearThreatStatusEffect
// 0x0008 (0x0190 - 0x0188)
class UClearThreatStatusEffect : public UStatusEffect
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0188(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ClearThreatStatusEffect");
		return ptr;
	}

};


// Class Indiana.CodexDataAsset
// 0x0010 (0x0048 - 0x0038)
class UCodexDataAsset : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0038(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CodexDataAsset");
		return ptr;
	}

};


// Class Indiana.CodexJournal
// 0x00C8 (0x0370 - 0x02A8)
class UCodexJournal : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0xC8];                                      // 0x02A8(0x00C8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CodexJournal");
		return ptr;
	}


	void STATIC_OnAudioLogUnhoveredCB(class UButtonBase* ButtonUnhovered);
	void STATIC_OnAudioLogUnfocusedCB(class UButtonBase* ButtonUnfocused);
	void STATIC_OnAudioLogListEntryAdded(class UGenericCollapsableListEntry* ListEntry, class UAudioLogDataAsset* DataAsset);
	void STATIC_OnAudioLogHoveredCB(class UButtonBase* ButtonHovered);
	void STATIC_OnAudioLogFocusedCB(class UButtonBase* ButtonFocused);
};


// Class Indiana.ComboBoxStringBase
// 0x0A98 (0x0BB0 - 0x0118)
class UComboBoxStringBase : public UWidget
{
public:
	unsigned char                                      UnknownData00[0xA98];                                     // 0x0118(0x0A98) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ComboBoxStringBase");
		return ptr;
	}


	void STATIC_SetSelectedOption(const class FString& Option);
	bool RemoveOption(const class FString& Option);
	void STATIC_RefreshOptions();
	void STATIC_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, TEnumAsByte<ESelectInfo> SelectionType);
	void STATIC_OnOpeningEvent__DelegateSignature();
	int GetSelectedOptionIndex();
	class FString GetSelectedOption();
	int GetOptionCount();
	class FString GetOptionAtIndex(int Index);
	int FindOptionIndex(const class FString& Option);
	void STATIC_ClearSelection();
	void STATIC_ClearOptions();
	void STATIC_AddOption(const class FString& Option);
};


// Class Indiana.IndianaComboBoxWidgetStyle
// 0x08E0 (0x0918 - 0x0038)
class UIndianaComboBoxWidgetStyle : public USlateWidgetStyleContainerBase
{
public:
	unsigned char                                      UnknownData00[0x8E0];                                     // 0x0038(0x08E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.IndianaComboBoxWidgetStyle");
		return ptr;
	}

};


// Class Indiana.CommandPointWidget
// 0x0030 (0x02D8 - 0x02A8)
class UCommandPointWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x02A8(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CommandPointWidget");
		return ptr;
	}

};


// Class Indiana.CompanionBehaviorOptionWidget
// 0x0030 (0x02D8 - 0x02A8)
class UCompanionBehaviorOptionWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x02A8(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionBehaviorOptionWidget");
		return ptr;
	}

};


// Class Indiana.CompanionBehaviorsWidget
// 0x0038 (0x02E0 - 0x02A8)
class UCompanionBehaviorsWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x02A8(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionBehaviorsWidget");
		return ptr;
	}

};


// Class Indiana.CompanionCommandComponent
// 0x02D8 (0x03F0 - 0x0118)
class UCompanionCommandComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x2D8];                                     // 0x0118(0x02D8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionCommandComponent");
		return ptr;
	}


	void STATIC_OnStatUpdated(class URpgStat* Stat);
	void STATIC_OnCalledShotCameraStep(class AActor* Attacker, ECalledShotCameraStep OldCameraStep, ECalledShotCameraStep NewCameraStep, bool bCloseRange);
	void STATIC_FillMeter();
	void STATIC_CompanionCommandInfinite();
};


// Class Indiana.TimedBehaviorStateInfo
// 0x0008 (0x0128 - 0x0120)
class UTimedBehaviorStateInfo : public UEmpty_BehaviorStateInfo
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0120(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.TimedBehaviorStateInfo");
		return ptr;
	}

};


// Class Indiana.CompanionCommandTimedBehaviorStateInfo
// 0x0000 (0x0128 - 0x0128)
class UCompanionCommandTimedBehaviorStateInfo : public UTimedBehaviorStateInfo
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionCommandTimedBehaviorStateInfo");
		return ptr;
	}

};


// Class Indiana.CompanionCommandFlankBehaviorStateInfo
// 0x0000 (0x0128 - 0x0128)
class UCompanionCommandFlankBehaviorStateInfo : public UCompanionCommandTimedBehaviorStateInfo
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionCommandFlankBehaviorStateInfo");
		return ptr;
	}

};


// Class Indiana.CompanionCommandFlankRequestData
// 0x0000 (0x0068 - 0x0068)
class UCompanionCommandFlankRequestData : public UDecisionTreeEmptyRequestData
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionCommandFlankRequestData");
		return ptr;
	}

};


// Class Indiana.CompanionCommandMoveToBehaviorStateInfo
// 0x0008 (0x0180 - 0x0178)
class UCompanionCommandMoveToBehaviorStateInfo : public UEQS_BehaviorStateInfo
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0178(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionCommandMoveToBehaviorStateInfo");
		return ptr;
	}

};


// Class Indiana.CompanionCommandMoveToRequestData
// 0x0000 (0x0080 - 0x0080)
class UCompanionCommandMoveToRequestData : public UDecisionTreeEQSRequestData
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionCommandMoveToRequestData");
		return ptr;
	}

};


// Class Indiana.CompanionCommandSuppressBehaviorStateInfo
// 0x0000 (0x0128 - 0x0128)
class UCompanionCommandSuppressBehaviorStateInfo : public UCompanionCommandTimedBehaviorStateInfo
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionCommandSuppressBehaviorStateInfo");
		return ptr;
	}

};


// Class Indiana.CompanionCommandSuppressRequestData
// 0x0000 (0x0068 - 0x0068)
class UCompanionCommandSuppressRequestData : public UDecisionTreeEmptyRequestData
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionCommandSuppressRequestData");
		return ptr;
	}

};


// Class Indiana.CompanionComponent
// 0x0150 (0x0268 - 0x0118)
class UCompanionComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x150];                                     // 0x0118(0x0150) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionComponent");
		return ptr;
	}


	void STATIC_UpdateCompanionState();
	void STATIC_SetOffering(class UClass* PickupClass);
	void STATIC_OnPlayerExitedAcknowledgeZone(class AActor* ZoneOwner);
	void STATIC_OnPlayerEnteredAcknowledgeZone(class AActor* ZoneOwner);
	void STATIC_OnCombatStateChange(bool bIsInCombat, bool bRestoring);
	void STATIC_DropOffering();
};


// Class Indiana.CompanionDetails
// 0x0018 (0x02C0 - 0x02A8)
class UCompanionDetails : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x02A8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionDetails");
		return ptr;
	}

};


// Class Indiana.CompanionEntryWidget
// 0x0040 (0x02E8 - 0x02A8)
class UCompanionEntryWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x02A8(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionEntryWidget");
		return ptr;
	}

};


// Class Indiana.CompanionEquipmentBarWidget
// 0x0170 (0x0418 - 0x02A8)
class UCompanionEquipmentBarWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x170];                                     // 0x02A8(0x0170) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionEquipmentBarWidget");
		return ptr;
	}

};


// Class Indiana.CompanionEquipmentWidget
// 0x01A8 (0x04F0 - 0x0348)
class UCompanionEquipmentWidget : public UBaseInventoryItemManagement
{
public:
	unsigned char                                      UnknownData00[0x1A8];                                     // 0x0348(0x01A8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionEquipmentWidget");
		return ptr;
	}


	void STATIC_OnItemRemovedFromPlayerInventory(const struct FItemStack& ItemStack);
	void STATIC_OnItemAddedToPlayerInventory(const struct FItemStack& ItemStack);
	void STATIC_OnDragDrop_EquipItem(class UIndianaDragDropOperation* Operation);
};


// Class Indiana.CompanionFollowBehaviorStateInfo
// 0x0018 (0x0138 - 0x0120)
class UCompanionFollowBehaviorStateInfo : public UEmpty_BehaviorStateInfo
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0120(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionFollowBehaviorStateInfo");
		return ptr;
	}

};


// Class Indiana.CompanionFollowRequestData
// 0x0008 (0x0070 - 0x0068)
class UCompanionFollowRequestData : public UDecisionTreeEmptyRequestData
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0068(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionFollowRequestData");
		return ptr;
	}

};


// Class Indiana.CompanionManager
// 0x0200 (0x0230 - 0x0030)
class UCompanionManager : public UObject
{
public:
	unsigned char                                      UnknownData00[0x200];                                     // 0x0030(0x0200) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionManager");
		return ptr;
	}


	void STATIC_SetCompanionWantsToTalk(ESpecialObsidianID Companion, bool bWantsToTalk);
	bool IsCompanionUnlocked(ESpecialObsidianID Companion);
	bool IsCompanionInRequestedParty(ESpecialObsidianID Companion);
	bool IsCompanionInActiveParty(ESpecialObsidianID Companion);
	bool IsCompanionDismissed(ESpecialObsidianID Companion);
	bool HasPlayerUnlockedCompanions();
	bool GetCompanionWantsToTalk(ESpecialObsidianID Companion);
	float GetCompanionMorale(ESpecialObsidianID Companion);
	struct FGuid GetCompanionGuid(ESpecialObsidianID SpecialID);
	void STATIC_DebugUnlockCompanion(ESpecialObsidianID Companion);
	void STATIC_DebugAddCompanionMorale(unsigned char Companion, float MoraleAmount, bool bPositiveMorale);
	void STATIC_ChangeCompanionMorale(ESpecialObsidianID Companion, EMoraleContribution Contribution, float MoraleAmount, bool bPositiveMorale, bool bOnlyActivePartyMembers);
};


// Class Indiana.CompanionManagerComponent
// 0x00B0 (0x01C8 - 0x0118)
class UCompanionManagerComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0xB0];                                      // 0x0118(0x00B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionManagerComponent");
		return ptr;
	}


	void STATIC_SetCompanionOutlineMode(ECompanionOutlineMode OutlineMode);
	void STATIC_SendCharacterToShip(class AIndianaAiCharacter* Companion);
	void STATIC_ScriptRemoveCompanionFromParty(class AIndianaAiCharacter* Companion);
	void STATIC_ScriptAddCompanionToParty(class AIndianaAiCharacter* Companion);
	void STATIC_OnRestartController(class AIndianaAiCharacter* Character);
	void STATIC_OnPlayerLevelChanged(int PlayerLevel);
	void STATIC_OnPlayerIndividualDetected(class AIndianaAiCharacter* Detector);
	void STATIC_OnPlayerCinematicModeChanged(bool bCinematicModeEnabled);
	void STATIC_OnNewStateOfBeing(EStateOfBeing NewStateOfBeing, EStateOfBeing OldStateOfBeing);
	void STATIC_OnKill(class AActor* Victim, const struct FCauseDamageInfo& CauseDamageInfo);
	void STATIC_OnDifficultyChanged(EGameDifficulty NewDifficulty);
	void STATIC_OnDeath(const struct FCauseDamageInfo& DamageInfo);
	void STATIC_OnCauseDamage(const struct FCauseDamageInfo& CauseDamageInfo);
	bool IsPartyFull();
	class AIndianaAiCharacter* GetCompanionFromSlot(ECompanionSlot Slot);
	class AIndianaAiCharacter* GetActiveCompanionWithSpecialID(ESpecialObsidianID SpecialID);
	void STATIC_DebugKillCompanions();
	void STATIC_AddPerkPointsToCompanions(int Points);
};


// Class Indiana.CompanionMeterStatusEffect
// 0x0008 (0x0190 - 0x0188)
class UCompanionMeterStatusEffect : public UStatusEffect
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0188(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionMeterStatusEffect");
		return ptr;
	}

};


// Class Indiana.CompanionMoraleEvent
// 0x0028 (0x0058 - 0x0030)
class UCompanionMoraleEvent : public UObject
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0030(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionMoraleEvent");
		return ptr;
	}

};


// Class Indiana.CompanionMoraleStatusEffect
// 0x0010 (0x0198 - 0x0188)
class UCompanionMoraleStatusEffect : public UStatusEffect
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0188(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionMoraleStatusEffect");
		return ptr;
	}

};


// Class Indiana.CompanionMoveToWidget
// 0x0008 (0x02B0 - 0x02A8)
class UCompanionMoveToWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x02A8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionMoveToWidget");
		return ptr;
	}


	void STATIC_OnNewLocation();
	void STATIC_OnMoveToCancelled();
};


// Class Indiana.CompanionMoveToWidgetComponent
// 0x0020 (0x07A0 - 0x0780)
class UCompanionMoveToWidgetComponent : public UIndianaWidgetComponent
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0780(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionMoveToWidgetComponent");
		return ptr;
	}

};


// Class Indiana.CompanionOverviewWidget
// 0x00C0 (0x0368 - 0x02A8)
class UCompanionOverviewWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0xC0];                                      // 0x02A8(0x00C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionOverviewWidget");
		return ptr;
	}


	void STATIC_OnNoStatusEffect();
	void STATIC_OnMadeInactive();
	void STATIC_OnMadeActive();
	void STATIC_OnHUDVisibilityChanged(bool bVisible);
	void STATIC_OnFirstStatusEffect();
	void STATIC_OnCompanionStatusModeChanged(int ModeIn);
	void STATIC_OnCombatStateChanged(bool bCombatIn, bool bRestoring);
};


// Class Indiana.CompanionPerksWidget
// 0x00B8 (0x0360 - 0x02A8)
class UCompanionPerksWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0xB8];                                      // 0x02A8(0x00B8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionPerksWidget");
		return ptr;
	}

};


// Class Indiana.CompanionPositionComponent
// 0x0178 (0x0290 - 0x0118)
class UCompanionPositionComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x178];                                     // 0x0118(0x0178) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionPositionComponent");
		return ptr;
	}


	void STATIC_RequestForceTeleportCompanions(const struct FVector& Position1, const struct FVector& Position2);
	void STATIC_OnStealthChange(bool bStealthed);
	void STATIC_OnPlayerConversationChange(class UConversationInstance* Instance, bool bEntered);
	void STATIC_OnOccupiedElevatorMove(class AElevator* Elevator);
	void STATIC_OnOccupiedElevatorChange(class AElevator* Elevator, bool bOccupied);
};


// Class Indiana.CompanionPositionData
// 0x0048 (0x0078 - 0x0030)
class UCompanionPositionData : public UObject
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x0030(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionPositionData");
		return ptr;
	}

};


// Class Indiana.CompanionScreenWrapperWidget
// 0x0040 (0x02F0 - 0x02B0)
class UCompanionScreenWrapperWidget : public UIndianaInterfaceUserWidget
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x02B0(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionScreenWrapperWidget");
		return ptr;
	}


	void STATIC_FadeInSharedItemViewer();
	void STATIC_AddItemToItemViewer(const struct FItemStack& ItemStack);
};


// Class Indiana.CompanionSelectionWidget
// 0x00A8 (0x0358 - 0x02B0)
class UCompanionSelectionWidget : public UIndianaInterfaceUserWidget
{
public:
	unsigned char                                      UnknownData00[0xA8];                                      // 0x02B0(0x00A8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionSelectionWidget");
		return ptr;
	}


	void STATIC_SetCharacterSelected(int CharacterIndex, bool bSelected);
	void STATIC_SetCharacterAvailable(int CharacterIndex, bool bUsable);
	void STATIC_SelectionFailed(int CharacterIndex);
};


// Class Indiana.CompanionSkillSummary
// 0x0058 (0x0300 - 0x02A8)
class UCompanionSkillSummary : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x02A8(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionSkillSummary");
		return ptr;
	}

};


// Class Indiana.CompanionStatSummary
// 0x0048 (0x02F0 - 0x02A8)
class UCompanionStatSummary : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x02A8(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionStatSummary");
		return ptr;
	}

};


// Class Indiana.CompanionStatsWidget
// 0x00B0 (0x0358 - 0x02A8)
class UCompanionStatsWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0xB0];                                      // 0x02A8(0x00B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionStatsWidget");
		return ptr;
	}

};


// Class Indiana.CompanionsWidget
// 0x00B0 (0x0358 - 0x02A8)
class UCompanionsWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0xB0];                                      // 0x02A8(0x00B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompanionsWidget");
		return ptr;
	}

};


// Class Indiana.CompassEntryData
// 0x0050 (0x0088 - 0x0038)
class UCompassEntryData : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0038(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompassEntryData");
		return ptr;
	}

};


// Class Indiana.CompassEntryWidget
// 0x0028 (0x0248 - 0x0220)
class UCompassEntryWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0220(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompassEntryWidget");
		return ptr;
	}


	void STATIC_InitProperties(const struct FEntryData& EntryData);
};


// Class Indiana.CompassWidget
// 0x0DF0 (0x1098 - 0x02A8)
class UCompassWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0xDF0];                                     // 0x02A8(0x0DF0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompassWidget");
		return ptr;
	}


	void STATIC_OnHUDVisibilityChanged(bool bHUDVisible);
	void STATIC_OnEnemyRemoved(class AIndianaAiCharacter* Detector);
	void STATIC_OnEnemyAdded(class AIndianaAiCharacter* Detector);
	void STATIC_OnCompassSettingChanged(int CompassVisibilityModeIn);
};


// Class Indiana.CompensateForTTDStatusEffect
// 0x0018 (0x01A0 - 0x0188)
class UCompensateForTTDStatusEffect : public UStatusEffect
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0188(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.CompensateForTTDStatusEffect");
		return ptr;
	}

};


// Class Indiana.ComponentDebugInterface
// 0x0000 (0x0030 - 0x0030)
class UComponentDebugInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ComponentDebugInterface");
		return ptr;
	}

};


// Class Indiana.ComputerTerminal
// 0x0178 (0x0500 - 0x0388)
class AComputerTerminal : public AActor
{
public:
	unsigned char                                      UnknownData00[0x178];                                     // 0x0388(0x0178) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ComputerTerminal");
		return ptr;
	}


	void STATIC_UnlockComputer(bool bFireComputerUnlockedEvent);
	void STATIC_LockComputer(bool bFireComputerLockedEvent);
	unsigned char GetExactHackDifficulty();
	EComputerLockState GetCurrentState();
	EComputerTerminalResult AttemptUse(class AActor* Initiator, bool bForce);
	EComputerTerminalResult AttemptUnlock(class AActor* Initiator);
};


// Class Indiana.InteractableAudioComponent
// 0x0070 (0x0188 - 0x0118)
class UInteractableAudioComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x70];                                      // 0x0118(0x0070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.InteractableAudioComponent");
		return ptr;
	}


	void STATIC_StopCustomEventEffect(const struct FName& Name);
	void STATIC_PlayCustomEventEffect(const struct FName& Name);
};


// Class Indiana.ComputerTerminalAudioComponent
// 0x0050 (0x01D8 - 0x0188)
class UComputerTerminalAudioComponent : public UInteractableAudioComponent
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0188(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ComputerTerminalAudioComponent");
		return ptr;
	}


	void STATIC_Stop(EComputerTerminalEventType Type);
	void STATIC_Play(EComputerTerminalEventType Type);
};


// Class Indiana.ComputerTerminalContainerWidget
// 0x0028 (0x02D0 - 0x02A8)
class UComputerTerminalContainerWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x02A8(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ComputerTerminalContainerWidget");
		return ptr;
	}


	void STATIC_OnConversationStateChange(bool bHasStarted);
};


// Class Indiana.ComputerTerminalHeaderData
// 0x0080 (0x00B8 - 0x0038)
class UComputerTerminalHeaderData : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x80];                                      // 0x0038(0x0080) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ComputerTerminalHeaderData");
		return ptr;
	}

};


// Class Indiana.ComputerTerminalHeaderWidget
// 0x00E0 (0x0388 - 0x02A8)
class UComputerTerminalHeaderWidget : public UIndianaUserWidget
{
public:
	unsigned char                                      UnknownData00[0xE0];                                      // 0x02A8(0x00E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ComputerTerminalHeaderWidget");
		return ptr;
	}


	void STATIC_FadeInLogoImage();
};


// Class Indiana.ConversationBaseWidget
// 0x0058 (0x0308 - 0x02B0)
class UConversationBaseWidget : public UIndianaInterfaceUserWidget
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x02B0(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ConversationBaseWidget");
		return ptr;
	}


	void STATIC_OnSkipInputAction();
	void STATIC_OnResponse9InputAction();
	void STATIC_OnResponse8InputAction();
	void STATIC_OnResponse7InputAction();
	void STATIC_OnResponse6InputAction();
	void STATIC_OnResponse5InputAction();
	void STATIC_OnResponse4InputAction();
	void STATIC_OnResponse3InputAction();
	void STATIC_OnResponse2InputAction();
	void STATIC_OnResponse1InputAction();
	void STATIC_OnPauseInputAction();
};


// Class Indiana.ComputerTerminalWidget
// 0x00A8 (0x03B0 - 0x0308)
class UComputerTerminalWidget : public UConversationBaseWidget
{
public:
	unsigned char                                      UnknownData00[0xA8];                                      // 0x0308(0x00A8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ComputerTerminalWidget");
		return ptr;
	}


	void STATIC_OnExitInputAction();
	void STATIC_OnConversationEnded();
};


// Class Indiana.ComputerTerminalWidgetComponent
// 0x0000 (0x0780 - 0x0780)
class UComputerTerminalWidgetComponent : public UIndianaWidgetComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ComputerTerminalWidgetComponent");
		return ptr;
	}


	void STATIC_OnOwnerStateChange(EComputerLockState PreviousState, EComputerLockState CurrentState);
};


// Class Indiana.Conditionals
// 0x0000 (0x0030 - 0x0030)
class UConditionals : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Conditionals");
		return ptr;
	}


	bool PlayerHasPerk(const class FString& Perk);
	bool PlayerHasFlaw(const class FString& Flaw);
	bool IsWeaponEquipped(const class FString& Weapon, bool bIncludeDerivedClasses);
	bool IsTrapStateEqual(const struct FGuid& TrapObjectID, ETrapTriggerState State);
	bool IsTimeSlice(int StartHour, int EndHour);
	bool IsSpeakerGender(EGender Gender);
	bool IsSpeaker(const struct FGuid& SpeakerID);
	bool IsRestrictedAreaEnabled(const struct FGuid& RestrictedAreaID);
	bool IsQuestTracked(const struct FGuid& QuestID);
	bool IsQuestStateVisited(const struct FGuid& QuestID, int NodeID);
	bool IsQuestStateActive(const struct FGuid& QuestID, int NodeID);
	bool IsQuestStarted(const struct FGuid& QuestID);
	bool IsQuestMentioned(const struct FGuid& QuestID);
	bool IsQuestionNodeOnResponseBranch(int QuestionNodeID, int PlayerResponseNodeID);
	bool IsQuestEventTriggered(const struct FGuid& QuestID, int QuestEventID);
	bool IsQuestEndStateTriggered(const struct FGuid& QuestID, int EndStateID);
	bool IsQuestComplete(const struct FGuid& QuestID);
	bool IsQuestAddendumTriggered(const struct FGuid& QuestID, int AddendumID);
	bool IsQuestActive(const struct FGuid& QuestID);
	bool IsPlayerTravelDestinationLocked(const class FString& TravelDestination);
	bool IsPlayerTravelDestinationHidden(const class FString& TravelDestination);
	bool IsPlayerSkillValue(ESkill Skill, EComparisonOperator Operator, int SkillValue, bool bUseCompanionInterjection, bool bPermanentOnly);
	bool IsPlayerSkillLevelScaled(ESkill Skill, EComparisonOperator Operator, ECharacterSkillRange SkillRange, int LevelOverride, bool bUseCompanionInterjection);
	bool IsPlayerSkill(ESkill Skill, EComparisonOperator Operator, ECharacterSkillRange SkillRange, bool bUseCompanionInterjection);
	bool IsPlayerShipCurrentAt(const class FString& ShipDestination);
	bool IsPlayerInStealth();
	bool IsPlayerInCombat();
	bool IsPlayerDisguisedAs(const class FString& Faction);
	bool IsPlayerAwareOfTravelDestination(const class FString& TravelDestination);
	bool IsPlayerAwareOfRegion(const class FString& TravelRegion);
	bool IsPlayerAwareOfPointOfInterest(const class FString& PointOfInterestData);
	bool IsPlayerAttribute(EAttribute Attribute, EComparisonOperator Operator, ECharacterAttributeRange AttributeRange);
	bool IsPhaseOfDay(EPhaseOfDay Phase);
	bool IsPartyFull();
	bool IsOCLStateEqual(const struct FGuid& OCLObjectID, EOCLState State);
	bool IsItemQuantity(const class FString& Item, EComparisonOperator Operator, int Quantity);
	bool IsInterrogationsPassedCount(EComparisonOperator Operator, int Count);
	bool IsInterrogationInRestrictedArea();
	bool IsInterrogationDisguised();
	bool IsInterrogationCrime(ECrimeType Crime);
	bool IsInMap(const class FString& MapID);
	bool IsGlobalValue(const class FString& VariableName, EComparisonOperator Operator, int Value);
	bool IsFactionReputationRankType(const class FString& Faction, EReputationRankType ReputationRankType, EComparisonOperator Operator);
	bool IsFactionReputationRank(const class FString& Faction, EReputationRankType ReputationRankType, int Rank, EComparisonOperator Operator);
	bool IsFactionRelationship(const class FString& Faction, TEnumAsByte<ETeamAttitude> AttitudeType);
	bool IsCurrentActiveCompanionAmount(EComparisonOperator Operator, int Quantity);
	bool IsCompanionUnlocked(ESpecialObsidianID CompanionID);
	bool IsCompanionMoral(ESpecialObsidianID CompanionID, EComparisonOperator Operator, float MoralAmount);
	bool IsCompanionDismissed(ESpecialObsidianID CompanionID);
	bool IsCompanionActiveInParty(const struct FGuid& CompanionID);
	bool IsCharacterGrouping(ECharacterGrouping CharacterGrouping);
	bool IsArmorEquipped(const class FString& ArmorItem, bool bIncludeDerivedClasses);
	bool IsAnyArmorEquipped();
	bool HaveMinutesElapsedSinceNamedTimestamp(const class FString& TimestampName, int Minutes);
	bool HaveHoursElapsedSinceNamedTimestamp(const class FString& TimestampName, int Hours);
	bool HaveDaysElapsedSinceNamedTimestamp(const class FString& TimestampName, int Days);
	bool HasQuestStateFailed(const struct FGuid& QuestID, int NodeID);
	bool HasQuestFailed(const struct FGuid& QuestID);
	bool HasPlayerVisitedTravelDestination(const class FString& TravelDestination);
	bool HasPlayerVisitedRegion(const class FString& TravelRegion);
	bool HasPlayerOnlyHeardAboutPointOfInterest(const class FString& PointOfInterestData);
	bool HasPlayerDiscoveredPointOfInterest(const class FString& PointOfInterestData);
	bool HasItemValue(const class FString& VariableName, const class FString& Item);
	bool HasItemsByTag(const class FString& GameplayTag, EComparisonOperator Operator, int Quantity);
	bool HasItem(const class FString& Item);
	bool HasDLC(EDownLoadableContent DLC);
	bool HasConversationNodeBeenVisited(const struct FGuid& ConversationID, int NodeID);
	void STATIC_GetOCLState(const struct FGuid& OCLObjectID, EOCLState* State, EBoolResult* Result);
	int GetGlobalValue(const class FString& VariableName);
	bool DoesConversationNodePass(const struct FGuid& ConversationID, int NodeID);
	bool CompareGlobals(const class FString& VariableName1, EComparisonOperator Operator, const class FString& VariableName2);
	bool CompanionWantsToTalk(ESpecialObsidianID CompanionID);
	bool CompanionHasPerk(const struct FGuid& CompanionID, const class FString& Perk);
	bool CanPlayerSafelyTakePickup(const struct FGuid& PickupID);
	bool CanPlayerSafelyTakeItemTypeInContainer(const struct FGuid& ContainerID, const class FString& Item);
	bool CanPlayerReadRedactions();
	bool CanPlayerDiscoverPointOfInterest(const class FString& PointOfInterestData);
	bool CanPlayerAccessTravelDestination(const class FString& TravelDestination);
	bool CanBribe(const class FString& VariableName, EBribeDifficulty BribeDifficulty, int LevelOverride);
	bool CallGlobalConditional(const struct FGuid& GlobalScriptID);
	bool AlwaysFalse();
};


// Class Indiana.ConsumableAmmoPool
// 0x0028 (0x00A8 - 0x0080)
class UConsumableAmmoPool : public UAmmoPoolBase
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0080(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ConsumableAmmoPool");
		return ptr;
	}


	class UClass* GetNextConsumableClass();
};


// Class Indiana.ResourceItem
// 0x0028 (0x0140 - 0x0118)
class UResourceItem : public UItem
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0118(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ResourceItem");
		return ptr;
	}

};


// Class Indiana.ConsumableItem
// 0x00F0 (0x0230 - 0x0140)
class UConsumableItem : public UResourceItem
{
public:
	unsigned char                                      UnknownData00[0xF0];                                      // 0x0140(0x00F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ConsumableItem");
		return ptr;
	}


	void STATIC_OnStatUpdated(class URpgStat* Stat);
};


// Class Indiana.Container
// 0x0190 (0x0518 - 0x0388)
class AContainer : public AActor
{
public:
	unsigned char                                      UnknownData00[0x190];                                     // 0x0388(0x0190) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Container");
		return ptr;
	}


	bool IsLightEnabled();
	void STATIC_HandleItemRemoved(const struct FItemStack& ItemStack);
	void STATIC_HandleItemCountChanged(const struct FItemStack& ItemStack);
	void STATIC_HandleItemAdded(const struct FItemStack& ItemStack);
	void STATIC_GetItemsInContainer(TArray<class UItem*>* OutItems);
};


// Class Indiana.Conversation
// 0x00D0 (0x0188 - 0x00B8)
class UConversation : public UFlowChart
{
public:
	unsigned char                                      UnknownData00[0xD0];                                      // 0x00B8(0x00D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.Conversation");
		return ptr;
	}

};


// Class Indiana.ConversationActorInterface
// 0x0000 (0x0030 - 0x0030)
class UConversationActorInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ConversationActorInterface");
		return ptr;
	}


	struct FGuid GetSpeakerGameDataID();
	struct FConversationDescription GetConversationDescription();
};


// Class Indiana.ConversationBehaviorStateInfo
// 0x0018 (0x0138 - 0x0120)
class UConversationBehaviorStateInfo : public UEmpty_BehaviorStateInfo
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0120(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ConversationBehaviorStateInfo");
		return ptr;
	}

};


// Class Indiana.ConversationRequestData
// 0x0000 (0x0068 - 0x0068)
class UConversationRequestData : public UDecisionTreeEmptyRequestData
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ConversationRequestData");
		return ptr;
	}

};


// Class Indiana.ConversationBlueprintLibrary
// 0x0000 (0x0030 - 0x0030)
class UConversationBlueprintLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ConversationBlueprintLibrary");
		return ptr;
	}


	bool StartSlideshow(class UConversationData* Conversation, int* InstanceId);
	bool StartPlayerControllerConversation(class UConversationData* ConversationData, int StartNode, TArray<struct FCharacterDescription> OverrideCharacters, bool bAllowedDuringCombat, ECheckBranches* Branches, int* InstanceId);
	bool StartConversationWithActorInterface(const TScriptInterface<class UConversationActorInterface>& Actor, int StartNode, ECheckBranches* Branches, int* InstanceId);
	bool StartConversationByDescriptionAtNode(const struct FConversationDescription& Description, int StartNode, ECheckBranches* Branches, int* InstanceId);
	bool StartConversationByDescription(const struct FConversationDescription& Description, ECheckBranches* Branches, int* InstanceId);
	bool StartConversation(class UConversationData* Conversation, int StartNode, TArray<struct FCharacterDescription> OverrideCharacters, bool bAllowedDuringCombat, ECheckBranches* Branches, int* InstanceId);
	struct FCharacterDescription MakeCharacterDescription(class AActor* Actor);
	TArray<struct FSpeakerGameDataReferenceID> GetSpeakerGameDataReferences(class UConversationData* ConversationData);
	int EndConversation(int ConversationInstanceID);
	bool CanStartConversationByDescription(const struct FConversationDescription& Description, ECheckBranches* Branches);
	bool CanStartConversation(class UConversationData* Conversation, int StartNode, TArray<struct FCharacterDescription> OverrideCharacters, bool bAllowedDuringCombat, ECheckBranches* Branches);
	void STATIC_AssignAllParticipantsAsOverrides(class AActor* OverrideActor, struct FConversationDescription* Description);
	void STATIC_AddConversationEndedDelegate(int InstanceId, const struct FScriptDelegate& Event);
};


// Class Indiana.ConversationCamera
// 0x0118 (0x0230 - 0x0118)
class UConversationCamera : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x118];                                     // 0x0118(0x0118) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ConversationCamera");
		return ptr;
	}

};


// Class Indiana.ConversationCroppingComponent
// 0x0000 (0x0630 - 0x0630)
class UConversationCroppingComponent : public UBoxComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ConversationCroppingComponent");
		return ptr;
	}

};


// Class Indiana.ConversationData
// 0x0050 (0x0080 - 0x0030)
class UConversationData : public UObject
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0030(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ConversationData");
		return ptr;
	}

};


// Class Indiana.ConversationFramingComponent
// 0x0000 (0x02B0 - 0x02B0)
class UConversationFramingComponent : public USceneComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ConversationFramingComponent");
		return ptr;
	}

};


// Class Indiana.ConversationHistoryWidget
// 0x0028 (0x0248 - 0x0220)
class UConversationHistoryWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0220(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ConversationHistoryWidget");
		return ptr;
	}

};


// Class Indiana.ConversationInstance
// 0x03B0 (0x03E0 - 0x0030)
class UConversationInstance : public UObject
{
public:
	unsigned char                                      UnknownData00[0x3B0];                                     // 0x0030(0x03B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ConversationInstance");
		return ptr;
	}


	void STATIC_OnParticipantEndPlay(class AActor* Actor, TEnumAsByte<EEndPlayReason> Reason);
	void STATIC_OnCharacterDeath(class AActor* Instigator, const struct FCauseDamageInfo& CauseDamageInfo);
	void STATIC_OnCharacterCombatStateChange(bool bInCombat, bool bRestoring);
	bool IsCurrentSpeakerGameDataReferenceID(const struct FSpeakerGameDataReferenceID& SpeakerGameData);
	class AActor* GetPayloadActorChecked(EPayloadID Key, ECheckBranches* Branches);
	struct FSpeakerGameDataReferenceID GetCurrentSpeakerGameDataReferenceID();
};


// Class Indiana.ConversationInterface
// 0x0000 (0x0030 - 0x0030)
class UConversationInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Indiana.ConversationInterface");
		return ptr;
	}


	bool ConversationStarted(class AActor* Speaker, const struct FGuid& Guid, int NodeID);
